def GongXia1st(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """ 
凡紫微皆不喜行天机 、 天梁 、 巨门躔度的宫垣 ， 见 化忌尤劣 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子午宫独坐的紫微 ， 若为 [ 百官朝拱] 喜行至见 化禄 、 化权或化科的大限 、 流 
年 。 若原局紫微化权或化科而无 [ 百官朝拱] ， 则喜见昌曲 、 魁钺 、 辅弼诸曜同会的 
运 限流年 。 
若原为 『 在野孤君 』 的格局 ， 其年限虽见禄权科 ， 其 吉亦小 ， 恐只系一时得意 。 
若原为 [ 无道孤君 ] 的格局 ， 再 行煞忌并集的年限 ， 每每有灾祸 ， 而且必屠自招 。 
凡紫微皆喜行天府 、 天相坐守的宫垣。 子午宫独坐 者尤喜 。 
子午宫独坐的紫微喜禄存同度 。 唯 [ 在野孤君 ] 则 多 自私疑忌 。 行至煞忌刑并照 
的年限 ， 多尤怨是非 、 且往往酿成讼成事。子午二宫的紫微 ， 
见天机主破败 ； 见天梁主有厄 ， 但属虚惊； 见巨门主感情困扰 。 有吉化可解 ， 见刑 
煞克应 。 """
            print(tmp)
            print("\n")
        if(star == "紫薇破军"):
            tmp = """[ 紫破 ] 守命 ， 最忌为 【 在野 】 的格局 ， 行至机梁巨门 的运限 ， 常为一生运程的关 
键 ， 若见煞忌刑照 ， 其所发生的事端 ， 每每可以影响一生 。 亦不宣见太阳化忌的年 
限 ， 每每招惹是非尤怨 。 
[ 紫破 ] 守命 ， 原局武曲化忌 ， 大限行至 [ 武曲七杀 ] 同度的宫垣 ， 更行太阳化忌 
或巨门化忌的流年 ， 主因财而招祸 。 
[ 紫破 ] 不喜年限见天府 [ 空库 ] 、 [ 露库] ， 主破财 ； 若 天府得禄 ， 则仅主因财失 
义 。 
[ 紫破 ] 行至 [ 天同天梁 ] 坐守的年限 ， 逢天机化忌带 煞来冲 ， 处事必须厚道 ， 否 
则机心计较愈多 ， 破败愈大 。"""
            print(tmp)
            print("\n")
        if(star == "紫薇天府"):
            tmp = """ 
[ 紫府 ] 守命 ， 最 喜见禄 。 见禄存同度， 廉贞化禄来 会者 ， 主巨富 。 以见化禄 、 
禄存的年限为克应 。 一一如 [ 紫 府 ] 在寅 ， 甲年生人 ， 行至丁卯主得财或得替身发达 
的机遇 晋身发达的机遇 。 
[ 紫府 ] 喜行武曲独守的宫垣 ， 见流禄或贪狼化禄 、 廉贞化禄者 ， 主得财 。 若更 
有辅佐吉曜 ， 无煞忌刑曜会照 ， 原局 [ 紫府] 又结构吉利者 ， 白手而成巨富 。 
[ 紫府 ] 无禄 ， 行至见禄的年限亦吉 。 
[ 紫府 ] 有禄 ， 行至太阳独坐巳宫的年限 ， 见吉辅 ， 主 地位增高 。 太阳在亥宫者 
次之 。 
[ 紫府 ] 守命宫 ， 逆行者 ， 以太阳守垣或武曲守垣的大限 ， 为一生命运的枢纽 ； 
顺行者 ， 以贪狼大限 ( 武曲在对宫 ) ， 或巨门大限 ( 太阳在对宫 ) 为枢纽 。 为吉为凶 ， 
影响一生甚大 。 """
            print(tmp)
            print("\n")
        if(star == "紫薇贪狼"):
            tmp = """[紫贪 ] 在命宫 ， 喜见火铃 ， 亦喜见贪狼化禄 ， 主骤然而兴 ， 而且持久 。 若贪狼 
化忌 ， 则一生多劳累 ， 且不如意 。 若更煞重 ， 则往往功败垂威 。 
女命 [ 紫贪 ] ， 不喜行至太阳在夫妻宫的年运 ， 主遇人不淑 。 男命 [ 紫贪 ] ， 不喜夫妻宫见天同 ( 或巨门 ) 的年运 ， 主陷入感情罗网 ， 难以 自脱 。 
[ 紫贪 ] 守命见 [ 武越破军 ] 而武曲化忌者， 行至此大限 ， 更见文昌化忌或文曲化忌 
的流年 ， 主生破败 。 
[ 紫贪 ] 守命在卯宫 ， 行至天梁在午 宫的大运或流年 ， 若天梁化禄 ， 则贪财好色 
皆易引起麻烦 ， 更见煞曜则有凶祸 ， 唯终能化解 。 
[ 紫贪 ] 守命者 ， 以太阳 、 巨门相会的宫垣 ； 或 『 天机 太阴 』 同躔的宫垣 ， 为一 
生命运的枢纽 。 """
            print(tmp)
            print("\n")
        if(star == "紫薇天相"):
            tmp = """[ 紫相 ] 守命 ， 逢 [ 杀破狼 ] 流年 ， 皆主变动 ， 吉凶视 星曜组合性质而定 。 
[ 紫相 ] 守命 ， 行至 [ 紫相 ] 为 [ 疾厄宫] 的大 运 ， 防心脏病 。 
『 紫相 』 守命 ， 行至 [ 紫相 ] 为 『 夫妻宫 』 的大运 ， 防婚 姻破裂 。 
『 紫相 』 守命 ， 行至大运遇 [ 武曲天府] ， 若武曲化忌 ， 或天府 [ 空露 ] ， 则主因 
人事反复而招致破败 ( 如 失业 、 停 业 、 倒闭之类 ) 。 
『 紫相 』 在命宫 ， 更行 『 紫相 』 守命的流年 ， 一般情形 下不宜与人合作 ， 翌年 
即有反复 ， 合作绝不持久 。 
[ 紫相 ] 守命宫者 ， 不喜贪狼化忌 。 任何宫垣遇之 ， 皆 生此宫垣所主的克应 。 一 
一如行至 『 父母宫 』 见贪狼化忌的 大运或大限 ， 主赏识自己的上司主管被更换 ； 行 
至 [ 夫妻 宫 ] 见贪狼化忌的流年 ， 主感情发生变化 。 
[ 紫相 ] 守命的人 ， 逆行者以贪狼 、 [ 武曲天府 ] 大限为 命运的枢纽 ，， 顺行者 ， 以 
七 杀 、 廉贞守限的宫度 ， 为命运 的枢纽 。 """
            print(tmp)
            print("\n")
        if(star == "紫薇七杀"):
            tmp = """[ 紫杀 ] 守命 ， 财帛宫 【 武贪 】， 若见火铃 ， 主横发横 破 ， 暴发暴败 。 发后必须善 
于自保 ， 然后始可持盈保泰 。 
[ 紫杀 ] 而紫微化权 ， 则一生财力不足以济其事业 。 
【 紫杀 】 守命 ， 主责任心重 ， 癸年生人者 ， 事业宫 [ 廉 破 】 而破军化禄 ， 更主多 
负额外责任 ， 事事亲力亲为 。 
[ 紫杀 ] 在命宫者 ， 以 【 太阳巨门 】 为枢纽 。 太阳在寅 宫较申宫为佳 ， 但仍视星 
曜吉凶而定 。 
女命 [ 紫杀 ] ， 婚姻多不如意 。 若命宫、 夫妻宫见煞 ， 又不善克制 ， 则易屡屡变 
更感情 。 
【 紫杀 】 守命者 ， 以天相 、 『 武曲贪狼』 大限为命运的枢 纽 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫天机独坐 ， 最喜化权 。 天 机化权又优于巨门 化权 。 化权则稳重 ， 所以较 
化禄之多浮躁不定者为佳 。 
子午宫天机 ， 若对宫巨门化权 ， 在现代可能仅为财 经界之销售人才 ， 不主策划 
管理 。 天机化权 ， 则可幕后策划 。 一 外 一内 ， 性质不同 。 
子午宫天机 ， 丁年生人多劳累 ， 疾厄宫天相又为刑 忌所夹 ， 易患胆石 、 肾石 。 
子午宫天机最不宜与火铃同度 . 主幼年即离父母 ， 或父母境遇有变动 ，。 以致影
响幼年时的福荫 。 
子午宫天机行至 [ 武曲七 杀 ] 同度的宫垣 ， 见禄权科则吉 ， 见化忌则凶 ， 此为一 
生命运的关键 。 
子午宫天机行至天府宫度 ， 见府库充 盈者则吉 ， 见 府库空露则必凶危 。 """
            print(tmp)
            print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """丑未宫天机守命 ， 太阴守身宫者 ， 主人日夜奔忙 ， 常于夜班工作 ， 或暮夜仍须 
计划思量 。 不见煞 ， 经商可成富格 。 
丑未宫天机主擅口才 ， 若羊陀同度 ， 又见巨门化忌 来会 ， 则口才化为口舌 。 适 
宜从事以口舌求财的职业 。 
未宫天机 ， 夫妻宫太阳在巳 。 若化为权禄者 ， 主与 异族通婚 。 丑宫者不然 。 
丑未天机最喜化禄 ， 则对宫天梁化权， 为计划 、 研 究人才 ， 又不可以经商的命 
视之 。 福德宫太阴同时化忌 ， 则 为劳心费神的克应 ， 并不是凶兆 。 
丑未天机与空劫同度 ， 其人有独特的 思想 ； 与天才 同度 ， 智慧极高 。 但两种情 
形都主不易为人理解 ， 所以必 须 [ 兄弟宫 ]及【 父母宫 】 见吉星祥曜 ，， 然后始能卓立 ， 
否则反易浮沉 。 
丑未天机 ， 以太阳 、 太阴踺度的宫垣， 为大限的枢 纽 ， 以天同 、 巨门踺度的宫 
垣 ， 为流年的枢纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """寅申宫 【 天机太阴 】 同度 ， 为 [ 机月同梁 ] 韵正格 。 申宫天梁在子 ， 优于天梁在 
    午故尤怨是非较少 。 
    寅申 【 机月 】 最不宜化忌 ， 主其人多权术 。 在寅 宫者 ， 尤主喜弄权柄 。 
    寅申 [ 机月 ] 遇天梁化禄 ， 大限行至巨门躔度 ， 或天同躔度的宫垣 ， 常易招灾非 ， 
    必须谦退和厚 ， 然后始能平 安渡过 。 
    寅申 【 机月 】， 须福德宫巨门遇吉星始佳 ， 若巨门与 煞忌同度 ， 则流年行至 [ 廉贞 
    七 杀 ] 所躔的宫度 ， 每易招破 败 。 """
                print(tmp)
                print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯酉宫 [ 天机巨门 ] 同度 ， 必须见禄始吉。 最不喜火 星铃星同躔 ， 主轻薄 、 破荡 。 
    卯酉 [ 机巨 ] ， 以 [ 太阳太阴 ] 躔度的宫垣， 为流年的 枢纽 。 最不喜太阳化忌 ， 若刑 
    煞重重 ， 流年忌星又冲起太阳化忌者 ， 主因积怨而招重大风波 。 
    卯酉 [ 机巨 ] 行至太阴化忌的大限 ， 往往易生破败 。 其破败又往往因自作聪明而 
    来 。 
    卯酉 [ 机巨 ] 男命直门化禄者 ， 主老夫配少妻 ； 天机化禄者 ， 则多再婚 。 女命巨 
    门化 禄者 ， 亦以长配为宜 ， 天机化禄耆 ， 亦多婚姻上的缺憾 。 
    卯酉 [ 机巨 ] ， 女命见天同与禄存同度者 ， 行至贪狼 运 ， 每主受人遗弃 ， 婚姻波 
    折 ， 故不宜早婚 。 酉宫者虽较吉 ， 唯亦嫌桃花过重 。 天同主感情 ， 故有此克应 。 
    卯酉 [ 机巨 ] 以 [ 太阴太阳 ] 同躔的宫度， 以及七刹守 跻的宫度 ， 为大限的枢纽 ， 
    其吉凶影响一生甚大 。 [ 刹破狼 ] 宫限 ， 则为流年的枢纽 。 """
                print(tmp)
                print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """辰戌二宫 [ 天机天梁 ] 同度 ， 主技艺 ， 现代亦可订定 为专业人才 。 不宜从政从商 ， 
    否则福不耐久 ， 好运每昙花一现 。 
    辰戌宫 【 机梁 】， 为 【 机月同梁 】 的偏格 ， 必须以口舌 求财 始能展所嵌 。 故在现
    代 ， 往往又为带技术性质的推销人才 。 
    辰戌 『 机梁 』 有空曜及煞曜同躔 ， 古人订定为僧道之 命 ， 现代亦为传教士 。 女 
    命多伶仃 。 
    辰宫 【 机梁 】， 而天机化忌者 ， 必须藉口舌以求财 。 不化忌者 ， 主与异族通婚 。 
    辰戌 [ 机梁 ] ， 以 【 武贪 】 所蹿宫度为大限枢纽 ； 以 [ 紫 杀 ] 、『 廉破 』、 [ 武贪 ] 三宫 
    垣为流年枢纽 。"""
                print(tmp)
                print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥宫天机 ， 与 火铃同度 ， 为背井离乡的命 ； 或主祀出 ； 或少年不利父星 。 
巳亥天机行至七杀守垣的大限 ， 若煞忌刑并照者 ， 主有严重目疾 。 
巳亥宫天机 ， 一生多感情困扰 。 若 『 夫妻宫 ] 太阳化 禄 ， 或 【 迁移宫 】 太阴化禄 
者 ， 则情欲甚重 ， 更见煞曜 ， 桃花诸曜 ， 则易淫滥 。 
巳亥夫机 ， 女命不宜化忌或有忌星会照 ， 更见煞 ， 主刑克生离 ， 或偏房侍妾 。 
巳亥天机见辅佐吉曜 ， 则能富贵 ， 以公众服务事业 为宜 ， 特别宜交通 、 通讯行 
业 。 
巳亥天机以 [ 天同巨门 ] 、 『 廉贞天府 』 两宫垣为流年 的枢纽 。 以 『 杀破狼 』 为大 
限的枢纽 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """凡太阳在命宫庙陷 ， 及为日生人或夜生人 。 入庙又 为日生人则最吉 ， 夜生人次 
之 ； 落陷又为夜生人最凶 ， 日生人稍减 。 
太阳在命宫 者 ， 须留意巨门在何宫度， 及有煞或无 煞 。 若巨门带煞 ， 则太阳在 
庙旺之地尚可 ( 日生人尤利 ) ， 不过谋力化费而已 。 若落陷地 ( 夜生人更劣 ) ， 则必为 
巨门 所暗 ， 应详巨门在何宫度而论吉凶 。 例如太阳在子落陷 ， 巨门在辰 ， 陀罗同度 
为 [ 事业宫 ] ， 则日生入主从事费心力 、 劳口舌之行业 ， 夜生人则主一生费力而不讨 
好 ， 且易为事业而担心 。 
太阳在命宫者 ， 又须留意天梁在何宫度 。 巨门暗 、 天梁孤 。 凡太阳入命已不利 
男亲 ， 若天梁更与孤辰 、 寡宿 、 天刑及煞曜同度 ( 尤忌火铃 ) ， 则主刑克 ， 唯仍须详 
天梁所 在宫度而推断细节 。 如太阳在子落陷 ， 天梁与擎羊同 度在午宫 ， 为 [ 迁移宫 ] ， 
- 则曰生人仅主背井离乡与父生离 ， 夜 生人则或主由生离变成死别 。 又如 [ 太阳太阴 ] 
在丑 ， 天梁 在巳为 [ 事业宫 ] ， 如见煞曜空劫 ， 日生人仅主不继父业 ， 及 发展自己事 
业时无尊亲之力支持 ， 夜生人则主祖业破败然后自立 。 举此两例 ， 余例可知 。 
太阳落陷化忌 ， 更与火铃同度 ， 夜生人多主少年克 父 ， 晚年丧子 。 若日生人 ， 
男性六亲亦不利 。 倘更见天刑 ， 则无论日夜生人均主官非词讼缠绕 。 

太阳在命宫 ， 太阴守身宫于辰戌 ， 主离乡背井 。 

"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """太阳在子午二垣 ， 若化禄 ， 早岁不利， 中年即可发 越 ； 若化忌 ， 则少年自立后 ， 
中年仍防破败动荡 。 
太阳在子午二垣 ， 以 [ 天机 太阴 ] 及天同 、 巨门所在 之宫垣 ， 为大运之枢纽 ； 以 
巨门 、 天梁 ，、 天同二天相所在宫垣 ， 为流年之枢纽 。 有时亦须以 [ 天机太阴 ] 之对宫 
为流 年枢纽 ( 此宫必无正曜 ， 一借 [ 机月 ] 安星 ) 。 """
            print(tmp)
            print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """太阳在丑未二垣 ， 必须见辅佐吉曜群集 ， 然后始佳 ； 不见辅佐 ， 虽无煞亦不外 
平平 ， 倘见煞而无吉 ， 则动荡无根 ， 或不守一业 。 若吉凶并集 ， 亦不为美 ， 主人易 
起易跌 ， 而且于流年大运不佳时 ， 易生消极之心 。 
太阳在丑未二垣 ， 以 [ 紫微天相 ] 破军、 [ 天机巨门 ] 为流年大运之枢纽 。 如原无 
禄者 ， 喜行化禄的运限 。 若太阳化禄 ， 行圣太阴化禄的运限 ” 最为佳美 。"""
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """太阳在寅申二宫 ， 以从事服务业为最宜 ， 仅于辅佐吉曜齐集 ， 且见 『 百官朝拱 』 
的情形下 ， 始主可自行独立发 展 ， 唯其事业仍须带服务色彩 。 
凡太阳在寅申二宫 ， 多主不利婚姻 ， 以迟婚为佳 。 
太阳在寅申宫守命 ， 易得糖尿病 ， 古人谓之消渴 ， 所主者为 [ 上消 ] ， 即多食不 
饱 ， 且喜肥腻 。 尤以在寅宫为 然 。 
太阳在寅申宫 ， 巨门化忌 ， 尚可从事口舌以求财的 行业 ， 若太阳化忌 ， 在申宫 
者尤主一生受人拖累 。 在寅宫者 ， 女命主配夫不淑 。 
太阳寅申宫守命 ， 以 [ 紫微 七 杀 ] 、 天相 、 [ 天同太阴 ] 各宫垣为枢纽 。 尤喜见天 
同化禄 、 太阴化权 、 紫微化科 。  """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """太阳在卯酉二宫 ， 以构成 [ 阳梁昌禄] 格局者为佳 。 在 卯宫声名较显 ， 在酉宫者 ， 
则仅得声名于一定范围之内 ， 而不为公众所知 。 """
            print(tmp)
            print("\n")
            if(star == "太阳天梁"):
                tmp = """
[ 太阳天梁 ] 在巧宫者擅长思考 ， 在酉宫者则擅长记 忆 。 
[ 太阳天梁 ] 虽见吉星 ， 亦主离乡背井成家 ， 唯必有 父母荫庇之力 。 
酉宫 [ 阳梁 ] ， 倘又系夜生人 ， 主不利婚姻 ； 日生人 初恋多失败 。 
卯宫 [ 阳梁 ] 以太阴所在宫垣 ， 为主宰命运的枢纽 ； 酉宫者 ， 以天机所在宫垣为重 
要枢纽 。  """
                print(tmp)
                print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """太阳在辰 ， 太阴在戌 ， 为 [ 日月全璧 ] 一一若见辅佐 吉曜及吉化 ， 主人富贵 ； 反之 ， 
若太阳在戌 ， 太阴在辰 ， 则 为 『 日 月失辉』， 主殉变迁动荡 。 
太阳在辰戌化科 ， 对宫太阴化权 ， 宜为财赋之官 ， 亦宜于大机构掌财权 。 
辰戌二宫太阳 ， 以太阴 、 天机 、 [ 同梁] 宫垣 ， 为大 限流年之枢纽 。 """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥二宫太阳独坐 ， 巳宫者远胜亥宫。 巳宫可得异 族助力 ， 亥宫仅主口舌困扰 。 
亥宫太阳守命 ， 若 『 福德宫 』 天机吉者尚可补救 ， 若 天机化忌 ， 或会恶煞刑忌 ， 
则心志插弱 ， 且一生多功成垂败 ， 又招是非尤怨 。 必须以毅力作后天补救 。 
巳宫 太阳守命 ， 若昌曲会于 [ 夫妻宫]者 ， 主得美妻 ， 且得岳家之力 。 
亥宫太阳易患神经衰弱 ， 怔忡 。， 
巳亥宫太阳见煞 ， 皆主目疾 。 
巳宫太阳以太阴 、 [ 廉贞天相 ] 、 七 杀为命运的枢纽 。 
亥宫太阳 ， 以 【 紫微天府 】、 贪狼 、 天梁等富垣为运 限流年的枢纽 """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为财星 。 细别之 ， 又为生财的行动 ， 与太阴之 为生财计划不同 。 故古人以 
太阴属文 ， 武曲属武 。
古诀 ： 辰年生人 ， 命宫武曲在辰 ； 戌年生入 ， 命宫 武曲在戌 ； 丑年生人 ， 
武曲为 【 寡宿 】， 故不宜女命 。 纵有婚姻 ， 亦主妇夺 夫权 。 在现代 ， 往往为事业 
驾凌丈夫的徵兆 ， 且主迟婚 。 
"""
        print(tmp)
        print("\n")
        if(star == "武曲天府"):
            tmp = """
『 武曲天府 』 其气最和 ， 故古代以为最宜女命 。 现代 无论男女 ，【 武府 】 得禄 ， 
更见天魁天钺 ， 定主于财经界得意 。 若无魁钺 ， 但见辅弼亦吉 。 见昌曲 ， 仅主聪明 ， 
不主得意 。 
[ 武曲天府 ] 以天同 、 [ 太阴太阳 ] 二垣为人生枢 纽 。 此 二宫垣喜见吉星吉化 ， 则 
少年享受 、 中晚年福泽亦厚 。 若见煞忌刑曜 ， 则少年不吉 ， 中晚年亦受影响 。 
[ 武曲天府 ] 以贪狼 、 [ 紫微天相 ] 、 七杀 、 破军各垣为 流年之枢纽 。 
丑未二垣 [ 武曲贪狼 ] 守命 ， 火 星或铃星同度最吉 。 在 [ 财帛 ] 、 [ 田宅 ] 二宫亦吉 。 
古诀 ： [ 武曲贪狼财宅位 ， 横 发资财 ] ， 即指此而言 。 无煞者吉 ， 有煞 ， 则主横发横 
破 。 
"""
            print(tmp)
            print("\n")
            if(dizhi == "子" or dizhi == "午"):
                tmp = """[ 武曲天府 ] 在子午宫 ， 以午宫较佳 。 古诀虽云 [ 武曲 天府同宫主有寿 ] ， 唯在子 
宫守命若无安者 ， 嫌 [ 父母宫 ] 太 阳落陷 ， 恐少年主孤 ， 或难得父母荫庇 ， 故不如午 
宫 。 """
                print(tmp)
                print("\n")
        if(star == "武曲贪狼"):
            tmp = """『 武曲贪狼 ] 与火铃同度 ， 见禄主富； 见魁钺 、 辅弼 主贵 ， 或其富亦由贵而来 。 
[ 武贪 ] 化忌 ( 武曲化忌尤甚 ) ， 见火铃， 作见煞论 。 然亦主聪明 ， 有特殊技艺可 
以谋生 。 现代亦可从事工程工艺 。 
[ 武曲贪狼 ] 以 [ 太阳巨门 ] 、 [ 天同太阴] 为人生枢纽 。 少年运程之优劣 ， 可以影 
响一生 。 
『 武曲贪狼 ] 以天府 、 [ 廉贞破军 ] 、 [ 天机天梁 ] 为流年 之枢纽 。 
[ 武曲贪狼 ] 在身宫者 ， 不及在命宫 。 若见煞忌刑曜 ， 主一生多凶险 。 若与火铃同 
度 ， 亦主横发随即横破 。 
"""
            print(tmp)
            print("\n")
            if(dizhi == "丑" or dizhi == "未"):
                tmp = """
 命宫 [ 武曲贪狼 ] 在丑 ； 未年生人 ， 命 宫 [ 武曲贪狼] 在未 ， 主人得立 战功 ! 亦以军功起家 。
"""
                print(tmp)
                print("\n")
        if(star == "武曲七杀"):
            tmp = """ 总之 ， [ 武曲 七 
杀 ] 同宫 ， 为带危险性的星曜组 合 。 [ 武杀] 本宫不见煞忌则无妨 ， 若在本宫外见煞忌 ， 
反宜 武职 ， 可立功勋 。 
[ 武曲七杀 ] 以 『 天同天梁 』 、 太阳 、 太阴所在宫垣 ， 为 大运枢纽 ； 以 [ 廉贞贪狼 ] 、 
[ 紫微破军 ] 及本宫 [ 武杀 ] 为流 年枢纽 。 
"""
            print(tmp)
            print("\n")
            if(dizhi == "卯" or dizhi == "酉"):
                tmp = """
 卯宫 【 武曲七杀 】 守命 ． 见煞忌则主意外 。 古诀云 ： [ 恶煞耗囚会竽震宫 ， 主 
木历雷惊 ] 。 酉宫者 ， 则为争财动 武之兆。 古诀云 ： [ 武曲劫煞会擎羊 ， 因财持刀 。 ] 
古诀 ：【 武曲羊陀兼火宿 ， 丧命因财 】， 亦指卯酉宫 [ 武杀 ] 而言 。
"""
                print(tmp)
                print("\n")
        if(star == "武曲天相"):
            tmp = """ 
[ 武曲天相 ] 与昌曲同会 ， 主聪明巧艺。 古诀 ： [ 武曲 天相昌曲逢 ， 聪明巧艺定无 
躬 ] ， 即指此而言 。 现代亦为工 艺工程之兆。 
[ 武曲天相 ] 与文曲同度 ， 更见桃花诸曜 ( 天姚尤 甚 ) ， 主为人轻浮 ， 不安本业 。 
必须加以后天克制 ， 始能凭 毅力创立事业。 

[ 武曲天相 ] 守命 ， 若 [ 财帛宫 ] 之 [ 廉贞天府 ] 见廉贞 化忌 ， 宜从凶事以求财 。 在 
现代 ， 饮食 、 医药 、 外科 、 化 验等皆属 【 凶事 】。 在古代则主屠宰 、 阉鸡之类 。 皆要 
不离服务于人的性质 。 
[ 武曲天相 ] 最喜 [ 迁移宫 ] 破军化禄 ， 则虽居佐贰之 位 ， 亦有声有色 ， 且一生多 
负所难能的重任 。 
[ 武曲天相 ] 与文曲同 度 ， 对宫天马而无化禄 、 禄存 ； 星曜吉煞混杂 ， 古代以为
乃优伶之命 。 
[ 武曲天相 ] 以 [ 太阳天梁 ] 、 天机 、 太阴为大运枢纽 ； 以七杀 、 破军 、 贪狼 、 紫 
微所在宫垣为流年枢纽 。 
  """
            print(tmp)
            print("\n")
            if(dizhi == "寅" or dizhi == "申"):
                tmp = """[ 武曲天相 ] 在寅申二宫守命 ， 多主为人服务 ， 为佐 贰之才 ， 不宜独当 面 。"""
                print(tmp)
                print("\n")
                if(dizhi == "寅"):
                    tmp = """[ 武曲天相 ] 坐命寅宫 ， 贪狼在子宫守身 ， 若身宫有 煞忌同会 ， 则逢子年有水险 ， 
以流煞流忌冲会之年为克应 。 """
                    print(tmp)
                    print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌二宫武曲独坐 ， 见吉亦主财权 ； 见煞 ， 则为商 贩 ， 绝不宜从事武职 。 
辰戌武曲必与贪狼相对 ， 其性质与丑未宫 [ 武贪 ] 同 意 。 大运流年之枢纽亦同 。 
辰戌武曲守命 ， [ 迁移宫 ] 贪狼与火铃同度 ， 不主离 乡 ， 背井 ．， 仅主突发 。 若命 
宫有火铃 ， 反主离乡背井以立业 。  """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """巳亥 【 武曲破军 】 与火铃同度 ， 主破祖成家 。 见吉化 吉曜 ， 则一生多负重任 ， 
    或经常负担额外工作 。 
    [ 武曲破军 ] 在 命身 ， 多喜与人合作 ， 故宜详视 【 兄弟 宫 】 之吉凶 。 
    亥宫 【 武破 】 多是非动荡 。 盖 [ 父母宫] 太阳在子落 陷 ， 一生荫庇之力不足 ， 不 
    为上司推心置腹 。 唯壬年生人 ， 虽武曲化忌 ， 但太阳得天梁化禄来拱 ， 始主得人提 
    拔赏识 。 故 【 武破 】 化忌 ， 是为 [ 反背 ] 反主吉祥 。 
    【 武曲破军 】 以太阳 、 [ 天机太阴 ] 、 天同为大运枢纽 ； 以太阳 、 天梁 、【 紫微贪 
    狼 】 、 [ 天机太阴 ] 为流年之枢纽 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """一天同入十二宫皆有缺点 ， 古人云 ， 入十二宫皆为福 泽 ， 乃指其终能克服缺点 
而言 。 如在命宫 ， 主人白手兴家 ， 即须留意其父母有无破败 ， 或 少年运程有无破败 。 
天同主情绪 ， 所以当辅佐诸曜会集之时 ， 反而未必 是吉 ， 因为可以产生依赖性 ， 
使人生容易因小成就即躯于安乐 。 
天同为纯粹精神型的星曜 ， 喜受激发， 然后始有奋 发之心 ， 所以见煞曜及化忌 ， 
有时反而主历艰危而后获吉 。 
天同见刑重重 ， 主精神困扰 。 若再见天刑 、 天虚 、 大耗 、 阴煞等杂曜 ， 而天同本 
身又化为忌星者 ， 防精神疾病 ， 及心理不平衡引起之病患 。 再见吉者 ， 亦主饱受精 
神压力 。 
由于天同喜受激发 ， 除非原局煞忌刑耗重重 ， 否则 一 般喜行 七杀守垣的宫限 。 
此宫限稍见吉曜 ， 且于 [ 三方四 正 ] 得 禄 ， 一即为奋发之运程 。 无论大限流年均如是 
广亟须注意 。 

"""
        print(tmp)
        print("\n")
        if(star == "天同巨门"):
            tmp = """[ 同巨 ] 组合 ， 若巨门化忌 ， 则天同必同时化为权星 。 天同化权可以稳定情绪 ， 
巨门化忌则生激发 ， 唯此时 ， 若在丑宫者 ， 则为羊陀照射 ， 在未宫者 ， 则必与擎羊 
同芳 ， 激发太过 ， 反成困扰 ， 故反不如辰戌宫天同与巨门相对之佳 。 
【 同巨 】 除以 七 杀宫垣为运 限的枢纽外 ， 另以 [ 太阳太 梁 ] 、 太阴 、 破军 、 天机 
等宫垣为年限的枢纽 。 
凡 [ 同巨 ] 与陀罗同度者 ， 主烦恼 。 人生必经巨大风 波而后奋发 。 奋发之运 ， 男 
命宜行七杀 ， 女命宜行 [ 廉贞天 府 ] 。  
 
 """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """子午宫 ， [ 天同太阴 ] 同度 ， 以子宫为吉， 因午宫太阴 落陷 ， 更影响天同的情绪不 
    稳定 。 若再见煞 ， 则主阴阳不调 ， 内分泌不平衡 ， 阴虚等神经性疾患 。 不见煞亦主
    神经过敏 。 
    午宫 【 天同太阴 】 见吉 ， 而擎羊同度 ， 称为 [ 马头带 箭 ] 。 丙年生者天同必同时化 
    禄 ， 较戊年生人太阴化权 ( 亦 必同时见天机化忌 ) 为佳 。 戊生人历艰危而立业后 ， 又 
    常 因疑忌后生破败 。 丙生人立业后 ， 福泽较厚 。 
    子宫 [ 天同太阴 ] 虽不如午宫 [ 马头带箭 ] 之吉 ， 但却 远胜于不成格忆的午宫 [ 天同 
    太阴 ] 因 能借会寅宫 [ 巨阳 ] ， 倘见吉化 ， 主受异族提拔 。 女命往往与异族通婚 。 尤以 
    子宫无正曜 ， 借午宫 [ 同阴 ] 安星者为然 。 或午宫无正曜 ， 借 子宫 [ 同阴 ] 者亦然 。 
    子午 [ 同阴 ] ， 最不喜天同或太阴化忌 ， 行至天相守 垣的宫度 ， 无论流年或大限必 
    有缺点 ， 一般为挫折性的年限 。 若丁年生人 ， 天同化权 、 太阴化禄 ， 则福德宫巨门 
    必化忌 ， 宜从事是非口舌以示财的行业 。 女命行至天相运 ， 仅防婚姻挫折 。 
    子午 [ 同阴 ] 见煞 。 以杀 、 破 、 狼年运为枢纽 ； 不见 煞而见吉 ， 以 [ 紫杀 ] 、 天相 [ 机 
    梁 ] 宫垣为年运的枢纽 。 
    """
                print(tmp)
                print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """丑未宫 [ 天同巨门 ] 。 巨门为暗曜 ， 影响带情绪色彩 的天同 ， 故此星曜组合本身 
    已有缺点 。 如天同化忌 ， 则心志卑弱 ， 或有隐痛 ； 巨门化忌则主人生的隐痛由自己 
    主动招惹而来 。 
    丑未宫 [ 同巨 ] ， 化禄则财禄丰盈 ， 然仍不免有隐衷 。 必须巨门化权 ， 或会科权 
    吉化然后始主情绪稳定 ， 可以避免不足为外人道的隐痛 。 """
                print(tmp)
                print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            if(star == "天同天梁"):
                tmp = """寅申宫 [ 天同天梁 ] 同度 ， 成 [ 机月同梁 ] 格 。 此结构 ， 较以 [ 机月 ] 为命宫的 [ 机月 
    同梁 ] 格稳定 。 唯天同主情绪 ， 梁主原则 ， 二曜同宫 ， 仍难免有矛盾冲突 。 
    寅申 『 同梁 』 仍以见禄权为佳格 。 见化科 ， 则谨清贵 ， 有相当地位 ， 但不富有 ， 
    收入随地位而决定 。 
    寅申 [ 同梁 ] 不利婚姻 ， 夫妻宫巨门化忌者尤然 。 
    寅申 [ 同梁 ] 以 [ 武 杀 ] 、 巨门 、 太阴 、 太阳宫垣为流 年大运的枢纽 。  """
                print(tmp)
                print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫天同独坐 ， 与太阴相对 ， 以太阴在酉为佳 。 若丁年生人 ， 四化齐会 ， 因 
巨门在财帛宫犯忌 ， 故不主激发 ， 仅主口舌求财 ， 否则便成是非口舌 。 
酉宫天同 ， 若对宫太阴化忌 ， 易丧志 ， 或多自卑 。 卯宫天同 ， 对宫太阴化习 ， 
则主权术 。 
卯酉宫天同 ， 若会巨门化禄或巨门 化忌 ， 则亦易生隐痛 ， 尤主苦恋畸恋 ， 一如 
丑未宫的 [ 同巨 ] 。 
卯酉宫天同以天机 、 七杀 、 天梁 、 巨门为年限枢纽 。 """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫天同对巨门 ， 亦有 [ 同巨 ] 的特质 。 唯戌宫天 同 ， 喜对宫巨门化忌激发 ， 
称为 [ 反背 ] 主艰辛创业 ， 必 须注意调和人际关系 ， 影响事业成就甚大 。 
辰宫天同 ， 对宫巨门化忌 ， 所以不成 [ 反背 ] ， 乃因 所会天梁在子 ， 不如戌宫会 
天梁在午之孤忌 ， 所以人生较顺遂 ， 然而却少否极泰来以成大业的性质 。 
辰与宫天同 ， 一般均有主观成见 ， 故不宜与人合作 事业 。 
辰戌天同以 [ 廉杀 ] 天 梁 、 巨门 、 『 机阴 』 为年运枢 纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天同 ， 以巳宫为佳 。 亥宫青是一对宫天梁在巳 ， 易带来是非词讼克害 。 
天同与天梁相对 ， 有惰性 ， 故宜慎交友 ， 易交损友 ， 以致影响一生 。 
巳亥天 面最嫌化忌 ， 尤其是亥宫 ， 主一生辛劳 ， 流 离无依 。 邑宫者尚可自立 ， 
唯必须寻求稳定 ， 不可见异思迁 ， 然后始可立业 。 
巳亥天同于小成时 ， 切不可与人合作 ， 否则 凶终隙末 。 
巳亥天同破军 、【 天机巨门 】、 七刹 、 廉贞为年限的枢纽 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞主感情 。 感情生于心 ， 故又主血 。 廉贞化忌 ， 于人际关系为感情的伤害 ， 
于人身疾病即为脓血之灾 。 
廉贞既主感情 ， 与桃花诸曜同会 ， 便转变为男女感 情 ， 因而便称为 [ 次桃花 ] 。 
[ 次 ] 
乃相对贪狼的 [ 正桃花 ] 而 言 。 贪狼主行动 ， 廉贞主思想 ， 故称为 [ 次 ] 。 换言之 ， 贪 
狼的 桃花主徵歌逐色 ， 廉贞的桃花却主刻骨铭心 。 
廉贞又为政治 ， 或为对政治的狂热与理想 。 [ 廉贞天 相 ] 星系 ， 尤其具此性质 。 此 
性质转化则为手段与手腕 。 此 又与贪狼的人际关系倾向于酒肉不同 。 
廉贞浮 躁 ， 属于精神方面 ； 贪狼轻佻 ， 则属于行为举止 。 故廉贞喜天相 ， 转化为 
灵活政治手腕及服务性质 ； 而贪狼则喜武曲 ， 转化为求财手段的灵动圆滑 。 
廉贞可文可武 ， 故古人云 ： [ 遇文昌好礼乐 ， 遇煞曜 显武职 。 ] 此意最宜体会 。 故 
昌曲桃花同躔 ， 则为诗酒风流 ； 与破军同度 ， 见煞 ， 则主武职 ， 或带凶险 、 持利器 
的行业 。 最喜与天府同度 ， 会午宫的 紫微 、 寅宫的 [ 武曲天相 ] ， 则 为良好的基本结 
构 。 见吉曜可成大器 。 此即源于廉贞文武皆宜的特性 。 
"""
        print(tmp)
        print("\n")
        if(star == "廉贞天相"):
            tmp = """[ 廉相 ] 除丙年生人以天同 、 武曲二垣为枢纽外 ， 余 者为 、『 紫府 』 武曲 、 巨门 、 
破军各垣为大运流年的枢纽 。 
 """
            print(tmp)
            print("\n")
        if(star == "廉贞天府"):
            tmp = """[ 廉府 ] 见禄 ， 又有辅佐吉曜 ， 可任职财经界 ， 或为 财武之宫 。 更见左右最吉 。 
[ 廉府 ] 又为 [ 日月 夹 ] ， 故戌宫优于辰宫 。 若会诸吉 ， 大富大贵 。 
[ 廉 府 ] 以破军 、 贪狼 、 [ 阳梁 ] 、 昌曲所在宫垣为大运 流年的枢纽 。 

 """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """子午宫 [ 廉贞天相 ] 同度 ， 其气较和 ， 与卯酉宫的 [ 廉 贞破军 ] 其气躁决不同 。 二 
    者恰为相反的典型 。 
    子午 [ 廉相 ] 最嫌火铃同度 ， 主重大挫折 ， 或且可发 展为自杀的倾向 。 尤其是当廉 
    贞化忌冲会武曲化忌 ， 又见羊陀 、 天刑冲会 ， 此倾向更确 。 
    子午 [ 廉相 ] ， 丙年生人化忌 ， 行至天同宫垣横发 ， 至武曲宫垣则防横破 。 
    子午 [ 廉相 ] 最喜 [ 财荫夹 ] ， 或廉贞化禄或地宫破 军化禄 ， 则主富贵 ， 然而仍不离 
    佐贰 、 服务性质 。 
    """
                print(tmp)
                print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未宫 [ 廉贞七杀 ] 唯未宫可以构成 ， [ 雄宿乾元 格 ] 。 条件是见辅佐吉曜 ， 无四 
    煞 、 刑忌空劫冲会 ， 主历艰 辛而成积富 。 丑宫者仅取小康 。 未宫者廉贞化禄 ， 则称
    为 『 清白格 ] ， 亦主富裕 ， 无火铃照会则主富贵 ； 丑宫者亦仅 成中局 。 
    丑未宫 『 廉贞七杀 ] 不喜擎羊同度 ， 主多是非 ； 亦不 喜陀罗同度 ，。 主多无谓纷 
    扰 。 更不喜火铃 ， 主重挫折 。 
    『 廉贞 七 杀 ] 同度 ， 而廉贞化忌 ， 再见刑耗煞曜 ， 主 客死异乡 。 若武曲化忌 ， 或 
    文曲文昌 化忌冲起 ， 更与火铃同会 ， 主意外 。 或主萌自杀之心 。 
    丑未 [ 廉杀 ] ， 以天梁 、 [ 武曲破军 ] 、 天同等宫垣为 流年大限的枢纽 。 """
                print(tmp)
                print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫廉贞独坐 。 申宫者 ， 亦成 [ 雄宿乾元格 ] ， 可 参考前述 。 不成格者与寅宫 
同断 。 
寅申廉贞 ， 最不喜文曲 躔 迁移宫 ， 命宫再会文昌 ， 及再会阴耗虚刑诸杂曜 ， 复见 
武曲化忌来会 ， 且恶煞重 ， 则主其人有偷窃倾向 ， 且主流连酒色倾家而致堕落 。 古 
诀云 ；『 廉贞贪杀破军逢 ， 文曲迁移作贝戎 ] ， [ 贝戎 ] 即是 [ 贼 ] 字 。 
今人将这句古诀愈改愈乱 ， 且有改为 [ 兵戎 ] ， 认为乃 [ 武职 显贵 ] ， 大误 。 
寅申廉 贞 ， 亦喜对宫贪狼成火贪格 、 铃贪格 ， 主暴 发 。 亦主得妻财 ， 或得妻子 
匡助致富 。 
寅申廉贞 ， 以杀 、 破 、 狼 、 天梁及自身廉贞宫垣 ， 为流年枢纽 ； 以七 杀 、 天梁 
及自身廉贞宫埂 ， 为流年枢纽 ； 以七刹 、 天梁 、 [ 机巨 ] 、 [ 武府 ] 为大运枢纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉 [ 廉贞破军 ] ， 最不喜火 、 铃同度 ， 主暴败 。 见 煞重 ， 又见天刑 ， 则主开刀 
    手术 ， 或主意外 ； 于廉贞化忌为流年忌星冲起之年克应 。 ( 原局命宫 [ 廉破 ] 、 于 [ 廉 
    破 ] 居 疾厄宫之年 ， 忌星冲破者亦然 ) 。 
    卯酉 ( 廉破 ] ， 若廉贞化禄者 ， 则疾厄宫必会太阳化 忌 ， 故主目疾 。 
    卯酉 [ 廉破 ] 具创造力 ， 见擎羊同度 ， 无刑耗 ， 主人 有巧思巧艺 。 
    卯酉 『 廉破 』， 丙年生人亦主横发 、 横破 。 天府大限 横发 ， 防 [ 天同太阴 ] 限横破 。 
    除上述外 ， [ 廉破 ] 以 【 武贪 】、【 同阴 】、【 巨阳 】 为年限 之枢纽 。  """
                print(tmp)
                print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌 [ 廉贞天府 ] ， 其气最和 ， 见禄者吉 ， 空库露库 者凶 ， 唯虽凶亦较其他组合 
    等减轻 。 唯不利早婚 ， 常易藕断丝连 ， 或有一段时期有名无实 。  """
                print(tmp)
                print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥 【 廉贞贪狼 】 同度 ， 见煞忌 ，． 主飘流四海 ， 弃祖 离家 。 见辅佐诸曜 ( 不宜 
    只见昌曲 ) ， 则气质优雅 ， 儒将风 流 ， 军政界可出人头地 。 
    巳亥 [ 廉贪 ] 有火铃同度 ， 暴发暴败的性质极为严 重 ， 必须于发后见机 ， 能见好 
    收篷 ， 然后始能持盈保泰 。 
    巳亥 [ 廉贪 ] 与陀罗同高 ， 则时有感情与物质之冲 突 ， 易进退失据 。 
    巳亥 『 廉贪 』 婚姻多不利 ， 易藕断丝连 。 须详夫妻宫 而定其程度 。 
    巳亥 [ 廉贪 ] 以巨门 、 天相 、 [ 紫破 ] 、 [ 同梁 ] 为年运之 枢纽 。 注意巳宫 [ 廉贪 ] 一 
    生多灾难 ， 唯必能转危为安耳 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府喜紫徽在三方相会 ， 却不喜同度 ， 凡同度必有 缺点 ， 详福德宫 、 事业富 、 
夫妻宫星曜而定 。 
天府在命宫者 ， 见禄为获吉之基本条件 ， 然后视天 相性质而参订格局高低 。 
天府喜行天梁 、 太 阳宫限 。 如星曜吉 ， 则主地位高升 。 喜行禄存 、 化禄宫限 ， 
会合吉曜 ， 主财富增益 。 
天府所会之天相为 【 财荫夹印 】， 则天府亦主富贵 ， 事业不由白手而来 。 若为 [ 刑 
忌夹印 ] 、 则主孤立无援 ， 精 神受压力 ， 物质起争夺 。 
天府对宫必为七杀 ， 这是一个很巧妙的星曜 布置 。 夹府仅擅长守成 ， 不擅开创 ， 
亦不擅指挥 。 其开创力及权力是否能运用自如 ， 需视七杀宫垣所会合的星曜而定 。 
故 [ 逢府看相 ] ， 其实亦应 [ 逢府看杀 ] 。 
天府无禄 ， 是为 [ 空库 ] ， 坐会地空地劫 ， 亦为 [ 空 库 ] 。 凡空 库而对宫七杀会合 
星曜吉者 ， 始主由空中楼阁建立事业 。 
天府与四煞会 ， 则为 [ 露库 ] 。 凡露库必须天相得禄 ， 或成 [ 财荫夹印 ] 之格 ， 然 
后始主擅长竞争 ， 并因之成富 。 
与其他星曜同度之天府 ， 以戌宫 [ 廉贞天府 ] 为最 佳 ， 所谓 [ 天府临戌有星扶 ， 腰 
金衣紫 ] 。 且以廉贞化禄 ， 或 会武曲化禄为上格 ； 会紫微化科者 ， 贵而不富 。 更喜左 
辅右弼来会 。 天魁天钺相夹 ， 则主地位崇高 。 

"""
        print(tmp)
        print("\n")
        if(star == "天府紫薇"):
            tmp = """若 [ 紫微天府 ] 同度 ， 则以紫微为主 ， 天府为辅 。 故 亦喜左右魁钺 。 无辅佐 ， 则 
此星系有缺憾 ， 主进退不决 ； 若禄存同度 ， 则天府反为主星 ， 其吉凶亦重天府本质 
之推断 。 

 """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """子午宫 [ 武曲天府 ] 同度 ， 见禄存 ， 在 [ 财帛宫 ] 反较 在命宫为佳 ； 见武曲化禄 ， 
    则在命宫为佳 。 前者在命宫则嫌悭贪 ， 在财帛宫则主善于理财生财 ； 后者在命宫主 
    大度 ， 且理财有决断力 。 
    """
                print(tmp)
                print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """丑未宫天府独坐 ， 昌曲夹则利求名 ， 即财帛视其社 会地位而定 ； 左右夹则利示 
财 ； 即地位由财帛多寡 而定 。 由此可定天生努力目标 。 
丑未天府 ， 以未宫较佳 ： 因丑宫者 ， 所会的天相在 巳 ， 夹天相的天梁在午 ， 刑 
杀之气较重 ， 敖易间接影响天府受压力较重 。 
丑未天府 ， 以 『 紫贪 』、 天梁 、【 廉杀 】、 『 武破 』 ， 及禄 存化禄所在宫垣为流年 、 
大运之枢纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫廉贞独坐 。 申宫者 ， 亦成 [ 雄宿乾元格 ] ， 可 参考前述 。 不成格者与寅宫 
同断 。 
寅申廉贞 ， 最不喜文曲 躔 迁移宫 ， 命宫再会文昌 ， 及再会阴耗虚刑诸杂曜 ， 复见 
武曲化忌来会 ， 且恶煞重 ， 则主其人有偷窃倾向 ， 且主流连酒色倾家而致堕落 。 古 
诀云 ；『 廉贞贪杀破军逢 ， 文曲迁移作贝戎 ] ， [ 贝戎 ] 即是 [ 贼 ] 字 。 
今人将这句古诀愈改愈乱 ， 且有改为 [ 兵戎 ] ， 认为乃 [ 武职 显贵 ] ， 大误 。 
寅申廉 贞 ， 亦喜对宫贪狼成火贪格 、 铃贪格 ， 主暴 发 。 亦主得妻财 ， 或得妻子 
匡助致富 。 
寅申廉贞 ， 以杀 、 破 、 狼 、 天梁及自身廉贞宫垣 ， 为流年枢纽 ； 以七 杀 、 天梁 
及自身廉贞宫埂 ， 为流年枢纽 ； 以七刹 、 天梁 、 [ 机巨 ] 、 [ 武府 ] 为大运枢纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉天府独坐 ， 所坐宫垣为弱地 ， 若空劫二曜 ， 一 躔命宫 ， 一躔事业宫 ， 则府库 
空露 ， 更见煞曜 ， 主机谋百 出亦总成空 。 
卯酉天府喜左辅同宫 ， 会右弼 ， 则主人地位崇高 ， 或有现成事业发展 。 唯极畏太 
阳化忌 ， [ 刑忌夹印的年限 ， 为重大破裂挫折之徵兆 。 
卯酉天府 ， 除上 述外 ， 以 [ 紫微破军 ] 、 [ 廉贞贪狼 ] 为大运流年之枢纽 。   """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌 [ 廉贞天府 ] ， 其气最和 ， 见禄者吉 ， 空库露库 者凶 ， 唯虽凶亦较其他组合 
    等减轻 。 唯不利早婚 ， 常易藕断丝连 ， 或有一段时期有名无实 。  """
                print(tmp)
                print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天府独坐 ， 对宫 『 紫杀 』 为权力之星系 ， 故主女命驾凌丈夫 ， 在现代 ， 亦主 
女子有独立事业 。 
巳亥天府见辅佐诸曜 ， 只不过增加助力 ， 因有 [ 紫 杀 ] 相对 ， 并非必要 ； 不如见 
禄存及 [ 财荫夹印 ] 之天相 ， 或 借会武曲化禄 、 贪狼化禄为佳 ，． 可以富贵双全 。 
巳亥天府 ， 若天相为财荫夹 ， 在现代多主受异族提 拔 。 不然 ， 则必须见魁钜始 
主受贵人提拔 。 
巳亥天府最喜走 『 叠魁钺 』 宫垣 。 ( 即流魁流钺恰叠 冲星盘之魁钺 ， 主突发 。 ) 
巳亥天府以 [ 武贪 ] 、 天相 、 [ 紫杀 ] 为 大运流年之枢 纽 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴宜入庙 ， 不宜落陷 ， 宜夜生人 ， 不宜日生人 。 若夜生人值太阴入庙 ， 最吉 ； 
曰生人则减福 。 若夜生人值太阴落陷 ， 未必便凶 ， 仍须端说辅佐煞化而定 ； 若日生 
人值太阴落陷 ， 则必不利女亲 。 女命亦不利自身 ， ( 或早寡 ) 。 
命宫无正曜 ， 身宫在迁移值太阴落陷 ， 见煞 ( 尤忌 火铃 ) ， 日生人主 [ 随娘改嫁 】， 
或过继出祀 。 
太阴守命 ， 又分上弦生人 ( 初一至十五 ) 及下弦生 人 ( 十六到卅日 ) 。 以上弦为吉 ， 
盖其时月圆 ； 下弦不吉 。 盖其时月渐缺 。 上述 [ 随娘改嫁 ] 的克应 ， 以下弦 生人更 确 。 
太阴入庙 ， 遇吉曜在三方来会 ， 主享受 ， 尤主精神 享受 。 即不会将全部精神放 
在求财弋追求物质生活 。 更见 昌曲则文秀 ， 见天同则喜好音乐 ， 即使见天机亦主兴 
趣多方 ， 藉此消遣唯与太阳同度者 ， 欠精神生活 。 
凡太阴在命宫 ， 推断时必须兼视 『 福德宫 ] ， 盖 [ 福 德宫 ] 必为巨门 ， 其吉凶可以 
影响命宫之太阴 。 尤其是在精 神享受方面 。 
太阴主富 ， 所以喜与禄存或化禄同度或对拱 ； 在三 合宫者次之 。 见化权化科而 
不见禄 ， 则主其财禄由社会地位及学历等决定 ， 故必须极力争取上游 ； 见昌曲主聪 
明 ； 见左右始能增加地位 。 
太阴本 性收敛 ， 唯收敛太过则主消沉 ， 夏不喜陀罗 、 铃星 、 化忌 、 阴煞 、 空劫 、 
天刑等曜 。 若再刑耗齐凑 ， 则主自闭症或弱智 ，． 或心理有缺憾 。 尤以寅申 、 卯酉四 
宫为然 。 
古诀 ： [ 日巳月酉 ， 安命丑富 ， 步蟾宫 ] 、『 日 卯 月亥 ， 赛命未宫 ， 多折桂 』。 此 
乃日月庙旺 ， 会照命宫 。 又云 ：【 日 月同未 ， 安命丑 ， 侯伯之才 】 此乃命无正曜 ， 借 
未宫 【 太 阴太阳 】 安命 ， 亦等于日月会照 。 凡日月会照 ， 一般情形下比 [ 日月同宫 ] 
为佳 。 因日月同宫性质不侔 ， 反易生缺点 。 
日月所夹的宫垣 ， 若日 月庙旺者亦主富贵 。 夹天府化科 ， 或天府对廉贞化禄克吉 ， 
夹武贪化禄者次 。 
 [ 反背 ] 者 太阳在戌 ， 太阴在辰 。 
[ 反背 ] 者 ， 主离祖过继出祀 ， 见 火星铃星同宫 ， 则童年离开父母 ， 煞重主受遗弃 。 
若又见辅佐吉曜 ， 则离祖发福 。 
太阴不喜与羊陀同蹿命宫 ， 主艰辛 。 若太阴化忌星 ( 或会忌星 ， 或太阴化忌羊陀 
夹 ) ， 皆主六亲无缘 ， 孤寡伶仃 ， 又主一生易投资错误 。 
太阴主藏 ， 故亦不宜与地空 、 地劫 、 天空同度 。 其不 吉程度 ， 比太阳为大 。
太阴主富 ， 故最喜见禄 ， 化禄最吉 ， 禄存次之 。 太阴化权则仅主理财 ， 或司财赋 
权柄 ， 纵能富亦由此而来 。 

"""
        print(tmp)
        print("\n")

        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉太阴独坐 ， 酉优于卯甚多 。 唯卯宫见辅佐诸吉 而不见煞 ， 又见吉化 ， 则为 [ 反 
背 ] ， 主大富 。 
卯酉太阴以巨门 、 [ 廉相 ] 、 七杀 、 天机宫垣 ， 为大 运流年之枢纽 。 [ 反背 ] 者则不 
论天机 。     """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌太阴 ， 日月并明 ， 皆为上格 。 唯必须见吉化始 主富贵 。 若无吉 ， 见煞 ， 则 
主名利皆虚 ， 且婚姻不利 。 
辰戌太阴 ， 以 [ 廉贪 ] 、 巨门 、 [ 武杀 ] 、 天机宫垣为 枢纽 。  """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """己亥太阴 ， 巳宫多缺憾 ， 女命主嫁夫为人谋而为为 己谋 ； 男命主多飘荡 ， 此由 
于太阴落陷 ， 发散太过也 。 亥宫则名 [ 月朗天门 ] ， 见禄即主得意外之财而成大富 。 
巳亥太阴见桃花 诸曜及刑忌煞耗 ， 主人多阴谋且好 酒色 。 
巳亥太阴 ， 以 [ 天同巨门 ] ， 七杀 、 [ 廉贞天府 ] 、 [ 太 阳天梁 ] 诸宫垣为大运流年 
之枢纽 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼主物欲 ， 又主色欲 。 故喜化禄 ， 化权 ， 不需文 昌文曲 、 左辅右弼亦能致富 
贵 。 反而见昌曲时 ， 变成带粉饰的意味的物欲 ， 便有巧诈欺骗的意味 。 即是说 ， 物 
欲利于堂堂正正的争取 ， 而不喜文过饰非 ， 遮遮掩掩 。 
在精神生活方面 ， 贪狼为喜欢神秘事物 ， 尤其是宗 教 ， 巫术的神秘 。 在古代 便 
表现为烧丹炼汞 ， 神仙烧炼 ； 在现代 ， 则为带神秘色彩的宗教 。 
由于贪狼表现为物欲的争取 ， 所以又 成为擅长交际 应酬的表徵 。 然其交际必倾 
向于酒色财气 。 与廉贞之与昌曲同会 ， 能衍化为诗酒琴棋不同 。 
贪狼坐命 ， 不喜七杀守身宫 ， 亦不喜破军守身宫 ， 其会煞曜 ， 则嫌浮荡 、 好色 。 
或主有不良嗜好 。 
贪狼与火铃同度 ， 主突发 。 古代唯武职始易有突如 其来之功动 。 故古人乃谓 [ 贪 
狼火星居庙旺 ， 名振诸邦 ] ， 现 代可迳推断为突发 。 
贪狼化忌 ， 火铃同度 ， 则主暴发暴败 。 无火铃 ， 则 为出乎意料之外的成功 。 即 
所谓 [ 无心插柳柳成阴 ] 。 
贪狼化忌流曜化禄 ， 亦主 『 无心插柳柳成阴 ] 。 若 贪狼化禄 ， 流曜化忌 ， 则主为 
人夺去利 益 。 
贪狼以四墓为入庙 。 故 【 火贪 】 [ 铃贪 J 格 ， 以四墓宫 为佳 。 余宫次之 。 
贪狼喜火铃 ， 却不畏空曜 ， 亦不畏天刑 。 贪狼与空曜 、 天刑同躔 ，。 主端正 。 蹿 
天刑尤主自律 ， 唯仍不喜地劫同躔 ， 主挫折 。 
于煞曜 ， 贪狼唯不喜擎羊 、 陀罗 。 主酒色财气 。 子 宫同擎羊 、 亥宫同陀罗 ， 则 
名为 [ 泛水桃花 ] ； 寅宫同陀罗 ， 名为 [ 风流彩杖 ] ， 均主因色致败 ．。 此两种格局若会
天刑 ， 则 天刑不主自律 ， 反为牢狱之灾 。 
[ 火贪 ] 、 [ 铃贪 ] 格亦不喜同时见羊陀 ， 见 则 为破局 。 纵使此时贪狼化禄 ， 亦主 
横发后立即横破 。 若又见辅佐诸曜 ， 则主经危险困难而横立功名 。 

申子辰年生人 ， 贪狼在子坐命 ； 寅午成年生人 ， 贪 狼在午坐命 ； 巳酉丑年生人 ， 
[ 武曲贪狼 ] - 在丑富坐命 ；
凡贪狼 ， 皆以七杀 、 破军 、 太阴 、 太阳 、 巨门 、 紫 微宫垣为大运流年之枢纽 。 
『 火贪 』、 [ 铃贪 ] 格 ， 则防化忌叠冲之年 ， 倘见流煞又 冲起 ， 则为暴败之克应 。 
否则亦为导致暴败之年 。 
贪狼最不宜行太阳巨六交并化忌之年运 ， 主灾难 、 词讼 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "子" or dizhi == "午"):
            tmp = """贪狼在子独坐 ， 若不入 [ 泛水桃花 ] 之格 ， 有吉星祥 曜 ， 或有天刑相制 ， 亦是富 
局 ， 主中年后发迹 。 
贪狼在午 ， 名为 [ 木火通明 ] ， 无煞忌而见吉曜 ， 则 为巨富之格 ， 或任财经要职 。 
见煞者平常 ， 小富 。 唯绝不宜投机 。 
 """
            print(tmp)
            print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            if(star == "贪狼武曲"):
                tmp = """丑未宫武曲贪狼同度 ， 均 为上格 。丑未宫 [ 武曲贪狼 ] 同度不同 ， 『 武贪 』 主少年享受 ( 详见武曲一节 ) 。  """
                print(tmp)
                print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """贪狼在申宫独坐 ， 临受制之乡 ， 见煞忌及辅佐诸曜 齐集 ， 则主先贫困 ， 且经危 
难 ， 而后突发 唯发后又恐因 不良嗜好而破败 。 只见煞 ， 则易入偏门人生亦因此多颠 
沛 ； 只见吉曜 ， 则可取富贵 ， 唯仍须注意持盈保泰 。 在申宫之 [ 火贪 ] 、 [ 铃贪 ] ， 横 
发横破之性质更重 。 
贪狼在寅宫独坐 ， 无擎羊 、 天刑照会 ( 有则主遭刑 杖 ) ， 又不成 [ 风流彩杖 ] 之格 ， 
而有吉星祥曜 ， 则亦可成贵 局 ， 但一生风波不少 ， 有煞曜 ， 则事业鼎盛 ， 官讼随临 。 
唯贪狼化忌 、 一则仅主工程工 艺谋生 。  """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            if(star == "贪狼紫薇"):
                tmp = """ 亥卯未年生人 ， [ 紫微贪狼 ] 在卯宫坐命 ， 主人贪小 ， 有不 
    良嗜 好 ， 古人认为乃 [ 鼠窝 ] 之命 。 其实乃物欲过深之故 。 若躔 桃花诸曜 ， 则情欲亦 
    深 。 喜见吉曜则不良性质减轻 ， 亦喜 见天刑及空曜 ， 见天刑则能自律 ， 见空曜主清 
    白 。    """
                print(tmp)
                print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌宫贪狼独坐对 
武曲 ，贪狼在辰戌独坐 ， 中年后始能发迹 。 倘煞忌并临 ， 则主少年多灾难病患 。  """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门为暗曜 ， 然绝非此星曜本身无光 ， 只是能暗蔽 其他星曜的光辉而已 ， 故称为 
巨门 ， 即取暗蔽 之意 。 
诸星之光辉 ， 唯太阳无处不照 ， 是故巨门便不能暗 蔽太阳 。 只有当太阳落陷 ， 
即光辉最弱之时 ， 始为巨门所暗 ， 因此太阳落陷亦不宜会巨门 。 
巨门对诸曜之影响 、 或就各星曜本质受暗之结果而 定 。 如天同与巨门同度或对 
拱 ， 天同主感情及情绪 ， 便成为感情及情绪暗昧 ， 于是便有隐衷 、 隐痛 ， 不足为外 
人道 。 又如天机与巨门同度或对拱 ， 天机主机谋 ，、 计划 ， 便成为机谋与计划之失算 ， 
由是进退失据 ， 犹豫不决 。 唯太阳与巨门同度或对拱 ， ； 入庙则不为巨门所暗 ， 光辉 
远播 ， 故主 受异族或异乡人推崇 ； 落陷则光辉潜隐 ， 作事虎头蛇尾 。 
如上 所论 ， 为推断巨门之要点 。 唯必须将星曜全部 性质推定 ， 然后加入暗蔽性质 ，
始能作完整推断 。 如 [ 天机 巨门 ] 本主进退失据 ， 故主意志不坚定 ， 但如天机化权 ， 
稳 定性增加 ，、 则巨门对其暗蔽力 ， 又变成易做出错误之主观 
决定 ， 因而失去良机 。 又如 [ 天同巨门 ] 本主缠绵一往的隐 衷 ， 若天同化禄 ， 则又可 
能为对一门学问或嗜好的执着 ， 此又未必为不祥矣 。 
巨门最喜太阳庙旺 ； 故寅宫 [ 巨阳 ] 见吉化吉曜主因 富而得贵 ， 且名扬异域 ； 申宫 
见吉化吉曜 ， 亦仅主因贵而得富 ， 故最宜外交 、 律师 ； 巨门与天同周度 ， 则非得禄 
不可 ， 无禄者纵见吉曜亦不吉 ， 古人谓 [ 丑未巨门为下格 ， 纵 
然富贵亦不长 』， 星曜结构的毛病 ， 在于容易听信谗言 ， 感情用事而致失败 ； 巨门与 
天机同度必须见吉化吉曜始许富贵 ( 卯宫又优于酉宫 ) ， 唯见火铃同躔则为破格 ， 主 
浮荡 ， 亦主浮沉 ； 不见吉曜或不见吉化 ， 见煞则为破败支荡 。 
 
巨门在十二宫皆喜见禄 ， 化禄最吉 ， 禄存次之 ， 其 一生运限亦喜化禄见禄 ， 凡 
巨门化权者 ， 尤喜大运流年见禄 。 丑未宫 [ 同巨 ] 为武曲化禄及贪狼化权夹者亦较佳 。 
最 畏火铃同度 ， 虽富贵亦不耐久 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午巨门为 [ 石中隐玉 ] ， 见吉化为佳 。 化禄者主富 ； 化权者主贵 。 唯一生不宜 
占取最高位置 。 化禄化权者 ， 均常在巳垣大运失败 ； 化权者 ， 败在争权 ； 化禄者败 
在求富而压足 。 其成功则常在 [ 武杀 ] 、 天府大运 。 
子午巨门与禄存同度 ， 必须见吉曜始许富贵 。 最不 喜天机宫垣 ， 亦不喜空劫躔 
会之宫垣 。 其 成功常驻在见化禄 、 叠禄大运 。 
子午巨门无禄 ， 必须行至见禄之大运流年始主发 越 ， 见空劫化忌 ( 尤忌天机 ) 之 
年限则主破败 。 
子午巨门一般 [ 兄弟宫 ] 不利 ， 故不宜与人合作 。 亦 常主迟婚 ， 子垣巨门尤然 。
 """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 
辰戌巨门一般不利 ， 古人云 ： [ 辰戌应嫌陷巨门 。 ] 主 辛劳 、 是非 、 斗争 。 化忌 、 
躔煞者更为下格 。 不宜行天相 、 天梁 、 天同 、 天府宫垣 ， 每生事端 ； 较宜行太阴太 
阳入庙宫垣 。 最宜行见禄存化禄之运限 。 一一解巨门之厄 ， 无过于禄存化禄 。 
辰宫巨门化禄 ， 与文昌化忌同躔或对 拱 ， 是为奇格 ， 富贵无与伦比 。 行至天府 
宫垣 ， 即为发迹大运 ， 巨门喜财星 ， 故喜天府 。 唯不宜行天同宫垣年限 ， 常易因贪 
求太过而获凶 。． 
戌宫巨门化禄化权皆吉 ， 反不宜见文昌化忌 ， 亦以 天府为宜 ， 天同为嫌 。   """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 
巳亥巨门分别甚大 ， 在亥宫者与巳宫太阳对拱 ， 故 吉 ， 见吉化吉曜必主富贵 。 
唯行至天机 、 天同大运 ( 尤不 宜七 杀流年 ) ， 则易因强出头而致灾祸 ； 或因锋芒太露 
而招 灾 。 
巳宫巨门对宫太阳无力 ， 故不为吉 ， 仅见禄者始主 勤俭致富 ， 喜 [ 紫微天府 ] 、 武 
曲 、 禄存 、 化禄等宫垣 ， 不 喜七 杀 、 [ 廉贞天相 ] 、 贪狼等宫 垣 。    """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """前人论天相 ， 过份强调其祥和的一面 ， 容易误导后 学 。 天相逢善则善 ， 遇恶则 
恶 。 例如 [ 紫微天相 ] 同度 ， 若 见 [ 百官朝拱 ] ， 则此天相便主发挥相助之力 ； 但若紫
微为 『 在野孤君 』， 此天相便亦能助纣为虐 。 举此一例 ， 余例可 
知 。 
头数十四正曜 ， 唯天相最重夹宫 。 羊陀夹 、 火铃夹 、 空劫夹皆不吉 。 主是非困 
扰 、 劳碌奔波 、 突生挫折 。 最劣者为 [ 刑忌夹印 ] ， 即巨门化忌与天梁相夹 ， 主官司 
刑杖 ( 前 人误为 [ 刑囚夹印 1 ， 于是又误为擎羊与廉贞相夹 ， 大误 。 ] 若昌曲夹 、 左右 
夹 、 魁钺夹 ， 则皆为吉兆 ； 最喜 [ 财荫夹印 ] ， 即巨门化禄来夹 。 
前人强调 [ 天相能化廉贞之恶 ] ， 并非只指 『 廉贞天 相 』 星系组合 。 天相坐命 ， 行 
至廉贞躔度的宫垣 ， 见吉则吉 ， 见凶减凶 ， 亦为化恶之兆 。 
[ 刑忌夹印 ] 之局 ， 最嫌天梁与擎羊同度 ， 为 [ 刑忌夹 印 ] 较凶之格 。 因同时必为羊 
陀夹之故 。 此时天相虽必与禄存同度 ， 反主一生财帛破散难聚 ， 且易因财帛生是非 
口舌词讼 。 
天相与火铃同度 ， 又见羊陀夹或刑忌夹 ， 主少年不 利父母 ， 或过继出祀 。 若 [ 福 
德宫 ] 七 杀又会刑忌煞耗 ， 则 主残疾 。 
凡天相坐命 ， 宜兼视 [ 父母宫 ] 吉凶 ， 因天相必须为 人佐助 ， [ 父母宫 ] 即其佐助 
之上司 。 [ 父母宫 ] 必有天梁 ， 最 忌天梁与禄存同度 ， 又躔火铃 ， 则主人终身无可依 
靠之后台 ， 而自身又难以独立创业 。 怀才不遇 ， 往往即是这种格局 。 
天相见昌曲 ， 必须不见化忌及羊陀始吉 ， 否则聪明 而命薄 ， 亦为怀才不遇之征 。 
古人以此为女人妾侍之命 ， 即是聪明而命薄之意 。 
古人云 ： [( 天相 ) 贪廉武破羊陀煞凑 ， 巧艺安身 。 ] 此诀的重点在于廉贞 。 廉贞 
遇天相主聪敏 ， 又有服务之意 ， 故见吉则宜从政 ； 若遇羊陀 则不宜从政 ， 其聪敏及 
服务本质 ， 便转为替人服务的工艺与技艺 。 一一唯卯 酉宫天相有 此格局 。 
凡天相所在的流年命宫或小限 ， 亦对吉凶星曜敏 感 ， 故不宜见丧门 、 吊客 、 白 
虎 、 大耗 、 贯索 、 官符诸流曜 ； 喜见青龙 、 奏书 、 龙德 、 天德等诸吉曜 。 
女命天相独坐 ， 配夫宜年长 ； 否则比自己小一两年 亦可适应 。 
女命天相 ， 亦名 [ 夫唱妇随 ] ， 宜助夫创业 。 
凡天相独坐 ， 皆以见化禄 、 化权 、 化科 、 化忌之宫 垣为大运流年之枢纽 。 行至 
刑忌夹 、 羊陀夹 、 火铃夹 、 空劫夹 、 伤使夹 ， 或昌曲夹 、 魁钺夹 、 禄权科恶化之宫 
垣 ， 吉凶应验皆十分敏感 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 
巳亥天相独坐 ， 对宫 [ 武破 ] 必须见禄或化禄始吉 ， 否则动荡 、 消极 。 最喜武曲
化 禄拱照 。 
亥宫天相 ， 若对宫武曲化忌 ， 则天相必为羊陀夹 。 天相在一般情况下虽不畏羊 
陀夹 ， 在此情形下却大为不利 ， 主往往功败垂成 ， 财力不足以济其后急 。   """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """ 
卯酉宫天相独坐 ， 见煞忌则只宜工程技术谋生 ( 或 参考前论 ) 。 见吉化吉曜 ， 则 
为以专门技能起家 。 
卯酉天相 ， 喜见才艺诸星 ， 如天才 、 龙池 、 凤阁等 。 见奏书亦吉 。 若同时又见 
煞及昌曲化忌 ， 则为清客 。 
一般情况下 ， 卯酉天相以见禄为宜 ， 则清才高艺 ， 可以立身致富 。 唯始终受人 
掣肘或驾驭 。    """
            print(tmp)
            print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 
丑未宫天相独坐 ， 最喜左辅右弼同度 ； 若邻宫天同 化忌 ， 虽不成 [ 刑忌夹印 ] ， 
亦不为美 ， 主虽有靠山后援 ， 但 往往于重要关头不得助力 ， 亦为怀才不遇炎徵 。 唯 
此时若有左辅右弼同度 ， 则主虽不得长上之力 ， 但却可得友人的支援 。 亦喜 [ 百官朝 
拱 ] ， 则为宰 辅之意 ， 居一人之下 ， 万 人之上 ， 唯终受上司掣肘 。 
丑未宫天相与 [ 紫破 ] 对拱 ， 故亦主成见深 、 主观强 。 倘火铃同度 ， 则每因主观 
成见而招挫败 。    """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            if(star == "天相武曲"):
                tmp = """ 
    寅申宫天相武曲同度 ， 可详武曲天相前论 。    """
                print(tmp)
                print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为荫星 。 荫的意义有多种 ： 消灾解厄 ； 延寿 ； 上司或父 母的助力 ； 有宗教 
信仰的丰富精神生活 。 凡此皆为荫庇 。 留意这些荫庇之力 ， 尽属精神而不属物质 ， 
由是即可知道天梁的特性 。 
天梁的消灾解厄 ， 含有灾难先来 ， 然后得化解的意 味 。 所以必先经危难然后平 
安 ； 先有病患然后痊愈 ； 先无凭藉然后得人扶助 ； 先觉精神空虚 ( 意味人生有相当大 
的 刺激 ) 然后寄托于宗教 ， 诸如此类不胜枚举 。 
由于天梁偏重精神而不偏生物质 ， 所以天梁喜化 科 ， 不喜化禄 ， 化禄即带来是 
非困扰 ， 为人怨恨 ； 亦不甚喜化权 ， 化权即可能为弄权的倾向 ， 见火铃者尤然 。 
由荫庇这层意义 ， 可以引伸为刑法纪律 ， 因为刑法 可以 保障善良老百姓 。 因此 
天梁便又可表征为为民伸冤除害的清官 ， 有如民间传说的包拯 、 海瑞 。 在推断时必 
须留意此点 。 古人所谓 [ 声名类于王室 ， 职位临于风宪 ] ， 即指 此而言 。 
由上引伸 ， 天梁便为监察之职 ； 许多核数师 、 监事 理事 ， 或商务上的市场计划 、 
财务计划之类人才 ， 命宫或事业宫皆见天梁 ， 盖天梁之监察 ， 有退居幕后的意味 。 
由荫庇引伸为替人服务 ， 所以医生 、 律师的星盘 ， 亦往往与天梁有密切关系 。 
一一准此 ， 亦可界定天梁为专业人才 。 
天梁与太阳同度或对拱 ， 见天刑 ， 宜为法律人员 ， 再见擎羊 ， 则不为外科医生 ( 包 
括妇产科 ) ； 若见天月 ， 则 为医疗界人士 。 天梁天机则为策划管理 ； 见天马 ， 则从事 
流动性质的行业 ， 如航运 、 电子等 ( 有一个例子可以参考 ， 曾算过一个租赁录影带的 
人的命 ： 不说出来 ， 很难猜得出 ， 但说出来 ， 便会觉得其行业性质带服务性及流动 
性 ， 无一不合 ， 由此可见现代人事业 ，． 往往难以具体说出 。 ) 
天梁与昌曲 、 奏书同度 ， 亦可视为法律人才 ， 擅长 文书案牍 ， 但有时亦可以为 
大企业的秘书 ， 或为文化界 、 出版界 。 
天梁与白虎同度 ， 可以视为刑法纪律之征 ， 亦可视 为外科手术 。 
古人云 ： [ 天梁天马陷 ， 飘荡无疑 。 ] 乃指巳亥二宫的 天梁而言 。 此推断乃指离乡 
背井 。 现代人容易离开出生地发展 ， 故不宜断为飘荡 ， 仅于见空耗 、 躔火铃的情形 
下 ， 始可断为不守一业 ， 游离无根 。 见科文诸曜则为狂放 。 
古人云 ： [ 天梁陷地见羊陀 ， 伤风败俗 。 ] 此乃指巳亥 宫女命天梁 。 现代推断 ， 
可视为其人一生多感情上的痛苦 。 最嫌天梁与火铃同度 ， 对宫天同化忌 ； 或会天机 
化忌 ， 而羊陀夹天梁 ， 更多感情痛苦与困扰 。 

"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 
子午二宫天梁 ， 不见昌曲已聪明 ， 唯恐聪明太露 ， 察察为明 ， 则人缘不佳 ， 尤 
恐妨害婚姻 。 子宫者较午宫为佳 。 
子午天梁 ， 不必见桃花 ， 皆易生感情变化 。 古代男 命多纳妾 。 亦主婚姻关系有不 
足为外人道的痛苦 。 
子午天梁若见禄者 ， 尤忌聪明尖刻 ， 必须厚道待人 始可扭转命运 ， 否则多于第三 
个大运即生影响深远的挫折 。 只是当事人往往不自知 ， 当后运坎坷之时 ， 便怨天尤 
人 ， 却不知祸根已经早种 。 
午宫天梁之不吉 ， 乃由于所会的太阴 、 太阳皆落陷 弱之位 。 若 [ 财帛宫 ] 之 [ 天机 
太阴 ] 见煞耗 、 天马 ， 则主其 人之思路独特 ， 且不易合群 ， 与 人交往 ， 难以沟通 ， 以 
致影响收入不固定 。 例如忽遭解职 、 忽然客户转移 ， 或屡易工作岗位等 。 
子午天梁 ， 必须见左辅 、 右弼 ； 天魁 、 天钺加会 ， 又不见煞忌刑耗诸曜 ， 然后 
始许富贵 ， 且其富亦由贵而来 。 
子午天梁 ， 以 [ 天机太阴 ] 、 巨门 、 太阳 、 天 同为年限之枢纽 。   """
            print(tmp)
            print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 
天梁临巳亥 ， 见煞刑空耗诸曜 ， 一生多灾 ， 或多惊 险 ， 常于 [ 天机巨门 ] 、 [ 太阴 
太阳 ] 的年限克应 。 又常于见化 忌的年限 ， 蕴藏祸患之机 。 此外 ， 亦以贪狼 、 天同坐 
守的宫垣 ， 为年限之枢纽 。 
   """
            print(tmp)
            print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 
丑未天梁 ， 因与天机对拱 ， 故主计划谋略 ， 又主机 动 、 动荡 。 故若见煞曜及空 
耗 ， 古人认为乃出家僧道之命 。 在现代 ， 则多表现为独特的人生观 ( 与午宫天梁的独 
特思路不同 ， 盖一为人生观 ， 一为处事的作风 ， 应作分别 。 ) 故若躔昌曲 、 天才等曜 ， 
则其人聪明绝顶 ， 但却不安于一 业 ， 以致到老无成 。 
未宫天梁所会者为亥宫的太阳 ， 故亦不如丑宫者 。 
凡天梁会太阳陷弱 ， 皆主招尤怨 。 然而若见刑曜及昌曲 、 龙凤 、 青龙 、 奏书 、 官符 
等曜 ， 而不见火铃 、 羊陀 、 空劫者 ， 则反宣从事法律 ， 或刑法部队 。 
丑宫天梁 ， 若夫妻宫巨门吉化 ( 尤喜化禄 ) ， 主与 异族能婚 。 
丑未天梁 ， 喜天巫与太阳同度 ， 则主受长辈提拔事 业 。 
丑未天梁 ， 最不宜行贪狼化忌之运 。 据本派所传 ， 此乃因色致祸 ， 或多争多气 
之运限 。 视所会诸曜而定 。 
丑未天梁 ， 不见科文诸曜亦带艺术气质 ， 唯往往表 现为狂放 。 
丑未天梁 ， 以贪狼 、 巨门 、 太阳 、 天 同诸宫垣 ， 为 流年或大运之枢纽 。  """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀与紫微同宫 ， 或与紫徽对拱 ， 皆化为权 。 若遇 紫微化权 ， 则权星太重 ， 未 
必是利 。 盖大限流年必有不吉之宫垣 年限至此 ， 恐防立生挫败 。 尤不喜见武曲化忌 
之 宫垣 。 
天梁主 [ 风宪 ] ， 七 杀亦主 [ 风宪 ] ， 故亦主纪律刑法 。 唯天梁属文 ， 七 杀司武 ；
天梁可以退居幕后 ， 七 杀则上前 台 。 故天梁可以转化为监察 ， 七杀则转化为管理 。 
古人云 ： 『 
( 七杀 ) 二宫逢之 ， 定历艰辛 』 ， 即命身二 宫见七 杀 ， 人生必有一段艰 
苦时期 。 必须脚踏实地 ， 将此 段时期捱过 ， 然后始见吐气扬眉 。 大 致而言 ， 天机 、 
巨门二曜坐守之宫度 ， 七 杀最不宜行 。 
七杀必与天府相对 。 七 杀主攻 ， 天府主守 ， 二者互 相牵制 ， 须视彼此之影响如 
何 。 例如七 杀在寅申宫有禄存 同度 ， 对宫为 [ 紫微天府 ] ， 天府得禄存拱照 ， 故利守 
不利 攻 。 此时七 杀虽受对宫紫微之影响 ， 其权力亦宜倾向于保 守 ， 最宣在现成局面 
下发展 ， 不利创新 ， 亦不宜多所改变 。 
七 杀忌火铃 。 尤忌擎羊 、 火星 ； 或擎羊 、 铃星之组 合 。 二者之中 ， 又以羊铃为 
虐最甚 ， 倘天刑同度 ， 见阴煞 、 大耗 、 天虚等曜 ， 主刑事官司 。 
七 杀在庙旺之地 ， 见火羊尚可 ， 仅主激发 ， 即人生 在不断定挫折中尚可 求进步 。 
若见铃羊 ， 则带逐渐消磨的意味 。 在陷地更甚 ， 且或六亲无缘 ， 一生少助力 。 
七杀不宜只会昌曲 ， 而不会其他辅佐吉曜 。 若然 ， 则愈聪明愈主观 ， 不能听取 
别人丝毫不同意见 ， 每为人挫折之由 。 
七 杀最喜见魁钺 。 甚至经行流魁流钺拱会的宫垣 ， 往往亦为良好的转机 。 
七 杀亦喜见禄 。 最喜见破军化禄 ， 则人生经一次重 大的转变而取富贵 ； 其次为 
贪狼化禄 ， 亦可荣昌 ， 但防富贵不耐久 。 武曲化禄亦佳 ， 但格局较次 。 
七 杀与天府相对 ， 既有互相掣肘之义 ， 亦可视为本 质的矛盾 。 故当七 杀与煞刑 
空耗诸曜同度时 ， 每易因挫折 而感到 人生空幻 ， 类多因此入佛道二门 。 唯若天府见 
禄 ， 则始终主恋栈尘缘 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫 七 杀 ， 与 【 武曲天府 】 对拱 ， 见禄则财星有根 ， 可以调和七 杀的气质 ， 
故或转化为财经界人士 ， 掌经济权 若无禄 ， 只需无煞忌刑曜 ， 亦主得长上以财力提 
携 。 斯乃谓得荫庇之余气 。 
因系 [ 荫庇 ] ， 故子午宫 七 杀特别喜见魁钺 、 辅弼 。 若大运或流年之魁钺 ， 冲起 
原局魁钺 ， 则此运限年限 ， 大致可视为吉利 , 主受人知遇 。 惟若煞忌刑曜会合者 ， 自 
属 例外 。 
若在午宫 ， 成 [ 雄宿乾无格 ] 者 ， 则大忌火铃同度 。 此格为火炼阴金 ， 见火铃则 
火候大过 ， 不但人生艰苦 ， 而且恐有残 疾 。 成格者 ， 亦喜行辅弼 、 魁钺运限年限 。 
子宫 七 杀不成 [ 雄宿乾元格 ] ， 乃因子为北方水地 ， 水能克火之故 。 然纵使火铃 
同度 ， 亦仅主奔波劳碌 ， 反不致破格 。 
成 [ 雄宿乾无格 ] 者 ， 最喜廉贞化禄 ， 是为上格 。 其 
生命力强 ， 而且坚毅卓绝 ， 经奋斗而成大业 。 发迹之运 ， 必在破军坐守之垣 。 发迹 
之年 ， 必在廉贞或贪狼坐守之垣 。 
子午宫七杀 ， 不成格或破格 ， 反不宜经行廉贞宫度 ， 且婚姻必多波折 。 亦不宜 
经行 [ 天机巨门 ] 坐守的宫度 ， 往 往为挫败之期 。  """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """ 
寅申二宫七杀 ， 与 [ 紫府 ] 相对 ， 不喜紫微化权 ， 最 喜紫微化科 、 天 府化科 。 紫 
微化科主攻 ， 天府化科则主守 。 
寅申二宫七杀 ， 主人主观 ， 见昌曲则反而聪明自误 ， 见禄存同度 ， 其气虽和 ， 
成为美格 ， 但主观更重 ， 推断时不可不注意此点 。 须详视福德宫及夫妻宫 ， 以确定 
其品性 。 此影响后运甚大 。 
寅申七杀 ， 见火铃则暴燥 。 
寅申七杀 ， 以 [ 廉相 ] 、 巨门 、 破军 、 太阳为运限流 年之枢纽 。 
七杀在申 ， [ 廉贞天相 ] 在午虽不成 [ 雄宿乾无格 ]( 因七杀属金 ； 申亦属金 ； 廉贞 
属火 ， 午亦属火 ， 金火二气归 边 ， 各成一偏之气 ， 不能相制为用 ) ， 但亦喜廉贞化禄 、 
破 军化禄 ， 此二宫垣 ， 为发迹之期 。    """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 
辰戌二宫七杀 ， 与 [ 廉贞天府 ] 对拱 ， 较丑未宫 [ 廉 杀 ] 同度重理智 ， 但却多独特 
思想 ， 故最不宜与地空地劫同 会 ， 否则难以令人理解 ， 则因感觉到人生缺乏知己 ， 
反则流为孤僻 ， 甚至多空想不切实际 。 
辰戌七杀 ， 见昌曲亦可 ， 唯 必须同时见魁钺或辅弼 ， 则可成富贵 ， 但若贪狼化 
禄来会 ( 注意个贪狼同时亦影响 『 福德宫 ]) ， 则恐欲望难以满足 ， 于是虽富贵亦多辛 
劳 。 
辰戌七杀 ， 以 [ 武曲天相 ] 、 [ 天同巨门 ] 、 贪狼所坐 宫垣 ， 或与上述星系对拱之宫 
垣 ， 为大运流年之枢纽 。 
辰戌七杀 ， 若 [ 福德宫 ] 紫微化权者 ， 必不利婚姻 ， 女命尤忌 ， 常主无婚姻生活 ( 或 
因忙碌 ， 或因配偶疾病 ， 视 实际星曜组合而定 。 ) 
大致而言 ， 子午七杀较踏实 ， 寅申 、 辰戌七杀多欲 望 ， 掌握此原则 ， 对推断有帮 
助 。 故贪狼一曜 ， 其星系组合性质 ： 对 七杀之影响 如何 ， 往往关系甚大 。 见 [ 火贪 ] 、 
[ 铃 贪 ] ， 尤主易发易破   """
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军得禄最吉 ， 谓之有根 。 可消除破军带耗散的缺 点 ， 而增强其创造力 。 破军 
化权于寅宫 ， 有禄存同度亦吉 ， 唯虽富贵而人生必有缺陷 ， 例如自身健康欠佳 。 破 
军化权于申宫 ， 与禄存对拱者亦有同样情况 。 
破军见辅弼魁钺主富贵 ， 然贵大于富 ， 即其财帛系 随其地位而来 。 唯若有四 煞 
混杂其中 ， 则利于从事工商业 ， 倘见昌曲而有煞 ， 主其人为寒士 ， 时生怀才不遇之 
心 。 若见煞曜重而吉曜轻 ， 则宜从事工艺 ， 或属劳工阶层的专业 。 
 
破军畏羊陀 ， 甚于畏火铃 。 见火铃主劳碌奔波而已 ， 见羊陀则有灾 ， 亦主终生 
带疾 ， 或染不良嗜好 。 
破军有 [ 继旧换新 ] 的特性 。 所以每多兼行兼业兼职 兼差 。 化禄则主新事业因旧 
事业而来 ， 且 新旧事业同时经营 。 
破军之破坏力虽大 ， 但却不同七杀 ， 主立刻发生改 变 。 破军之破坏力 ， 主要表
现为 [ 宁为玉碎 ， 不为瓦全 ] ， 所 以带有耗散的本质 。 若与擎羊同度 ， 则为 『 刑耗 』 ， 
往往加 强基 『 玉碎 』 的意味 。 
破军亦喜与紫微同度 ， 或与紫微对拱 ， 则主有权 。 唯此与紫微七杀之权不同 。 [ 紫 
破 ] 之权在于公众方面 ， 如机 关主管 ， 牵涉及公众事务 ， 而 『 紫杀 ] 之权乃在机构之 
内 ， 如 工厂主管 ， 所管仅厂内人员 。 一公一私 ， 最宜仔细分别 。 
凡破军在命身宫 ， 无论如何会合吉星祥曜 ， 亦必无 全美 。 或能富而不能贵 ； 或 
能贵而不能富 ； 或妻子不全 ； 或有慢性疾患缠身 ； 或有破相 。 
破军化禄而见煞刑等曜 ， 女命主整容 。 男命则主受 伤破相之整容 。 
破军守命 ， 主白手创兴事业 。 唯与天同之破尽祖业 而后自行兴创不同 。 破军可 
以藉父祖荫庇余力 ， 自行开创改革以兴家 。 
破军必与天相相对 。 天相除受左右夹宫星曜影响 外 ， 受破军之影响亦大 。 由于 
破军从命的人每多离乡背井 ， 因破军之吉凶 ， 能影响 [ 迁移宫 ] 天相的吉凶 ， 故天相 
之受 影响程度 ， 亦关系人生甚大 ， 不能以其为 [ 迁移宫 ] 而忽视 
之 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "亥" or dizhi == "丑"):
            tmp = """ 破军在亥 、 子 、 丑三垣 ， 均不宜与文曲同度 ， 尤不 宜文曲化忌 ， 主少年离乡背井 ， 
或带残疾 ， 或遭逢重大挫折 。 古人说 ：『 与文曲入于水域 ， 残疾离乡 。 』 即此之论 。 [ 水 
域 ] 即指亥子丑三宫而言 。 """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫破军 ， 对宫为 [ 廉贞天相 ] ， 廉贞能和破军之 气 ， 故见吉化吉曜即能富贵 。 
唯若廉贞化忌 ， 或天相为刑忌所夹 ， 则成败局 。 破军与擎羊躔会天马而无禄 ， 亦为 
败局 。 
破军子午宫吉化 ， 称 [ 英星入庙格 ] 。 最喜对宫天相 见禄 ， 古代主立功于疆域边 
塞 ， 或为军旅重臣 。 现代则主能突然兴创事业 ， 故亦可成为企业领导人才 。 
[ 英星入庙 ] ， 开始发迹于太阴运或天同运 。 不宜再 行破军流年 ， 亦不喜行武曲 
化忌 ， 或廉贞化忌之宫限 。 稍带煞星 ， 即无全美 ， 故宜详察十二宫垣的缺憾 。 
子午破军而不成 [ 英星入庙格 ] 者 ， 六亲无缘 ， 凡事 须亲力亲为 ， 且易染疾患 。 
此则以 [ 紫微天府 ] 、 巨门 ] 武曲 、 天梁坐守诸宫垣 为枢纽 。 大运则视武曲 ， 或 [ 紫府 ] 
为枢纽 。 盖武曲天府为财星 ， 若原局破军无禄见煞 ， 行至财星躔度的宫垣见禄见吉 ， 
则亦能补救 ； 倘若不见禄而见煞 ， 则一生运程大打折扣 。  """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """ 
[ 破 军 贪狼逢禄马 ， 男多浪荡女多淫 ] ， 即指寅申破军而言 。 尤忌与空劫同度 ， 
则主一生孤独 。 若对宫 [ 武相 ] 会辅弼 、 昌曲而又带煞者 ， 古代谓系穿州过省优伶之 
命 。 
寅申破军 ， 大致以 [ 武曲天相 ] 、 [ 太阳天梁 ] 、 [ 天同巨门 ] 、 [ 廉贞天府 ] 宫垣为 
流年大限之枢纽 。 寅申宫破军 ， 不必见火铃 ， 已主少小离家 。 见禄马 于迁移宫者 ， 主发迹于远方 
异域 。 倘见火铃于命宫或父母宫 ， 则主重拜父母 ， 亦主一生多更换上司领导 。 
寅申破军会 [ 火贪 ] 、 [ 铃贪 ] 者 ， 主一生起伏波折甚 大 ， 暴起暴跌 ， 横发横破 。 
其挫败之由 ， 乃因主观过强 ， 又强行出头 ， 或不自量力与人竞争而起 。 以天机 、 [ 廉 
贞天府 ] 两宫垣为枢纽 ， 若宫垣吉者 ， 后运亦较顺遂 ， 否则于 会合 武曲化忌 ， 或天相 
为刑忌夹之年暴败 ， 且易从此一蹶不振 。    """
            print(tmp)
            print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 
辰戌宫破军 ， 受对宫 [ 紫徽天相 ] 影响 ， 故名大于利 。 古人云 [ 逢紫微则失威权 ] 
者 ， 即指此而言 。 因此虽有声望 ， 亦仅属虚名 ， 并不主实权实职 。 
辰戌宫 破军见煞刑耗曜 ， 主一生孤独 ， 且婚姻不吉 ， 或生 离或死别 。 又主身带疾 
患 。 
辰戌破军只与昌曲同度 ， 而无其他辅佐吉曜 ， 一生 贫寒 。 
辰戌破军必须化禄 、 化权始为吉造 ， 七杀带禄来会 亦吉 ， 则可富裕 。 
辰戌破军 ， 女命 ， 若廉贞化忌或贪狼化忌于夫妻宫 者 ， 主再嫁 。 
辰戌破军 ， 以七杀 、 贪狼 、 [ 紫相 ] 、 [ 天机巨门 ] 宫垣 ， 为流年大限之枢纽 。 
辰戌破军见 [ 火贪 ] 、 [ 铃贪 ] ， 发亦主名而不主利 。  """
            print(tmp)
            print("\n")
def GongXia2nd(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫紫微独坐 ， 躔桃花诸曜 ， 兄弟行中以长女为先 。 或与长兄不和 。 
子午紫微见 [ 百官朝拱 ] ， 则长兄长姐得力 。 唯必须 甘心处于 [ 佐贰 ] 之副手地位 。 
始可与人合作共事 ， 否则于大限流年之 [ 兄弟宫 ] ， 行至 [ 武曲天相 ] 同度宫垣 ， 或破 
军独坐宫垣 ， 见煞忌 ， 合作关系会决裂 。 
子午紫微为 [ 在野 ] 或 [ 无道 ] 之格局 ， 兄弟难靠 。 与 人合作易受人剥削 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """丑未 [ 紫破 ] 同度 ， 见煞 ， 兄弟各结成党 。 或刑克不 和 ， 或有异胞兄弟 。 将此意 
    义推广 ， 自己与共事的同事关系 ， 亦易成党派 ， 且主政治 、 权力斗争 。 见煞曜尤确 ， 
    见辅佐吉曜则较平和 。 
    丑未 [ 紫破 ] 有煞忌刑曜 ， 必于流年兄弟宫为 [ 紫破 ] 或天相时 ， 发生不良克应 。 
    倘若 [ 紫破 ] 原有吉曜会照 ， 则 于流年兄弟宫 行至 [ 武曲七杀 ] 或天府独坐时 ， 有良好 
    克应 。 可以合作创业 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """ 寅申宫 [ 紫府 ] 同度 ， 亦主长兄长姐得力 ； 见煞忌刑 曜则反受剥削 、 拖累 。 亦可 
    将此性质推广至合作伙伴或同事间关系 。 
    寅申 [ 紫府 ] 同度 ， 吉者 ， 每于兄弟宫行至武曲 『 太 阳 、 巨门 』 太阴等宫垣克应 ； 
    凶者 ， 每于兄弟宫行至破军 、 七 杀 、 廉相 、 巨门等宫垣克应 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """ 卯酉宫 [ 紫贪 ] 守兄弟宫 ， 见桃花诸曜主兄弟行中先 见长女 ； 见空曜则主兄弟行 
    中赞凶长兄 。 
    卯酉宫 [ 紫贪 ] 多吉曜 ， 亦主兄长得力 ； 倘见火贪则 富裕 ， 唯反与自身无益 。 若 
    煞忌刑耗并见 ， 主受累倾家 ； 更见桃 花诸曜 ， 又见辅佐单星 ， 主乱伦 。 
    卯本宫 [ 紫贪 ] ， 与异性合作时每易生情愫 ， 且易招 不利 。 克应的年份 ， 每为天 
    同 、 巨门守兄弟宫之时 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """  
    辰戌宫 [ 紫微天相 ] ， 亦主有异母兄弟 ； 倘见魁钺 、 辅弼 、 昌曲 ， 则往往有双胞 。 
    辰戌 [ 紫相 ] ， 见吉曜则主和好合作 ， 见凶曜则各怀 异见 。 皆每于流年兄弟宫行 
    至 [ 紫相 ] 、 破军 、 [ 武府 ] 的年份 克应 。 若折产破裂 ， 则于 [ 机巨 ] 、 天梁的年份克应 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """巳亥宫 [ 紫杀 ] ， 见吉则兄弟有权贵 ， 亦主可依附权 贵之友人 。 若见煞 ， 则受欺 
    负 。 
    巳亥宫 [ 紫杀 ] ， 会 [ 武贪 ] 与火铃同度 ， 更有 吉 曜 ， 主兄弟或友人提携自身发迹 。 
    巳亥宫 [ 紫杀 ] ， 吉则于天相 、 [ 巨阳 ] 的宫垣克应 ； 凶 则于 『 武贪 ] 、 [ 廉破 、 的 
    宫垣克应 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        
        if(dizhi == "子" or dizhi == "午"):
            tmp = """天机独坐子午见辅佐吉曜多者 ， 亦主兄弟姐妹众多 。 但一生交友虽多 ， 却难得有 
知交 ， 或与知交半路分张 。 若 见煞忌刑曜 ， 则易受兄弟或朋友拖累 ， 凡束可妄自出 
头 。 
子午天机 ， 不宜行至太阳化忌 、 太阴化忌的宫垣 。 主受兄弟 、 友人拖累 。 
子午天机 ， 自身常喜与人合作 ， 除非辅佐吉曜重重 ， 否则必各怀机心 ， 凶终隙 
末 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """丑未天机守兄弟宫 ， 见煞主刑克 ， 或兄弟有流产小 产 ； 见吉亦主早产 。 亦 主与 
不甚相熟的友人合作 ， 而致损 破 。 
丑 未天机见煞忌刑重重者 ， 易与兄弟或友人争讼 。 以太阳 、 巨门 、 天梁宫度为 
克应之年 。 若见吉 ， 则主有兄弟友人为自己奔波 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """寅申宫 [ 天机太阴 ] 同度 ， 见化忌 ， 则兄弟朋友间皆 易生权术阴谋 。 必须见吉 ， 
    然后始主平和 ， 但仍少助力 。 
    寅申 [ 机阴 ] 见辅佐吉曜 ， 则一生得兄弟及友人之 力 。 与人合作虽不持久 ， 但时 
    时有使用伙伴 。 若更见禄马交驰 ， 则有远方友人助力 。 
    寅申 『 机阴 』 见煞 ， 兄弟及知交流离 ， 不处一方 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """ 卯酉 『 天机巨门 』 守兄弟宫 ， 见煞曜主始善终恶 。 见 吉曜 ， 则多短暂的助力 ， 
    不宜谋求长期合作关系 。 
    卯酉 [ 机巨 ] ， 亦主多饮食之友 。 
    卯酉 [ 机巨 ] 不宜兄弟宫行至 『 杀破狼 』 的宫度 ， 见煞 忌 ， 主乖离 、 是非 、 词讼 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """辰戌 [ 机梁 ] 守兄弟宫 ， 主兄弟姊妹有小产流产 。 亦 主与知交或合作伙伴中道分 
    张 。 见辅佐诸曜仅增加数目 ， 不改变性质 。 
    辰戌 [ 机梁 ] 主有能言善辩之友 ， 见吉曜则诤谏之 友 。 
    辰戌 [ 机梁 ] 见吉者 ， 于经行 [ 巨阳 ] 、 [ 武贪 ] 宫垣多 主克应 ； 见煞者 ， 于兄弟宫 
    经行 [ 巨阳 ] 、 [ 廉破 ] 、 [ 武贪 ] 宫 垣多主克应 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥宫天机独守兄弟宫 ， 即使无煞 ， 亦主兄弟或友 人相背 ， 知交寥落 。 必须见 
辅佐诸曜 ， 始主交友广阔 ， 但 知交仍稀 。 
巳亥宫天机 ， 不宜与人合作 ， 主有权术侵占之类事 端 。 见吉则多短暂助力 。 
巳亥宫天机 ， 以兄弟宫行 [ 同巨 ] 、 『 武相 』 、 [ 廉府 ] 等 宫垣 ， 为吉凶克应之期 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午太阳守兄弟宫 ， 居子宫者无力 ， 居午宫者则易 贵而不实 ， 备有缺陷 。 
子宫太阳易受友人挑剔 ； 午宫者则得诤谏之友 。 见 煞忌 ， 长兄死亡 。 或主因兄 
弟友人之事牵涉风波 。 
子午太阳 ， 兄弟知交皆易离散 。 见吉 ， 则离散后仍 主助力 。 
子午太阳 ， 以天同宫垣为不利事端克应之期 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "太阳太阴"):
                tmp = """丑未 『 太阴太阳 ] 同守兄弟宫 ， 一般情形下主兄弟朋 友众多 。 入庙见辅佐诸曜则 
    有助力 ； 落陷见煞忌 ， 则主生损害 、 刑克 、 剥削 。 吉凶交杂 ， 多泛泛之交 。 
    丑未 [ 阴阳 ] 行至 [ 机巨 ] 守兄弟宫的大限流年 ， 绝不 宜与人合作 ， 主决裂 、 拖累 。 
    丑宫者 ， 若太阳化忌 ， 主受兄弟或友人伤害 ； 未宫 者 ， 若太阴化忌 ， 主为兄弟 
    或友人破财 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "太阳巨门"):
                tmp = """ 寅申 [ 太阳巨门 ] 同度 ， 见吉曜则兄弟友人皆有助 力 ， 宜发展彼此有联系的业务 。 
    寅申 [ 巨阳 ] 化权禄 ， 主受异族友人提携 。 化忌 ， 则 主兄弟朋友始善终恶 ， 有极
    大纠纷 。 以 [ 机梁 ] 、 [ 同阴 ] 为克 应之年 
    一寅宫者交友较广 ； 申宫苦 ． 多泛泛之交 。 诸吉遍集 ， 则主自身为兄弟友人服 
    役 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "太阳天梁"):
                tmp = """ 卯酉 『 阳梁 』 守兄弟宫 ， 见煞主兄弟分离 ， 无助力 。 见刑忌 ， 主兄弟或友人争 
    产 。 见辅佐吉曜 ， 则有可依靠之兄姊 ， 或主得友人提携 。 卯宫又优于酉宫 。 
    卯酉 [ 阳梁 ] ， 以兄弟宫经行 [ 阳梁 ] 本宫及对宫为克 应之年 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌宫太阳 ， 辰宫者 ， 兄弟多和 ， 戌宫多不和 。 
辰宫者多异性友人 ， 见吉且主助力 。 
辰宫者主多异族朋友 。 
辰宫太阳化忌 ， 亦主多异族友人 ； 戌宫太阳化忌 ， 主兄弟朋友多是非口舌 。 
辰戌太阳见吉曜 ， 皆可与友人合作 ， 唯戌宫者不耐 久 。 以 [ 同梁 ] 、 天机 、 巨门 
踞兄弟宫为克应之年 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥太阳皆主交友广阔 。 巳宫者主动 ； 亥宫者被动 。 巳宫者且多异族友人 。 
已宫太阳化忌 ， 主知交离散 ； 亥宫者主多是非争端 。 
巳宫太阳吉化 ， 见辅佐诸曜 ， 得良好合作伙伴 ； 亥 宫者平常 。 
巳亥太阳 ， 以兄弟宫经行太阳 、 巨门 、 天梁 、 天同 诸宫垣 ， 为克应之年 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """  
凡武曲在兄弟宫 ， 见擎羊或火星同度 ， 皆主争财 。 与煞曜空劫同度 ， 兄弟明友 
稀少 ， 自身常感孤立 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """子午 『 武府 』 守兄弟宫 ， 吉曜多者始主和好 ， 稍见煞 曜 ， 即主面和心不和 。 
    子午 [ 武府 ] 见吉化亦不为助力 ， 除非命宫见辅弼 ， 然后始有兄弟友人相助 。 见 
    煞 忌刑曜 ， 受兄弟友人拖累 。 不见禄 ， 则受剥削争夺 。 故凡 『 武府 』 守兄弟宫 ， 一 
    般不宜与 人合作 。 以 『 机巨 』 、 破军 、 [ 紫相 ] 守兄弟宫之年为克应 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "武曲贪狼"):
                tmp = """ 丑未 [ 武贪 ] ， 见吉化 、 吉曜 ， 则可受兄弟友人之益 荫 ， 但不可争权 。 见煞忌刑 
    曜 ， 则反主益荫兄弟及友人 。 未宫优于丑宫 。 
    丑未 『 武贪 ] 与火铃同度 ， 无刑忌 ， 自 身命宫又会吉曜吉化者 ， 主因兄弟可友人 
    而横发 。 
    丑未 [ 武贪 ] 见煞忌刑 ， 自身命宫又弱 ， 则主一生受 制 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "武曲天相"):
                tmp = """寅申宫 [ 武相 ] 同度 ， 见吉则主助力 ， 见煞 ( 或 [ 刑 忌夹印 ] ) 则主动助友人反受连 
    累 。 常以 [ 同巨 ] 宫垣为克应 之年 。 
    寅申 [ 武相 ] 又主兄弟或友人可以技艺相助 。 
    寅申 『 武相 』 多桃花 ， 又见煞忌 ， 则配偶易受自身友 人挑引 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "武曲七杀"):
                tmp = """卯酉 【 武杀 】， 守兄弟宫 ， 见煞 ， 主兄弟朋友间争财 。 见辅佐吉曜 ， 吉 化 ， 然后 
    有短暂时期助力 ， 但仍不持久 。 
    卯酉 『 武杀 』 ， 若与人合作 ． 须防弄权侵吞 。 故以不 与人合作为宜 。 
    卯酉 [ 武杀 ] 不利之克应 ， 常为天机 、 巨门 、 紫破 、 同梁 躔兄弟宫之年 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰成宫武曲 ， 见吉曜则主兄弟及友人和好 ， 助力仍 少 。 见煞忌刑者 ， 则无助力 ， 
甚至生连累 。 羊陀夹武曲化忌 ， 因兄弟友人而自身受伤 ， 或破耗甚大 。 
辰戌宫武曲 ， 见煞 ， 主兄弟友人夺权 。 故不宜合作 。 不利之克应 ， 为武曲 、 破
军 、 七杀躔兄弟宫之年 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """ 巳亥 [ 武破 ] 守兄弟宫 ， 即使见吉曜 ， 亦不主兄弟友 人得力 ， 合作亦不耐久 。 见 
    煞忌刑曜 ， 更主受掣肘 。 唯交异族 、 异乡友人 ， 情形则较佳 。 
    巳亥 [ 武破 ] 会廉贞化忌 ， [ 武破 ] 又与火铃同躔 ， 主 因兄弟或友人而生血光之灾 。 
    常以 [ 廉杀 ] 、 『 武破 ] 躔兄弟宫 之年为克应 。 ( 有过一个实例 ， 一为友人输血 。 ) """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """
凡天同守兄弟宫 ， 多主兄弟和好 ， 有煞亦多表面和 好 。 且主为人能结交中下 层的朋友 ， 唯无太多实际助力 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """ 子 午宫 『 天同太阴 』 同度守兄弟富 ， 兄弟众多 ， 但主 兄弟行中以长姊为大 。 见 
    煞忌 ， 则兄弟行中长兄难养 ， 以先见姊为宜 。 
    子午 『 同阴 』 ， 见吉仅主兄弟温驯 ， 友人亦助力薄弱 。 见煞忌刑 ， 再见空劫 ， 主 
    兄弟中有弱智耆 ， 又主受友情拖累 。 
    子午 [ 同阴 ] ， 与友人合作 ， 常嫌友人不足以任事 。 见煞则感情破裂 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """ 丑未 [ 天同巨门 ] 同度 ， 见禄必起纷争 ； 见煞者则易 凶终隙末 。 
    丑未 [ 同巨 ] ， 见吉亦主一时助力 。 故不宜有长 期合作计划 。 
    丑未 【 同巨 】 居兄弟宫的人 ， 常有与人合资的冲动 ， 则于太阴 、 天机 、 [ 同巨 ] 
    守兄 弟宫的年限 ， 为口舌纷争拆股之期 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天同天梁"):
                tmp = """ 寅申宫 『 同梁 ] 同度 ， 稍见煞曜 ， 即主兄弟或友人表面和好 ， 内心各怀鬼胎 。 煞 
    重 ， 与兄弟或事业合作伙伴互相倾轧 。 见吉 ， 则和好而易离散 。 
    寅申 [ 同梁 ] 同度 ， 煞刑并见 ， 无兄弟但有姊妹 。 见 昌曲 ， 或见魁钺 ， 而不见辅 
    弼 ， 主有异母兄弟 。 
    寅申 『 同梁 』 ， 倾轧离散克应之期 ， 为天相 、 巨门躔 守兄弟宫的年限 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """ 卯本天同独坐守兄弟宫 ， 卯宫兄弟五人 ， 酉宫仅二 三人 。 亦以先姊后弟为宜 ， 
否则长兄难养 。 
卯酉天同 ， 亦主交友广阔 ， 唯实际助力不大 。 略见 煞曜 ， 则多征歌逐色游乐之 
友 。 
卯酉天同见昌曲 ， 姊妹多兄弟少 。 再单见魁钺 ， 主 各胞 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌天同守兄弟宫 ， 兄弟或友人间常多无谓争执 。 见煞重 ， 则主受拖累 ， 或生 
大决裂 。 
辰戌天同 ， 见辅佐吉曜 ， 亦主兄弟多 ， 或交友广 ， 且多与友人合作的机会 ， 但 
仍必须事事亲力亲为 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """
巳亥天同独坐守兄弟宫 ， 亦主兄弟众多 ， 唯一般情 形下姊妹多于兄弟 。 同时亦 
主交友面广 ， 尤擅结交地位不如己者 。 
巳亥夭同亦主多与事业合作伙伴暗争 。 见煞忌刑重 尤确 。 ‘ 有时又为自身配偶与 
兄弟或夥伴之配偶不和 ， 引起争端 。 其争端克应之期 ， 为 [ 天机巨门 ] 、 天梁蹿度兄 
弟 宫 之年限 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """ 
凡廉贞守兄弟宫 ， 兄弟宫及朋友之间 ， 以 [ 君子之交淡如 水 ] 为宜 。 除非吉化吉 
曜并集 ， 则主得助力 ， 此时即应谋善处 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """ 子午宫 【 廉贞天相 】 在兄弟宫 ， 无煞则主感情融洽 ， 且亦有友人助力 。 交友面 
    不太广 ， 但亦多朋友 。 
    子午 [ 廉相 ] 见煞忌刑诸曜重重同会 ， 则主兄弟中有 残疾者 ； 与人结交 ， 愈亲密 
    愈易反目成仇 ， 煞轻则减等 。 反目克应 ， 为太阳 、 天梁 、 巨门守兄弟宫之年 。 
    子午 [ 廉相 ] ， 结交不宜太滥 ， 否则易结党纷争 。 则 以破军为克应之期 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未 [ 廉杀 ] 在兄弟宫 ， 见权禄及吉曜者 ， 兄弟融洽 ， 见煞曜则 主表面和洽 ， 助 
    力不足 ； 若更见忌星 ， 则主因兄弟或友人而受损伤 、 破耗 。 以兄弟宫见煞忌刑耗之 
    年为克应 。 
    丑未 [ 廉杀 ] 见辅佐吉曜及吉化 ， 可得友人合作之 力 ， 因而带挈自身 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """ 寅申廉贞独坐兄弟宫 ， 亦主兄弟感情和美 ， 但无实 际助力 。 与人交往 ， 交深则 
反易招怨 。 故以不与人合作事业为宜 。 
寅申廉贞 ， 每易于破军或 [ 紫相 ] 守兄弟宫的年份 ， 与友合作事业 ， 如见煞曜 ， 
则不出三年便千反目 ， 或备怀心病 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉宫 『 廉贞破军 』 同度 ， 见火铃 ， 兄弟或知交成仇 。 见吉曜及吉化 ， 则可以 
    融洽持久 ， 且亦可合作营运事业 ， 主得力 。 
    卯 酉 [ 廉破 ] 见辅佐单星 ， 主兄弟各胞 ， 亦主牵涉及 友人之纷争 。 如廉贞化忌 ， 
    则受累甚大 。 以有忌星冲起廉贞化忌之年为克应 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌 [ 廉府 ] 守兄弟宫 ， 兄弟多 ， 交友亦较广 。 唯必 须天府不 [ 空露 ] ， 然后始吉 ， 
    否则反主受剥削拖累 。 
    辰戌 [ 廉府 ] 有煞忌 ， 则兄弟间配偶易生不和 ， 或友 人间配偶不和 。 
    辰戌 [ 廉府 ] 见咸池 、 大耗 、 天姚 、 沐浴 ， 命宫见红 鸾天喜 ， 主易与兄弟或事业 
    伙伴之配偶暗恋 。 见煞则由是惹起大祸 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥 [ 廉贪 ] 守兄弟宫 ， 兄弟或知交反易生尤怨 。 故 以人合作事业为宜 。 
    巳亥 [ 廉贪 ] 见贪狼 化忌 ， 主受兄弟或合作夥伴支排 差遣 ， 但仍受怨责 。 唯夥伴 
    之工作能力则甚强 。 故须注意善处之道 。 
    巳亥 [ 廉贪 ] 见廉贞化忌 ， 又见煞 ， 则尤怨甚深 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """凡天府守兄弟宫 ， 府库不宜 『 空露 ] ， 否则主受兄弟 或友人剥削连累 。 
凡天府守兄弟宫 ， 会天姚 、 天虚 、 大耗 ， 主兄弟或 友人权术阴谋 。 
天府守兄弟宫 ， 见辅佐诸曜中之一对 ， 却又另见 [ 单 星 ] ， 主兄弟各胞 。 
天府守兄弟宫 ， 见 煞忌刑曜主兄弟少或主多而刑 克 ； 见辅佐诸曜始主兄弟众多 。 
天府守兄弟宫 ， 最嫌会廉贞化忌 ， 主兄弟或知交反 目 ， 恩反成仇 。 亦嫌会武曲 
化忌 ， 主为兄弟或友人破财 ， 煞重则为争财之兆 。 
 """
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 天府独守兄弟宫在丑未者 ， 吉凶多在天同 、 巨门 ， [ 武破 ] 宫垣为兄弟宫时克应 ；"""
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """在卯酉二宫者 ， 吉凶克应之期 ， 为 [ 紫破 ] 、 [ 廉贪 ] 、 天相守兄弟宫之年限 ； """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳亥二宫 者 ， 吉凶克应之期 ， 多在 [ 天同太阴 ] 、 [ 太阳巨门 ] 守兄弟宫 之年限 。 须详原局 
兄弟宫及克应星曜组合而视吉凶深浅 。 	 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守兄弟宫 ， 入庙 ， 夜生人最吉 ； 落陷 ， 夜生人 值之 ， 须见吉曜始主兄弟和 
荚 ， 若见煞 ， 则多刑克或不和 
太阴守兄弟宫 ， 日生人值之 ， 虽入庙亦不和美 ； 见 煞主刑克 、 不和 ； 见吉曜始 
和美 ， 但亦有缺憾 。 如日生人值太阴落陷 ， 则刑克甚重 。 
太阴守兄弟宫 ， 有刑者 ， 多主姊妹克应 。 ( 比较一 一太阳守兄弟宫有刑 ， 则主兄 
弟克应 。 ) 
太阴化忌守兄弟宫 ， 无煞 ， 虽主受兄弟或伙伴之累 ， 但多属无心之失 。 
"""
        print(tmp)
        print("\n")
                
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫太阴吉凶克应 ， 以天机 、 天同 、 天梁守兄弟 宫之年为重 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫太阴吉凶克应 ， 以 [ 紫破 ] 、 [ 同 梁 ] 守兄 弟宫之年为重 ；  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """太阴在亥宫化忌守兄弟宫 ， 男命 ， 反主得姊妹之力 ， 或宜与女性合作事业 。巳亥宫太阴吉凶克应 ， 以 [ 同巨 ] 、 
『 阳梁 』 守 兄弟宫之年为重 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守兄弟宫 ， 除巳亥二宫为贪狼陷地外 ， 一般情 形下均主兄弟和睦 ， 亦主人 
交友广阔 。 唯不见吉化吉曜者 ， 则多酒肉之交 。 
贪狼于巳亥陷地 ， [ 对星单见 ] ， 又见桃花者 ， 多主 有异胞兄弟 ； 见煞 ， 则兄弟 
知交多生尤怨 ， 或各怀异心 。 若贪狼化忌 ， 主 受累 。 
贪狼守兄弟宫 ， 若与火铃同度 ， 见寿 ， 主受兄弟或 合作伙伴益荫 ， 见煞忌 ， 则 
反主突然受累 ， 事前毫无征兆 。 
贪狼在兄弟宫成 『 泛水桃花 』 格局者 ， 生平多酒色之 友 ， 且因之受累 。 威 『 风 
流彩杖 』 格局者亦然 。  
贪狼在兄弟宫 ， 最嫌武曲化忌与贪狼化忌相照 ， 若 更见 [ 铃昌陀武 ] 之 格 ， 则主 
受累倾家 ， 或竟至意外 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午贪狼 ， 其吉凶克应 ， 多在 [ 同巨 ] 、 破军守兄弟 宫的流年 ； 寅申宫贪狼 ， 基 
舍凶克应 ， 多在 『 紫相 』、 破军 、 七杀守兄弟宫的流年 ； 辰成宫贪狼 ， 其吉凶多在天 
梁 、 天机 、 [ 廉相 ] 守兄弟宫的流年 。"""
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门于兄弟宫中为恶曜 ， 多主骨肉参商 ， 虽有辅佐 吉曜 ， 或见吉化 ， 亦仅主兄 
弟有成 ， 并不主兄弟感情深厚 。 稍见煞曜 ， 即多是非 。 若煞忌刑曜并见 ， 则 主受兄 
弟连累 ， 或致涉词讼 、 破耗 。 故巨门守兄弟 宫者 ， 绝不宜与人合作事业 。 唯 [ 太阳巨 
门 ] 守兄弟宫者 ， 可与异族人合作 。 
『 巨门交人 ， 始善终恶 』 。 故巨门在兄弟宫者 ， 不宜 酒肉深交 ， 以君子之交为宜 。 
巨门守兄弟宫 ， 场面上朋友多 ， 一深交即易涉及阴 私 ， 或竟因此致祸 。 以见煞
忌刑曜者为确 。 
巨门有兄弟不和 ， 骨肉参商的性质 ， 但如与异族人 交 ， 则反而可互相利用 ， 尤 
以与太阳同宫或相对时为确 。 但太阳必须 入庙 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午巨 门 ， 以 『 同梁 』 、 天机 、 巨门守兄弟宫为克应 之年 ；"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌巨门 ， 以巨门 、 
天同 、『 机阴 』 守兄弟宫为克应之 年 ；"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥巨门 ， 以天机 、 天梁守兄弟宫为克应之年 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相临兄弟宫 ， 须注意 [ 刑忌夹印 ] ， 及 『 财荫夹印 』 两个格局 。 不能单以天相 
会照的星曜而定 。 若 [ 刑忌夹印 ] ， 主受兄弟或友人拖累甚深 ； 若 [ 财荫夹印 ] ， 则主 
受兄弟 或友人益荫 。 以 [ 夹印 ] 之年为克应 。 
天相对武曲 、 廉贞 、 破军三曜至为敏感 。 此三曜化 吉则吉 ， 化忌或加煞则凶 。 
天相见昌曲 、 左右相夹 ， 或同会 ， 无虚耗刑煞者 ， 主兄弟双胞 。 但必须家族有 
双胞胎传统者始是 。 
天相守兄弟宫 ， 对煞曜至为敏感 。 四煞空劫多者 ， 主孤独 ， 亦主有祀入之兄弟 ； 
或主自身祀出 。  
"""
        print(tmp)
        print("\n")
               
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天相 ， 吉凶克 应之年 ， 以天相 、 巨门 、 [ 同梁 ] 守兄弟宫之年为克应 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫天相 ， 吉凶克应之年 ， 以 [ 机 梁 ] 、 天相 、 『 廉破 』 守 兄 弟宫之年为克应 ； """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥宫天相 ， 吉 凶克应之年 ， 以火相 、 巨门 、『 廉杀 』 守兄弟宫之年为克应 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守兄弟宫 ， 入庙和美 ， 落陷则不和美 。 会辅弼 、 魁钺和美 ， 会煞则不和美 。 
天梁无吉会 ， 兄弟少 ， 多则为各胞 。 见桃花诸曜 ， 主姊妹多兄弟少 。 
天梁吉 ， 则主兄弟或友人暗生助力 。 凶恶则主暗争 、 排挤 。 吉凶皆在暗面而不 
在明面 。 
天梁有孤克之性 ， 所以即使见吉曜 ， 亦不主可与人 合作 。 除非合作者完全退 居 
幕后 ， 作为自己的后台 。 
天梁对天机 、 太阴 二曜异常敏感 ， 吉化则和美得助 ， 若化忌且见煞曜 ， 则主兄弟 
或伙伴弄权 ， 或有阴谋诡计 。 
天梁与天姚同度 ， 主兄弟或伙伴深沉刁狡 。 更见刑 煞 ， 所会的太阳又落陷者 ， 
则主词讼纷争 。 见此星曜结构 ， 以不与人合作为宜 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午天梁守兄弟宫 ， 子优于午 。 然皆以太阳 、 天梁 躔度兄弟宫之流年 ， 为吉凶 
克应 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """丑未天梁 、 丑优于未 ， 以 [ 廉相 ] 、 破军 、 太阳守兄 弟宫之年为吉凶克应 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥天梁 ， 亥优于巳 ， 以 [ 紫相 ] 、 天梁 、 『 机巨 ] 躔 度兄弟宫之年 ， 为吉凶克应 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守兄弟宫 ， 见禄 、 权 、 科及辅弼 ， 兄弟众多 。 命宫见辅弼 ， 则兄弟宫之 七 
杀虽不会辅佐诸吉 ， 亦主兄弟 众多 ， 但有刑克或不和 。 
七杀守兄弟宫 ， 煞曜聚合者 ， 则主孤单 。 更见天刑 乃主刑克 。 否则兄弟自小分 
离 。 
若七杀在兄弟宫有煞刑诸曜 ， 而命宫又见辅弼诸 吉 ， 则或为两重父母 ， 例如本 
身多兄弟 ， 祀出后无兄弟 。 又或为本多兄弟而刑克至孤单 。 一一凡言刑克 ， 终身残 
疾者亦为刑克之应 。 
凡七杀在兄弟宫者 ， 命宫必有太阴相对 ， 由太阴庙 陷 ， 可以帮助推断兄弟及朋 
友间之人际关系 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午七杀守兄弟宫 ， 以 【 杀破狼 】 蹿兄弟 宫之年 ， 为 吉凶克应 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """ 寅申 七杀守兄弟宫 ， 除以 [ 杀破狼 ] 外 ， 亦以 [ 廉 相 ] 躔度为吉凶克应之年 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌七杀守兄弟宫 ， 以『 廉府 ] 、 [ 同巨 ] 躔兄弟宫之年为吉凶克应 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守兄弟宫 ， 多主有缺点 ， 会煞曜主孤单 ， 更会 刑忌则兄弟刑克 ， 知交反目 。 
即使会辅佐诸吉 ， 亦不利长兄或长姊 。 若与禄存间度 ， 则且需独立负起长子或长女 
之责任 。 与人合作 ， 亦主开创而不主收成 。 
破军守兄弟宫 ， 除非孤单 ， 否则兄弟年龄有差距 ， 由八年至十二年以上不等 。 
破军守兄弟宫 ， 火铃同度更见空劫 ， 主兄弟有两重 父母 ( 如祀出 、 过继 、 童年受 
抛掷 ) ， 否则主一生分离异地 。 故见此格局 ， 不宜与人合作 ， 否则易中道破裂 。 
破军守兄弟宫而辅佐吉曜咸集 ， 则可藉他人之力创 业 。 ( 注意禄存同度时情形恰 
恰相反 ) 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午破军守兄弟宫 ， 吉凶克应 ， 为破军 、 七杀 、 [ 廉 相 ] 蹿度兄弟宫之年 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申破军守兄弟宫 ， 以 [ 武相 ] 、 破军 、 [ 廉府 ] 躔度 兄弟宫为克应之年 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌破军守兄弟宫 ， 以 [ 紫相 ] 、 破军 、 七杀躔度兄 弟宫为克应之年 。 """
            print(tmp)
            print("\n")
        
def GongXia3rd(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """ 
男命夫妻宫见紫微者 ， 不论在何宫度 ， 皆宜妻子有 事业 。 若作家庭主妇 ， 即多 
将其领导力发挥于家庭 ， 甚至变成控制丈夫 。 
女命夫妻宫见紫微者 ， 若 『 在野 』 或 『 无道 』， 必须迟 至三十岁后始可发展感情 ， 
若早婚 ， 反易生挫折 ， 且会受拖累 。 见 [ 百官朝拱 ] 而无 『 单星 』 ， 始主丈夫得志 。 
"""
        print(tmp)
        print("\n")
        if(star == "紫薇破军"):
            tmp = """[ 紫破 ] 必须见 [ 百官朝拱 ] ， 又不见辅佐单 星 ， 然后始主婚姻吉利 。『 紫 
破 』 且主夫妻可以合作创业 ， 白 手兴家 。 唯 『 紫相 』 始终有缺点 ， 夫妻 年龄有大差 
距 ， 然后始可适应忍让 。[ 紫破 ] 宜配偶年龄有大差距 。 唯男命配年 长二三年之妻 ； 女命配年 
少二三年之夫 ， 亦作大差距看 。  """
            print(tmp)
            print("\n")
        elif(star == "紫薇七杀"):
            tmp = """ [ 紫杀 ] 必须见 [ 百官朝拱 ] ， 又不见辅佐单 星。 """
            print(tmp)
            print("\n")
        elif(star == "紫薇天相"):
            tmp = """ 紫相宜配偶年龄有大差距 。 唯男命配年 长二三年之妻 ； 女命配年 
少二三年之夫 ， 亦作大差距看 。 """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫紫微独坐 ， 百官朝拱 ， 则配偶得力 ， 地位高 ， 主观亦强 。 若为 『 在野 』 
或 [ 无道 ] 之格局 ， 则主配偶性格横 蛮 。 
子午紫微而偏于精神者 ， 主配偶有支配自己的倾 向 ； 偏于物质者 ， 主配偶时进 
支配自己的钱财 。 如星系结构吉 ， 则为良好的支配 ， 反之 ， 则每因配偶的支配 ， 而 
弄到自身破败或伤害感情 。 
子午紫微 ， 逢武曲化忌 ， 再行廉贞化忌之年 ， 主感 情破裂 ； 逢廉贞化忌 ， 再行 
武曲化忌之年 ， 主无夫妻生活 。 
子午紫微 ， 重精神者 ， 于经行 [ 天同巨门 ] 之年 ， 往 往易生感情变化 ； 重物质者 ， 
于经行破军及 『 武曲天相 』 之 年 ， 亦易生变化 。 一般而言 ， 女命不喜行 『 太阳天梁 』 
而太 阴化忌 ； 男命不喜行太阴在巳宫化忌 。 
子午紫微 ， 对宫贪狼为 『 泛水桃花 』， 行至 [ 天同巨 门 ] 易生苦恋 。 行至 『 太阳天 
梁 』 则易与配偶别离 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """ 丑未 [ 紫破 ] ， 一般不利居夫妻宫 。 虽本持安定 ， 亦 主婚前有波折 ； 若动荡昔 ， 
    则每易异离 。 
    丑未 『 紫破 』 ， 最不宜见辅佐 『 单星 』 ， 每主有第三者 介入 。 
    丑未 『 紫破 』 本质安定者 ， 经行煞忌刑耗空劫重重之 大运流年 ， 主配偶有灾病 ， 
    或事业倾败 。 原局 『 紫破 』 动荡 ， 经行此等宫垣 ， 则每主生离死别 。 一一此等宫垣 ， 
    以 『 紫 破 』 、 [ 廉贪 ] [ 同梁 ] 、 巨门坐守者最为吃紧 。 
    丑未 『 紫破 ] 会廉贞化禄 、 贪狼化禄 ， 又见桃花者 ， 每易有婚外感情 ， 更见虚耗 ， 
    则配偶且 有不良嗜好 。 每于再行 [ 紫破 ] 之年出事 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """ 寅申宫 [ 紫府 ] 同度 ， 若无辅佐诸曜 ( 或有 ， 而所见 者多 [ 单星 ]) ， 或府库 『 空露 ] ， 
    则防于贪狼 、 破军 、 巨门大 运 ， 婚姻发生变化 。 此等宫垣 ， 见煞忌空劫即为生变之 
    兆 。 
    寅申宫 『 紫府 ] ， 必须见辅佐对星者 ， 然后主白头偕 老 。 唯若禄存同度 ， 仍主配 
    偶自私 ， 有支配欲 。 
    寅申 『 紫府 』 ， 天寿同躔 ， 男命宜小配 ， 女命宜长配 。 
    寅申 『 紫府 』 而倾向于进取性者 ， 居夫妻宫并不主配 偶有进取心 ， 反主易生外 
    鹜 ， 其外鹜之年 ， 多为 『 廉相 』 、 天 同 、 天机三垣 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """ 卯酉宫 [ 紫贪 ] 须分别 物欲或情欲的本质 。 物欲 『 紫 贪 ] 主配偶进取 ； 情欲者则婚 
    前因多波折 ， 婚后亦每易 生外心 。 
    卯酉 { 紫贪 } 又见昌曲 ， 每生非礼成婚 ( 『 紫破 』 则见 辅弼 ) 。 但可免生离死别之克 。 
    唯与廉贞化禄会者 ， 配偶不 顾家室 ； 与廉贞化忌会者 ， 配偶聪明而易丧志 ， 且善找 
    寻刺激 。 
    『 紫贪 』 见吉 ， 不可作 『 桃花犯主 』 看 。 亦主夫妻可以 合作创业 ， 唯必须以配
    偶为事业主体 。 
    卯酉 『 紫贪 』 ， 凶者以经行巨门 、 廉杀 、 武破 、 太 阳坐守宫垣为克应之年 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """ 辰成 『 紫相 』 ， 男命配妻宜年小 ( 可小十二年以上 ) ， 女命配夫宜年长 ( 八年至十 
    二年 ) 。 若 『 紫相 』 无情者 ， 尤须 夫妻年龄有差距始可弥补 ， 否则主生离 。 
    辰戌 『 紫相 』， 以与曾结婚或同居的人结合为宜 。 见 辅佐 『 单星 』 者尤然 。 
    辰戌 [ 紫相 ] 无情 ， 虽夫妻感情不变 ， 仍防配偶突生 疾患 。 见大运流年夫妻宫叠 
    冲煞忌之年克应 。 
    辰戌 『 紫相 』 有情 ， 见辅弼吉曜 ， 利夫妻合作创业 ， 谓之夫唱妇随 ， 可以发达 
    兴家 ， 然仍备怀自私之心 。 
    辰戌 『 紫相 』， 吉者以 [ 阴阳 ] 、 [ 武府 ] 、 破军 、 七 杀 为克应之年 ； 凶者以 『 武府 』 、 
    破军 、 天梁为克应之年 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """ 巳亥 [ 紫杀 ] 一般均主配偶弄权 。 若见辅佐吉曜 ， 则 配偶事业广大 。 唯易与自 身 
    会少离多 ， 或同居一宅但关系 却疏远 。 
    巳亥 『 紫杀 』 ， 见 『 火贪 』 、 『 铃贪 』 ， 不躔桃花 ， 主配 偶突然发迹 ； 躔桃花 ， 主 
    配偶感情突生变化 。 
    『 紫杀 』 在夫妻宫以迟婚为宜 。 
    己亥 [ 紫杀 ] ， 吉者以 [ 武贪 ] 、 财荫夹的天相 、 [ 廉破 ] 为克应之年 ； 凶者以 [ 同阴 ] 、 
    刑忌夹的天相 、 或再经行 『 紫 杀 』 为克应之年 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """
天机在夫妻宫者 ， 基本上不利 。 唯与太阴相对或同 度的情形下 ， 见吉曜 ， 然后 
始主谐美 。 
天机在夫妻宫最不喜天同或巨门化忌 ， 均主感情困 扰 ， 古代以此为婢妾女命 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天机"):
                tmp = """子午天机独坐 ， 对宫巨门 ， 稍带煞曜即己主夫妻貌 合神离 。 若天机化忌或巨门 
化忌 ， 则夫妻因性格不合或不满客观环境 ， 时生改变之心 。 若巨门 化忌者 ， 虽离异 
仍难求满意对象 。 
子午天机化忌 ， 夫妻各怀机心 ， 再见煞 ， 则往往于 [ 同梁 ] 或 [ 廉贪 ] 宫度发生事 
端 。 再婚即多满意 。 一一唯须 注意 ， 天机化忌而火铃空劫同度者 ， 再婚亦仍不佳 。 
子午天机见天同化禄者吉 ， 主夫妇白手兴家 。 若天 同化忌 ， 则主离多会少 。 
子午天机见吉 ， 不怕行太阴 、 太阳限 ； 若见煞忌 ， 行太阴太阳限 、 亦主口舌纷 
扰 。 
子午天机以 [ 同梁 ] 星系最为关键 ， 见火铃主恶性分 离 ； 见禄马主良性分离 ； 见
煞忌亦主离异 。 若见禄权科会 ， 则夫妻可以白头 。 但若同时见巨门化忌 ， 则仍须自 
我克制 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天机"):
                tmp = """丑未天机独坐 ， 对宫为天梁 ， 于夫妻宫有所不宜 。 多主早婚而离异 ， 或虽迟婚 ， 
但婚前却经多次恋爱挫折 ， 见空劫者尤然 。 
丑未天机最怕陀罗同度 ， 不但婚迟 ， 而且多误良缘 ， 反与性格不投的人结合 ， 
由是滋生不满 。 
丑未宫天机吉化 ， 无煞者尚可 ， 有煞 ， 虽吉化亦不 意味姻缘美满 。 以年龄有差 
距 ， 或妻子年龄反比丈夫大者为宜 ， 始能偕自首 。 
丑未天机 ， 以婚前饱经挫折 ， 或婚前有风波阻碍者 为佳 。 若婚前顺利 ， 则婚后 
反易会少离多 ， 或貌合神离 。 
丑未天机 ， 不宜经行宫垣见太阳化忌 ， 太阴化忌 。 大致而言 ， 以 [ 廉相 ] 、 巨门 、 
天同 备宫垣为吉凶枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """ 寅申宫 [ 天机太阴 ] ， 男命优于女命 。 男命夫妻宫见 [ 机月 ] ， 主妻子美容 ， 且能 
内助 。 女命则反要防丈夫易受 异性垂青 。 
寅申宫 [ 机月 ] ， 若情绪化过甚 ， 则 易旨起婚姻波折 ， 如配偶移情别恋之类 。 
寅申宫 [ 机月 ] 会天同化忌 ， 易空劫 、 阴煞 、 天虚 、 大耗等曜 ， 主配偶心志卑弱 ， 
或过份敏感 ， 由是亦易发生婚姻风波 。 
寅申 [ 机月 ] 以太阳 、 天梁 、 天同 、 巨门四垣为吉凶 之枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯本宫 [ 天机巨门 ] ， 必须见禄 ， 然后夫妻始偕白发 。 但火铃同度则成破格 ， 主 
始则和谐 ， 终亦成冰炭 。 以天同 、 天梁宫垣 为克应之期 。 
卯酉 宫 [ 天机巨门 ] ， 以订婚后即有风波 ， 经历风波 始谐连理者为宜 。 否则婚后 
多变故 。 若天机化忌 ， 主易与有家室的人恋爱 ； 若巨门化忌 ， 则更多感情上的隐衷 。 
见煞 ， 主二婚 。 
女命夫妻宫不宜 『 机巨 』 。 古人说 ， 『 天机巨门为破 荡 ] ， 虽指命宫 ， 在夫妻宫者 
亦然 。 见火铃或陀罗与天同同 躔 ， 即非一婚之命 。 
卯酉宫 [ 机巨 ] ， 常以 『 武曲天府 』 限为关键 。 化禄化 忌均生变化 。 男女命均易 
为有家室的人追求 ， 由是产生感困扰 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """ 辰戌宫 [ 天机天梁 ] 同度 ， 主迟婚 ， 或婚前有恋爱风 波 ， 否则生离 。 
辰戌宫 【 天机 天梁 】， 见吉曜会合 ， 配夫宜年长 ， 配 妻宜小六年以上 ， 则夫妻白 
头偕老 。 亦主婚前一度离别 ， 再见面始谐连理 。 
『 机梁 』 在辰 ， 见煞 ， 行至未垣大限夫妻宫 ， 易受有 家室者追求 ； 在戌见煞 ， 
行至丑垣大限夫妻宫亦然 。 见陀罗 、 铃星者 ， 则弄至多角风波 。 备方面当事入之困 
扰 ， 难以分解 。 
辰戌宫 『 机梁 』 以 『 武贪 』 宫垣为枢纽 。 化吉或吉会而 不见桃花者 ， 尚可以平 
安无事 。 若化忌 ， 则主夫妻感情变化 。 化吉而见桃花 ， 亦主夫妻伦常有变 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天机"):
                tmp = """ 巳亥宫天机 ， 在亥宫者 ， 妻子貌寝 ； 在巳宫者则主 美容 。 此乃以太阴庙陷而作 
分别 。 
巳亥天机见 昌曲 ， 再同会桃花诸曜 ， 主配偶易为别 人追求 。 故若更见煞忌刑曜 ， 
则主夫妻中道分张 。 
巳亥天机有吉化 ， 见辅弼 、 魁钺 ， 则主配偶文秀 ， 且能创建事业 。 
巳亥天机若会天同化禄 ， 巨门化忌 ， 则自己于婚后 易移情别恋 。 女命 ， 会太阳 
化忌 ， 见煞 ， 主与配偶生离 。 
巳亥天机以 『 太阳天梁 』、 『 天同巨门 。 』 、 破军诸垣 ， 为 吉凶克应之枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """  
一般而言 ， 凡太阳在夫妻宫 ， 最不喜化忌 ， 无论男 女 ， 均主与原配生离死别 。 
凡太阳在夫妻宫见火铃 ， 初时感情深厚 ， 久后即如 水火 。 
女命夫妻宫太阳落陷 ， 化忌 ， 以三十后结婚 ， 且无 正式婚礼者为宜 。 
女命夫妻宫太阳落陷化忌 ， 行至大限夫妻宫会照太 阳 ， 流煞冲并 ， 主因夫婿伤 
心落泪 ， 或主遭人遗弃 。 
女命夜生人一般不宜夫妻宫见太阳 。 虽吉亦虚 ， 稍 带桃花 ， 夫婿即易生异心 。

"""
        print(tmp)
        print("\n")
        if(star == "太阳巨门"):
            tmp = """ 【 太阳巨门 】 见吉化 ， 而 『 福德宫 』 不吉者 ， 女命主离 乡背井 ， 嫁夫随夫 ； 男 
命主入赘 ， 或主与岳父岳母同住 ， 而父母反别炊 。 
『 太阳巨门 ] 见煞 ， 但不重 ， 主夫妇意见参商 。 煞忌 刑凑 ， 则有生离死别之虞 。 
[ 太阳巨门 ] 见辅佐诸吉 ， 女命配夫显贵 ； 男命宜妻 子有独立事业 ， 否则便多是 
非 。  """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(dizhi == "子"):
                tmp = """太阳在子 ， 主配偶性情多挑剔 ， 见火铃者尤甚 。 若 空劫同度 ， 则往往迟婚 ， 或 
虽有婚约而难以结合 。 太阳化忌而有空劫同躔 ， 则女命主早寡 ， 有吉曜同时会合 ， 
亦主生离 。 唯禄马躔于申宫 ， 太阳化禄 ， 则主姻缘在于异域 ， 仍以迟婚为宜 。 
女命夫妻宫太阳在子化忌 ， 大限命宫行至子垣 ， 往 往婚姻不利 ， 或主生离 ， 或 
受感情困扰 ， 影响深远 。 夜生人尤甚 。 
男命夫妻宫太阳在子化忌 ， 三十后即易生感情变 化 。 夜生人尤甚 ．。 
太阳在子 ， 得 [ 百官朝拱 ] ， 女命虽主丈夫富贵 ， 唯 亦有名无实 。 夜生人尤甚 。 
男命则妻子有事业 ， 不顾家室 。 
太阳 在子 ， 一般不宜行巨门 、 [ 武破 ] 二垣 。 即使吉 星汇集 ， 亦多不如意 。 
太阳在午 ， 主配偶贤明 ， 有责任感 。 见煞曜同度 ， 则日夜在外奔忙 ， 少家室之 
乐 。 倘空劫同度 ， 亦以迟婚为宜 。 太阳化忌 ， 女命不宜早婚 ， 但往往多男女应酬约 
会 。 唯天马于寅宫 ， 太阳化禄 ， 则于夫妻宫行至天同坐守之垣时亦主姻缘在异域 。 """
                print(tmp)
                print("\n")
            elif(dizhi == "午"):
                tmp = """女命夫妻宫太阳在午化忌 ， 亦不宜大限命宫行至午 垣 ， 主感情易生困扰 ， 且易为 
异性所累 。 
男命夫妻富太阳在午化忌 ， 有煞 ， 三十后岁易生感 情变化 。 
女命太阳在午 ， 会辅佐诸曜 ， 主夫婿贵显 。 男命 ， 古代主因妻得贵 ， 在现代 ， 
妇女有自己事 业 ， 亦主妻子有良好事业 。 
太阳在午一般不喜行天同 、 [ 廉杀 ] 二垣 ， 稍见煞曜 ， 婚姻即起波澜 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "太阳太阴"):
                tmp = """ 太阳在丑 ， [ 太阴太阳 ] 同度 ， 见吉 ， 主妻子志凌丈 夫 ， 夜生人尤甚 。 若见煞忌刑 
同会 ， 则因妻破家 ， 轻则主因妻破财 ， 亦夜生人尤甚 。 若在女命 ， 见吉反主夫婿情 
深 ， 夜生人更吉 。 见煞忌刑重者 ， 则主夫妇互相参商 。 
[ 太阳太阴 ] 在丑 ， 见火铃 ， 主亲家不和 。 或主夫妻 年龄学历等不相称 。 
男命夫妻宫 [ 阴阳 ] 在丑 ， 若太阴化忌 ， 则易与妻家 女眷不和 。 见煞 ， 妻多灾病 ， 
或妻破财 。 见吉 ， 或太阴化禄 ， 则主得妻家助力 。 一般主得内助 。 
女命夫妻宫 [ 阴阳 ] 在丑 ， 若太阳化忌 ， 主夫多灾病 ， 煞重 ， 则见刑克 ， 否则生 
离 。 因太阴化忌亦不吉 ， 主夫多灾病而致自身不安 。 
太阳在未 ， 亦 [ 太阴太阳 ] 同度 ， 与在丑宫大致同一 意义 。 唯在丑宫者较利男命 ；
在未宫者较利女命 。 
丑未宫 [ 阴阳 ] ， 以天同 、 天梁 、 『 天机巨门 』 宫垣 ， 为 吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "太阳巨门"):
                tmp = """ 太阳在寅 ， [ 太阳巨门 ] 同度 ， 见太阳化禄 、 化权 、 或 太阳化忌而无火铃 ， 均主 
异族通婚 。 若在申宫 ， 则化忌者不是 。 
[ 太阳巨门 ] 以不见煞为佳 ， 否则经行至 【 机录像 】、 刑忌夹的天相 、 [ 同阴 ] 各垣 ， 
均易生事端 。 申 宫又劣于寅 宫 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "太阳天梁"):
                tmp = """ 太阳在卯酉 ， [ 太阳天梁 ] 同度 ， 以卯宫优于酉宫 。 
[ 太阳天梁 ] 见 吉 ， 主夫妻年龄有差距 。 或主妻子长于丈夫 。 见天寿 ， 差距尤大 。 
[ 太阳天梁 ] 见煞忌 ， 主夫妻生离死别 ， 或主配偶因 事业关系 ， 长期在外 。 一般 
以迟婚为宜 。 
[ 太阳天梁 ] 在夫妻宫 ， 主婚前有波折 ， 或旧侣重逢 而后结合 。 见昌曲 ( 单星 ) ， 
则有两度婚姻 。 
[ 太阳天梁 ] 必须见辅佐吉曜 ， 然后始主夫妻匹配 ； 自首偕老 ， 唯婚前仍有波折 ， 
或婚后即有段一时期分别 。 
[ 阳梁 ] 在 『 夫妻宫 』 ， 以 [ 天同巨门 ] 、 贪狼 、 [ 阳梁 ] 各 垣 ， 为流年大运的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "太阳"):
                tmp = """太阳在辰 ， 最不喜巨门化忌 ， 主生离死别 。 化禄 ， 则亦可能与异族通婚 。 
太阳在戌 ， 巨门化忌者其不利性质更为严重 。 化禄 不主异族通婚 。 但女命主受 
异族追求 。 
太阳在辰戌为夫妻宫 ； 命宫行至 [ 紫破 ] 大限 ， 常主 非礼成亲 。 
太阳在辰戌 ， 见吉化吉曜 ， 女命主夫婿富贵 ， 唯在 戌宫者常主有名无实 。 
太阳在辰戌 ， 最不宜陀罗 、 火星同度 ； 或擎羊 、 铃 星同度 ， 均主不能与结发夫 
妻同偕自首 。 唯在辰宫者 ， 再婚则利 。 
太阳在辰戌 ， 以巨门 、 天机 、 [ 天同天梁 ] 各垣为吉 凶克应之枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "太阳"):
                tmp = """ 太阳在巳 ， 优于太阳在亥 。 男女命皆如此 。 唯女命 太阳在亥 ， 见辅佐诸曜华集 ， 
太阳又吉化者 ， 主夫婿经历艰辛而成大业 。 若见昌曲 、 左右 [ 单星 1 ， 则为二嫁之命 ， 
再 嫁始卜完美 。 
太阳在巳 ， 见煞化忌 ， 女命大限夫妻宫行至 [ 紫府 ] 守垣 ， 或 太阴守垣 ， 皆不主 
吉利 。 
太阳在亥 ， 见煞化忌 ， 男命不宜早婚 。 行至 『 紫府 ] 大限主无媒苟合 ， 但感情终 
成水火 。 女命 ， 则夫妻宫行于天同守垣之大限 ， 往往亦生事端 。 
太阳在巳亥二垣 ， 纵见吉 ， 亦主婚前恋爱波折 。 
太阳在巳亥 ， 见辅佐诸曜对星齐备 ， 又为 [ 百官朝 拱 ] 之局 ， 男命主因妻得贵 。命宫有火星 、 铃星 ， 亦主入赘 ， 或与岳父岳母同住 ， 而父母反别炊 。 
太阳在巳亥最嫌巨门化忌 ? 则夫妻性格 、 家世 、 学 识均不匹配 ， 且是非口舌连连 。 
配偶如为 [ 口舌生财 ] ( 如教 师 、 推销 ) ； 或 [ 是非生财 ]( 如律师 、 警察 ) 者 ， 则较吉 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """  
凡武在夫妻宫 ， 文曲化忌同度 ， 皆主无正式婚礼 。 若成 [ 铃昌陀武 ] 格局者 ， 则 
婚姻必主破裂 ， 甚至刑事克配 偶 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """ 子午宫 [ 武曲天府 ] ， 必须见禄始主婚姻谐美 。 又以 会廉贞化禄为佳 ； 若武曲化 
禄 ， 男命嫌妻子太能干 ， 夺去丈夫光芒 。 倘七 杀与禄存同度拱照 ， 则 [ 妇夺夫权 ] 的 
情形 更严重 。 男命 ， 若命富有火铃 ， 主入赘岳家 。 
子午宫 [ 武府 J ， 若武曲化忌 ， 女命主婚姻生活中断 ， 其原因 ， 或为丈夫有病 ， 
或为丈夫移情别恋 。 男命主夫妻生离 。 倘更多煞曜会合 ， 则为再婚之命 。 
子午宫 [ 武府 ] ， 若见辅佐诸曜 ， 男女皆主为有家室 者追求 。 见辅佐 [ 单星 ] ， 则 
为再婚之命 。 桃花诸曜同会 ， 则 再婚后仍受有家室的人追求 。 女命尤甚 。 
子午宫 [ 武府 ] ， 以破军 、 [ 紫相 ] 、 天同 、 [ 机巨 ] 等宫 垣 ， 为吉凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "武曲贪狼"):
                tmp = """ 丑未宫 [ 武曲贪狼 ] ， 与火铃同度 ， 主感情始热终冷 。 若桃花诸曜齐集 ， 则主婚 
前婚后皆有感情纷扰 。 
丑未宫 [ 武曲贪狼 ] ， 一般主配偶吝啬 ， 以钱财为重 ， 时思左右配偶的财权 。 禄 
存或化禄照会则不是 ， 主夫婿富足 ， 或妻子能凭自力经营 。 
丑未 [ 武贪 ] 化忌 ， 主因配偶破财 。 见科文诸曜或见 桃花 ， 则主移情别恋 。 见火 
铃空劫 ， 则主无闺房之乐 。 或主再婚 。 
[ 武贪 ] 在夫妻宫 ， 以 『 机梁 』 、 [ 同阴 ] 所在宫垣 ， 为推 断吉凶之关键 。 武曲化忌 
者 ， 女命 ， 尤以夫妻宫见 『 机梁 ]( 借入对富 ) 以定夫婿吉凶 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "武曲天相"):
                tmp = """ 寅申宫 [ 武曲天相 ] ， 须刚柔互济然后始主婚姻完 美 。 若见左辅右弼 ， 则更主夫 
妻 间有助力 。 
寅申 [ 武相 ] ， 过刚则夫妻姻缘不到头 ( 男命更主受 妻子支配左右 ) ， 过柔则可能 
受配偶之拖累 。 皆非美局 。 见 火铃夹 、 羊陀夹者 ， 其不利程度更甚 。 唯若火铃夹而 
对富有禄马 ， 则主配偶奔波劳禄 ， 或自身奔波 ， 以致会少离多 。 
寅申 [ 武相 ] ， 见桃花诸曜 ， 及辅佐 [ 单星 ] 时 ， 每主 婚后仍易与已婚的人相恋 。 
若为 [ 刑忌夹印 ] ， 更陷于感情 的泥沼不能自拔 。 若为 [ 财荫夹印 ] ， 则主其恋爱有倚 
赖对 方的性质 。 
寅申宫 [ 武相 ] ， 以 [ 太阳天梁 ] 、 [ 天同巨门 ] 及 [ 武 相 ] 本身备宫为吉凶之枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "武曲七杀"):
                tmp = """ 卯酉宫 [ 武曲 七 杀 ] ， 每宜 迟婚 ， 否则婚姻多悔吝 。 坐酉宫者尤甚 。 盖卯宫者 ， 
太阳在辰为庙旺 ， 太阴在戌宫亦为庙旺 ； 在酉宫 ， 则太阳在戌 ， 太阴在辰 ， 皆落陷
宫 ， 故酉不如卯 ( 视婚姻 ， 除 [ 夫妻宫 ] 外 ， 亦须兼视太阴太阳之 庙旺利陷 ) 。 
卯酉宫 [ 武曲 七 杀 ] ， 若武曲化忌 ， 或会廉贞化忌 ， 更见四煞空劫交集于三方四 
正 ， 主配偶遭逢意外 ， 或因配偶遭逢意外 ， 或因配偶招破败 。 出事之期 ， 每在武曲 、 
廉贞叠忌 ， 或羊陀迭并之年 。 论大限 ， 则以借星 『 廉贪 』 或天 相限内 。 
卯酉宫 [ 武曲七杀 ] ， 本宫不见煞 ， 而三方见煞 ， 则 主配偶风霜雨露 ， 在外飘流 。 
见火铃 ， 或见天马者尤确 。 倘 更见辅佐诸吉 ， 则配偶宜武职 。 见火星天厨同度 ， 或 
破军得禄见火星 ， 则配偶宜经营饮食业 。 
卯酉 [ 武杀 ] ， 亦主配偶性刚 。 凡 [ 夫妻宫 ] 见 [ 武杀 ] ， 『 福德宫 』 必为 『 紫微破 军 ] ， 
故主配偶性格刚烈 ， 往往难以 调和 。 能否调和 ， 只视 [ 廉贪 ] 一组星系 ， 必须带感情 
色彩 ， 然后可以调和 。 若偏重于物欲 ， 则难免夫妻彼此皆欲控制对方 。 在这种情形 
下 ， 命宫带桃花 ， 并不主夫妻难以白头偕老 。 
卯酉 [ 武杀 ] 最不宜火星陀罗同度 ， 主再婚 。 见昌曲 [ 单星 ] 或化忌 ， 主无正式婚 
礼成亲 。 煞重 ， 武曲化忌 ， 丈 夫有隐疾 ， 或有肺病 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "武曲"):
                tmp = """ 辰戌宫武曲独坐 ， 宜迟婚 。 火铃同度 ， 主仓卒成婚 。 见吉化吉曜 ， 则配偶精明 
能干 。 见煞忌刑曜 ， 主夫妻生离死别 ； 煞轻者 ， 主因配偶破财 。 
辰戌宫武曲 ， 会对宫贪狼火星或铃星 ， 主多热恋 ， 但亦多感情挫折 。 天姚同度 
者更甚 。 
辰宫武曲优于戌宫 ， 视太阳太阴庙陷可知 。 
辰戌武曲克害较少 。 唯大限行至破军 、 七 杀宫垣 ， 见煞忌刑凑者 ， 亦主有克害 。 
辰戌武曲 ， 以破军 、 七杀 、 天梁 、 巨门各垣为吉凶 克应之枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """ 巳亥宫 [ 武破 ] 见煞忌刑曜 ， 婚姻必不利 ， 以迟婚为 宜 ， 否则亦主再婚 ， 且系偏 
房继室 。 尤不宜火铃空劫同度 ， 往往多怨偶 。 
巳亥宫 [ 武破 ] 见吉化 、 吉曜 ， 则主配偶精明 ， 但自 身仍受配偶控制 。 
若 [ 武破 ] 与禄马同躔 ， 或与禄马拱照 ， 则主夫妻各 处一方 ， 会少离多 。 火铃或 
空劫同度者 ， 夫妻有名无实 。 
巳亥 [ 武破 ] 见吉化吉曜 ， 七 杀带禄来会 ， 男命主因 妻得财 ， 女命主夫婿富贵 。 
以巳宫较亥宫为佳 。 
巳亥 [ 武破 ] ， 以天同 、 巨门 、 天梁 、 太阳备宫垣 ， 为吉凶克应之枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同主白手兴家 ， 即去尽现成事业而后 自行兴创 。 将此层意义移入 [ 夫妻宫 ] ， 
即为两度姻缘 。 尤其是在古代 ， 婚姻必凭媒妁 ( 等于 [ 现成 ]) ， 故天同在夫妻宫者多 
主纳妾 ( 等于 [ 自创 ]) 。 在现代 ， 往往为婚前曾与人同居或热恋 ， 离 散后再成婚嫔 。 
一一必须了解此重意义 ， 然后始可作细节推断 。 
凡天同在夫妻宫 ， 皆主配年少之妻 ， 或年长之夫 ， 以年龄相差八年为准 ， 然后 
始可成结发 。 否则女命只宜偏房 。 此为趋避之道 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """子午宫 [ 天同太阴 ] ， 男命主娶美妻 ； 女命配夫亦风 度翩翩 。 见科文诸曜 ， 或桃 
花诸曜 ， 主配偶受异性垂青 。 
[ 天同太阴 ] 而太阴化忌 ， 主再婚吉利 ， 可偕自首 。 若 天同化忌 ， 则再婚亦不吉 。 
会巨门化忌 ， 多口舌 ， 易离异 。 会太阳化忌 ， 主妻子多疑 ， 或丈夫多病 。 
[ 天同太阴 ] 见禄 ， 尤其是天同化禄 、 巨门化禄 ， 主 自身常生外向之心 。 见辅佐 [ 单 
星 ] 者 ， 尤易发生婚外感情 。 
子午宫 [ 天同太阴 ] 见煞忌刑曜 ， 主生离死别 ， 或会 少离多 。 以 【 太阳巨门 】、 [ 廉 
贞破军 ] 、 [ 天机天梁 ] 三垣 ， 为 吉凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """ 丑未宫 [ 天同巨门 ] ， 见化忌 、 化禄 ， 均易发生苦恋 、 畸恋 、 或单恋 。 唯巨门化 
忌 ， 尚带门舌争吵的性质 。 
丑未 『 同巨 』 ， 见辅佐吉曜 ， 且系成对会入 ， 然后婚 姻始主稳定 。 若见 『 单 星 ] ， 
则主两度或三度姻缘 ， 曾同居 ， 或解除婚约者可免 。 利迟婚 ， 女命亦宜偏房继室 。 
丑未 [ 同巨 ] ， 于经行至 『 廉府 』 及 [ 武相 ] 会合的各宫 垣 ， 主与已婚的人恋爱 。 
视桃花诸曜 ， 或科文诸曜在何宫垣 ， 即可确定 。 
丑未 [ 同巨 ] 在 [ 夫妻宫 ] ， 命宫为 [ 阳梁昌禄 ] 格者 ， 卯宫优于酉宫 ， 然均主配偶 
独立发展事业 。 故以不同行 、 不同机构者为宜 ， 否则多口舌纷扰 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天同天梁"):
                tmp = """ 寅申宫 [ 天同天梁 ] ， 男命主离婚后得配美貌之妻 ； 女命主再嫁事业优胜之夫 。 
男宜小配 ， 女宜长配的意义更加明显 。 若非再婚 ； 见主夫妻因环境影响而离散 ， 然 
后破镜重圆 。 
寅申宫 『 同梁 』 ， 见辅佐 [ 单星 ] 者 ， 必主再婚 ； 见煞 忌刑曜 ， 则主夫妻徒具虚名 ， 
或见刑克 。 于廉贞化忌会武曲化忌的宫垣 ， 克应配偶灾难丧祸 ； 于太阳化忌会太阴 
化忌的宫垣 ， 克应配偶生离 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天同"):
                tmp = """ 卯酉天同独坐 ， 对太阴 ， 亦主配偶俊美 。 见吉化 、 吉曜 ， 可卜 婚姻和美 。 尤以 
曾同居然后正式举行婚嫔者 为然 。 若煞忌刑凑会 ， 则主两度或三度婚姻 。 女命以偏 
房继室为宜 。 
卯宫天同 ， 会亥宫禄马 ； 或酉宫天同 ， 会巳宫禄马 ， 火铃与天同同度 ， 主因客 
观环境而致夫妻分离 。 
卯酉天同 ， 见火铃 、 空劫 ， 而有解神 ( 年解 、 月解 ) 、 寡宿 、 大耗 、 天虚 等杂曜 
同度 ， 主夫妻有名无实 。 
男命夫妻宫为卯酉天同 ， 亦不宜见天姚 、 阴煞 、 劫 煞 ， 主妻子有权术 。 
卯 酉天同 ， 以巨门 、 天梁 、 破军 、 『 廉贞天相 』 为枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天同"):
                tmp = """ 辰戌宫天同独坐 ， 与巨门相对 ， 情形大致与 [ 天同 巨门 ] 相同 。 以天同 、 巨门宫 
垣 ， 及天相 、 『 廉杀 』 诸垣 ， 为 吉凶克应的枢纽 。 
辰戌宫天同见桃花诸曜 ， 或科文诸曜 ， 成 [ 反背 ] 之 格 ， 反主再婚胜于第一度婚 
姻 。 男命且主得妻财 ， 或受岳家提拔而致事业有成 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天同"):
                tmp = """ 巳亥宫天同独坐 ， 与天梁相对 ， 性质大致与 [ 天同 天梁 ] 同 。 以 [ 武曲天府 ] 、 『 太 
阴太阳 』 、 廉贞备垣 ， 为吉凶 克应的枢纽 。
巳亥天同与禄马拱照或同度 ， 均主夫妻会少离多 。 或主与配偶备居一方 。 见火 
铃尤确 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守夫妻宫 ， 绝非善星 ， 唯主生离多于死别 。 夫 妻不和而能偕老 ， 已经可算 
是良好的结果 。 若廉贞化忌 ， 又叠其他正曜化忌 ， 更见煞曜凑合 ， 往往即为生离死 
别克应之期 。 
廉贞守夫妻宫最忌贪狼 、 破军 。 此为推算之大纲 。 更见煞忌 ， 往往主三度婚姻 。 
女命以偏房继室为宜 ， 男命应不举行正式婚礼 ， 则可趋避 。 
廉贞最忌火星同宫 ， 即使见吉曜吉化 ， 亦主因客观 环境以致夫妇分居二地 。 
廉贞在夫妻 宫 ， 男命宜配年少之妻 ， 女命宜配年长 之夫 。 年龄差距由六年至十 
二年不等 ， 甚至可在十二年以上 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """ 子午 [ 廉贞天相 ] ， 与破军相对 ， 性质不佳 。 即使有 吉化 、 吉曜 ， 亦主夫妻备怀 
己见 ， 为己谋而不为配偶谋 ， 以致彼此参商 。 
子午 [ 廉相 ] ， 擎羊同度或对拱 ， 又见火铃或空劫 ， 则主配偶有灾病 。 以七杀 ， [ 紫 
府 ] 、 破军 、 贪狼诸宫垣为克 应之期 。 
子午 [ 廉相 ] ， 不宜见辅诸曜 [ 单星 ] ， 亦为再婚之兆 。 克勤克俭应之期 ， 往往在 
昌曲化忌之年限运限 。 
子午 [ 廉相 ] ， 夫妻年龄差距在十二年以上者较佳 ， 
则宜见昌曲 ， 主和美偕老 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未 『 廉贞 七 杀 』 ， 只有当化禄 、 权 、 科齐全 ， 且见 辅佐对星的情况下 ， 始主可 
偕白首 ， 但人生仍有一段时间夫妇分离 。 
若 『 廉杀 』 见辅佐 『 单星 』 ， 亦主再婚 。 见擎羊 、 陀罗 同度 ， 则主刑克 。 再婚克 
应之期 ， 视天同 、 巨门 、『 武曲破军 』 诸宫垣 ； 刑克之克应 ， 则以 [ 廉杀 ] 叠冲化忌 ， 
在夫妻宫 或田宅宫 、 或福德宫之期为准 。 
丑未 [ 廉贞七杀 ] ， 擎羊同度 ， 或对拱 ， 更见天刑 ， 而不见辅佐 [ 单星 ] ， 不主克 ， 
不主离 ， 仅主配偶受异性垂 青 。 从事以接触异性为主的行业 ， 即可适应 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "廉贞"):
                tmp = """寅申宫廉贞 ， 会对宫 『 火贪 』 、 『 铃贪 ] ， 主热恋 ， 但 感情易中断 。 若廉贞与昌曲 
同会 ， 则夫妻能守礼 ， 不致逾越 。 
寅申宫廉贞与火铃同度 ， 主仓卒成婚 。 若再见天姚 ， 则主先同居而后结婚 。 
寅申宫廉贞会刑忌夹的天相 ， 女命主为偏房 。 
寅申廉贞煞忌重重 ， 主再婚或三度婚姻 。 
寅申廉贞 ， 每主与有家室者变爱 ： 以会 [ 武曲天府 ] 宫垣 ， 且见桃花 、 昌见桃花 、 
昌曲者 ， 为克应之期 。 
寅申廉贞 ， 以破军 、 贪狼 、 巳宫的天梁 、 巳宫的天 同为吉凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉宫 『 廉贞破军 』 同度 ， 破折的性质相当严重 ， 纵 有吉化及吉曜 ， 亦主夫妻 
不和 。 
卯酉宫 『 廉贞破军 』， 更见火铃同度 ， 为祸最烈 ， 主 配偶意外 ， 或主因配偶而有
倾家 。 于推断大限夫妻宫时应详其发生之期 ， 以及事件的性质 。 ( 如大限夫妻宫见 『 武 
贪 』 而武曲化忌 ， 可能为倾家 ； 见天同化忌 ， 可能为遭逢意外 。 ) 
卯酉 [ 廉破 ] ， 见辅佐 『 单星 ] 主再婚 。 见昌曲对星 ， 又见桃花诸曜 ， 则主移情别 
恋 。 唯再婚亦未见吉利 。 女命又主再婚无名份 。 
卯酉 [ 廉破 ] ， 以 『 武曲贪狼 』、 [ 天同太阴 ] 、 『 天机天 梁 』 、 天相各垣 ， 为吉凶克 
应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌宫 [ 廉贞夭府 ] ， 结构较为稳定 ， 多主不和 ， 不 主克离 。 
辰 戌 『 廉贞天府 』， 亦主易受有家 室者追求 ， 尤其当 所会的 『 武曲天相 』 为天同 
化忌 ， 或巨门化忌相夹时 ， 更易 发生事端 。 若 『 廉府 』 会辅佐 [ 单星 ] ， 则常因此夫 
妻离异 。 
辰戌 [ 廉府 ] 而廉贞化忌 ， 或会武曲化忌 ， 更见煞刑 空劫诸曜 ， 亦主夫妻离异 。 
唯男命主离婚后再娶貌美能干之妻 ， 而与前妻藕断丝连 。 
辰戌 『 廉府 』 ， 以本宫及 『 太阳天梁 』 、 『 武曲天相 』 、 [ 天同巨门 ] 各垣为枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥 【 廉贪 】， 会 [ 紫破 ] 、 [ 武杀 ] ， 性质非良 。 见吉 化吉曜 ， 亦主不美 。 见煞刑 
空劫诸曜 ， 已主夫妻离异 ， 或因桃色事件而经官动府 。 倘更逢化忌 ， 则主刑克 。 
巳亥 [ 廉贪 ] 与火铃同度 ， 主夫妻有名无实 ， 或表面 和好 ， 而内心则各有隐衷 。 
巳亥 『 廉贪 』 见辅佐 『 单星 』 ， 男女皆主两度姻缘 ， 第 二度优于前度 。 
巳亥 『 廉贪 ] ， 借星安宫者 ， 性质比原宫的 [ 廉贪 ] 更 劣 ， 并不主再婚优于第一度 
婚姻 。 
巳亥 [ 廉贪 ] 见禄马 、 火铃 ， 亦主配偶因客观环境栖 迁异地 。 
巳亥 [ 廉贪 ] 与桃花同躔 ， 主配偶有艺术才能 。 唯婚 姻亦易起裂痕 。 
巳亥 [ 廉贪 ] ， 以 『 紫微破军 』 、 [ 武曲 七 杀 ] 、 [ 天同天 梁 ] 、 巨门备垣 ， 为运限年 
限之枢纽 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府躔夫妻宫 ， 称为善曜 ， 邓使会星曜恶 ， 一般 亦 仅主生离 ， 不生死别 。 倘星 
曜吉凶交集 ， 即使生离亦不决绝 ， 仍带藕断丝连 。 
天府未必要见煞忌刑曜始为不良 。 凡府库空露者 ， 均主婚姻不良 ， 男命主宠妾 
灭妻 ； 女命主作偏房继室 。 故男命宜配年少之妻 ， 女命宜配年长之夫 ， 即可趋避 ， 
或易彼此适应 。 
由于天府有调和夫妻关系的性质 ， 所以凡夫妻宫会 天府者 ， 一般皆有减少其凶 
危 ， 啬其吉利的意味 。 唯府库 『 空露 』 则啬其不利程度 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未天府独坐 ， 见辅佐 [ 单星 J ， 主自身常有外遇 。 见煞 ， 则主会少离多 ； 若对 
宫廉贞化忌 ， 则主停妻再娶 。 府库空露 ， 则主因配偶破耗 。 唯空露而见桃花 ， 却 主 
自身因色而致破败 。 
丑未天府 ， 因借会 『 紫贪 ] 而致叠见红鸾天喜 、 咸池 大耗者 ， 亦主有外宠 ( 古代 
则为纳妾 ) 。 
丑未天府 ， 以 『 武破 』 、 天同 、 巨门 、 太阳 、 天梁备 垣 ， 为吉凶克应之期 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """ 卯酉宫天府独坐 ， 只需府库不空露 ， 所会的天相不 为刑忌所夹 ， 不会廉贞化忌 
或贪狼化忌 ， 婚姻即完美 。 否则男命主有外遇 ， 或因配偶破财 ； 女命则主为偏房继 
室 。 
因对宫 『 武杀 』 落陷的关系 ， 酉宫天府不如卯宫 ， 稍 见煞曜即主两度姻缘 。 若 
煞刑诸曜同度尤确 。 
卯酉宫天府会吉 ， 见吉化 ， 男女皆主美配 ， 感情既 佳 ， 又能互相扶助 。 
卯酉宫天府 ， 若躔桃花诸曜 ， 亦主与已婚的人恋爱 。 见辅佐 [ 单星 ] 尤确 。 
卯酉宫天府 ， 以 [ 紫破 ] 、 [ 廉贪 ] 、 天相备垣 ， 为吉 凶克应的枢纽 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥宫天府 ， 性质较卯西尤佳 。 由于对宫为 [ 紫杀 ] ， 主配偶精明贤能 。 
巳亥天府见煞忌刑曜 ， 亦主宠妾灭妻 。 唯与原配仍藕断丝连 。 女命宜偏房继室 。 
巳亥宫天府会财荫夹的天相 ， 主夫妻助力 ， 刑忌夹 者 ， 则配偶体弱 ， 因病破财 。 
巳亥天府与陀罗同度 ， 府库空露 ， 亦主自寻烦恼 ， 或主配偶有病 。 
巳亥天府见吉化吉电信局 ， 夫妻佳且和美 。 
巳亥天府 ， 以 [ 太阳巨门 ] 、 『 天同太阴 ] 、 天相备宫 垣 ， 为吉凶克应的运限年限 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守夫妻宫 ， 文昌文曲同度相会 ， 主夫凭妻贵 。 亦主妻子貌美贤慧 。 古人说 ： 
『 太阴同昌曲于妻宫 ， 蟾宫折桂之荣 』 ， 现代已未必克应 。 有禄同度者 ， 主因妻得财 。 
太阴守夫妻宫 ， 见煞忌 ， 女命日生人 ， 而太阴又化 忌星者 ， 始主夫婿灾病 。 男 
命则主与妻子不同心 ， 或为妻室所累 。 
太阴昌曲更见桃花 ， 主配偶易受异性垂青 ， 以经营多 接触异性的行业为宜 。 
太阴与火铃 、 空劫同度 ， 亦主夫妻生离 。 
男命夫妻宫太阴 ， 会天同 ； 或与煞 曜同度 ， 均主貌 美 。 与昌曲同度相会 ， 则美 
而带薄 。 太阴落陷 ， 夜生人主妻美 。 
太阴守夫妻宫 ， 见吉化则吉 。 见化忌 ， 女命主丈夫 多疑 ， 男命主妻多病 。 日生 
人尤甚 。 
太阴守夫妻宫 ， 不宜见火铃 ， 主生离 ； 见羊陀 、 空 劫 、 刑耗则主配偶灾难 、 病 
患 ； 其甚者 ， 主无闺房之乐 。 觅化忌者程度更深 。 若于大限流年逢太阳化忌 ， 冲起 
太阴化忌 ， 则程度最重 。 唯仍需用视有无刑煞交并而定 。 太阴化忌原不主克 ， 但若 
刑煞交并 ， 阴阳均化为忌星 ， 福德宫又 不吉者 ， 则可见删宛 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "亥"):
            tmp = """ 巳亥太阴与天机相对 ， 巳宫不如亥宫远甚 。 在巳宫 者 ， 常主配偶不顾家庭 ， 但 
却乐于帮助别人 。 
太阴化忌 ， 见煞 ， 又见桃花 ， 则主配偶因帮助 别人而致引狼入室 ， 或因此 
而招财帛耗损 。 亥宫太阴一般主配偶富裕 。 唯女命于丈夫发迹谢 后 ， 丈夫常 招感情困扰 ， 但不 
言离 。 
亥宫太阴化忌 ， 反主配偶能协助自己事业 ， 而配偶 自身亦有事业 。 亦主于 [ 武曲 
天相 ] 或破军坐守宫垣之时 ， 夫妻合作创业 。巳亥太阴 、 以 [ 天同巨门 ] 、 『 太阳天梁 ] 两宫垣为运 限之枢纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "酉"):
            tmp = """酉宫太阴会天同化忌 ， 见桃花及阴煞 ， 孤辰寡 宿 ， 又躔辅佐单星 ， 女命亦主有 
同性恋倾向 。 以大限命宫行至太阴宫垣 ， 为克应之期 。卯酉太阴 ， 以 『 廉相 』 、 破军 、 巨门诸垣为吉凶之枢 纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯"):
            tmp = """ 卯宫太阴对天同 ， 不如西宫 。 酉宫音主配偶事业较佳 ， 见辅佐占曜及吉化 ， 亦 
可 以兴创事业 。 卯宫者 ， 一般仅宜服务他人 。 
卯宫太阴与酉宫比较 ， 较易生离 ， 或会少离多 。 以 太阳 、 天梁两垣为克应之期 。  
卯酉太阴 ， 以 『 廉相 』 、 破军 、 巨门诸垣为吉凶之枢 纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌太阴与太阳相对 ， 一般情况下均主白发齐眉 ， 唯戌宫优于辰宫 。 
辰宫太阴 ， 化禄 、 权 、 科 ， 女命主夫婿中年发足迹 。 男命亦喜得内助 。 
助力 而事业创兴 。 
辰戌太阴见煞忌刑空耗诸曜 ， 亦主夫妻生离 ， 或一 生多挫败 。 尤以辰宫为甚 。 
辰戌太阴见太阳化忌 ， 女命不宜早婚 。 否则于大限 命宫珩至太阴宫垣 ， 主易结 
成怨偶 ， 以致离异 。 
辰戌太阴 ， 以 『 天同犬梁 』 、 巨 l 门 、 太 阳 、 太 阴 各宫 垣 ， 为吉凶克应之期 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" ):
            tmp = """巳亥太阴与天机相对 ， 巳宫不如亥宫远甚 。 在巳宫 者 ， 常主配偶不顾家庭 ， 但 
却乐于帮助别人 。 
太阴化忌 ， 见煞 ， 又见桃花 ， 则主配偶因帮助 别人而致引狼入室 ， 或因此 
而招财帛耗损 。 
 
巳宫太阴不宜躔昌曲 ， 主配偶有外遇 。 亥宫则无妨 。 
巳亥宫太阴 ， 男命皆宜配年少之妻 ， 以六年以上为 度 ； 女命主配年长之夫 ， 亦 
以六年以上为度 ， 则夫妻自首 。 
巳亥太阴 、 以 [ 天同巨门 ] 、 『 太阳天梁 ] 两宫垣为运 限之枢纽 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守夫妻宫 ， 见煞 ， 一般主刑克 ， 或离婚 ， 或配 偶死亡 。 必须迟婚 ， 且婚前 
曾经波折 ， 然后可免 。 
『 火贪 』 、 『 铃贪 』 守夫妻 宫 ， 主初时热恋 ， 婚后不久即 同冰炭 。 
贪狼与擎羊 、 火星同度或一陀罗 ， 铃星同度 ， 主 配偶有灾病死亡等事 。 以更见 
虚耗刑劫为确 ， 且以之嫠定其严重程度 。 
贪狼化忌于夫妻宫 ， 主为人夺爱 ， 所以婚前多波折 ， 则婚后反佳 ； 若恋爱婚姻 
顺利 ， 则婚后反易滋生事端 。 
贪狼躔桃花诸曜 ， 更见辅佐 『 单星 』 ， 主桃色纠纷 、 多角恋爱 。 与廉贞对拱音更 
甚 。 若见空曜 ， 天刑 ， 则程度反而减轻 ， 主能克制 。 
贪狼守夫妻宫 ， 古代以为男命优于女命 ， 因为男命 若纳妾 ， 即可避免其缺憾 ； 
而女命则非作偏房不可 ， 或配年长之夫 ， 作继室 ， 而且以迟婚为 宜 。 在现代 ， 上述 
观点应略作修正 。 现代无纳妾 ， 故主有外遇 ， 唯外遇是否专一 
应视夫妻宫有无煞忌桃花而定 ， 否则仍不主古 ； 现代妇女开放 ， 故往往主离而再嫁 。 
贪狼与昌曲化忌同寓 ， 主婚姻无一正式婚礼 ， 或婚礼 有阻滞 。 
女命贪狼在夫妻宫 ， 见铃星同度 ， 又见辅佐诸曜 ， 及桃花诸曜 ， 主自身作人外 
遇 。 
女命贪狼守夫妻宫 ， 除 『 紫微贪狼 』 在卯酉宫及辰戌 宫独坐之外 ， 均易为何妇 
之夫追求 。 是否因此引 起婚姻波 折 ， 须视所踺星暇而定 。 本质情欲霞者 ， 必起风波 。
夫妻寓星 性质变化甚大 ， 应参考 『 六十星系 』 所述加 以推断 。 
子午 宫贪狼 ， 与紫微相对 ， 最喜天刑 、 空曜同度 ， 否则婚姻必有波澜 。 见辅佐 
『 单星 』 ， 主第三者侵入 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子宫贪狼成 『 泛水桃花 』 格局者 ， 变爱固多姿多彩 ， 婚后亦多纷扰 。 男命以配 
年长之妻为宜 ， 女命则必须年龄登对 ， 然后始可避免不良 1 生质 。 无论男女 ， 若离 
婚 ， 再婚 更不利 。 
午宫贪狼 ， 见桃花诸曜 ， 亦主易与有家室者恋爱 。 在现代 ， 往往因此耽误婚姻 。 
子午贪狼与火铃同度 ， 更见阴煞 、 天虚 、 孤辰 、 寡 宿 、 年解 、 月解 、 破碎者 ， 
主受配偶遗弃 ， 或自身有灾病 ， 致婚姻中断 。 
子 午贪狼 ， 以 『 廉府 』 、 『 武相 』 、 『 同巨 』 、 『 阳梁 』 备垣 ， 为吉凶克应的枢纽 。  """
            print(tmp)
            print("\n")
       
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """ 寅申寓贪狼 ， 最易为有家室的人追求 ， 尤其是当福 德宫七 杀躔桃花诸曜时 ， 此 
推断为准确 。 
寅申贪狼 ， 最嫌对宫廉贞化忌 ， 更见煞曜虚耗 ， 主离而再婚 ， 婚后仍不美满 。 
箬更桃仡渚曜 ， 则情况更加复杂 ， 往往发展为多角恋爱 。 
寅申贪狼与火铃同度 ， 而对宫廉贞化忌 ， 更见空劫刑耗诸曜 ， 主配偶有灾病意 
外 。 
寅申贪狼守夫妻宫 ， 而命宫有煞忌刑耗诸曜 ， 贪狼 又见煞及辅佐 『 单星 』 ， 则主 
自身有病患 。 
寅申贪狼 ， 以 『 武府 』 。 『 紫相 』 、 廉贞诸垣 ， 为克应 之期 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌贪狼为天罗地网 ， 桃 花的意味减轻 ， 故性质较 佳 。 若见吉化 、 吉曜 ， 则夫 
妻和美 。 即使见煞曜 ， 若非甚重 ， 仅主婚前恋爱多波折 。 
辰戌贪狼辅佐 『 单星 』 及 桃花 ， 男命主婚后仍有外遇 ， 但不主离婚 。 若不见辅 
佐 『 单星 』 者 ， 则仅主婚后先生 女 。 
辰戌贪狼化忌 ， 虽主为人夺爱 ， 但仅应于婚前 。 
辰戌 [ 火贪 ] 、 『 铃贪 』 ， 夫妻爱情较为久永 。 见吉曜 ， 则卜白头偕老 。 
辰戌贪狼 ， 亦主迟婚 。 若见煞曜重 ， 且刑 忌并见 ， 甚至主终身无婚约 。 
辰成贪狼 ， 以 『 紫府 』 、 巨门 、 武曲等垣为吉凶克应 的枢纽 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守夫妻宫 ， 命宫 必为天梁 。 天梁坐命的人多招灾 难 ， 故往往于夫妻亦何刑 
克口舌 。 因此当推断巨门守夫妻宫吉凶之时 ， 须兼视命富天梁的性质 。 大致而言 ， 
福泽较厚的天梁 ， 婚姻亦易和美 ； 是非尤怨较多的天梁 ， 夫妇亦 
易参商 。 
古 人论斗数 ， 不喜巨门入夫妻宫 。 他们的说法是 ： 『 在夫妻主于隔角 ， 生离死别 。 
纵夫妻有对 ， 不免污名失节 。 』 这是认为当男命夫妻宫躔巨门之时 ， 或生离 、 或死别 、 
或妻子因客观环境影响 ( 如战祸 ) 以致失节 ， 这即是考虑 
及命宫天梁 。 以及夫妻宫巨门二电信局皆 不吉之故 。 其实 不可一概而论 。 必须天梁 
带孤克之性 ， 而巨门又与煞忌刑曜同会 ， 且见桃 花及辅佐 『 单星 』 ， 然后始可认定古
人的说法 。 
天梁需用太阳解其孤克 ， 巨门需太阳解其刑忌之性 ， 所以当巨门守夫妻宫时 ， 
必须太旧庙旺 ， 且躔吉曜 ， 然后天粱 、 巨门的性 ： 质才能同时改善 ， 这是推断的重 
点 。 
巨门最不喜与陀罗同躔 ， 主夫妻自找麻烦 ， 往往小事化为大事 。 亦不喜铃星 ． 主 
夫妻关系有彼此前列的性质 。 
巨门躔擎羊 、 天刑 ； 火星 、 擎羊 ， 皆主生离 。 更见 化忌 ， 而大限夫妻宫又何化 
忌叠冲 ， 然后始主死别 。 
巨门有 『 交人始善终恶 』 的本质 ， 夫妻关系亦往往如 此 。 凡巨门守夫妻宫 ， 如 在 
第二个大限的夫妻宫见贪狼 ( 或 贪狼 守垣 ， 或与贪狼相对 ) ， 倘贪狼与桃花诸曜同躔 ， 
则无 论男女均主早恋 。 但在此期间内的恋爱 ， 亦必终归失败 。 
巨门与庙旺的太阳相会 ， 见吉化 ， 如巨门化禄 、 太 是化权 ； 或太阳太禄 ； 或巨 
门化权 ， 往往主与异族成婚 。 或嫁往外国 。 如巨门太阳无吉化 ， 见魁钺亦是 。 
巨门如无吉化曜相照 ， 则主奔波 。 故往往夫妻会少 离多 。 若火铃 、 空劫同度 ， 
或对宫曜 ， 则主配偶逃亡 。 
巨门入庙 ， 见吉化吉曜 ， 所会太阳又庙旺 ， 则夫妻 和美白头 ， 能互为助力 。 然 
若太阳落陷 ， 则虽吉化 ， 亦主半路分张 。 
巨门会居于闲陷宫位的太阳 ， 婚前易与已婚者恋 爱 。 尤以 『 天同巨门 』 的组合 
为确 。 
巨门守夫妻宫 ， 女命以配年长之夫为宜 ， 男命亦宜与 比自己大一两年之妻 。 则 
夫妻易于彼此迁就 。 此为趋避之道 。 
巨门守夫妻宫 ， 虽吉 ， 亦多无谓争吵 。 若巨门与忌 星同躔 ( 如昌曲化忌 ) ， 则主 
无完整婚礼 ， 而彼此性格又不 相投 。 [ 天同巨门 ] 的组合遇此 ， 更主家世 、 学义 、 相 
貌皆不 匹配 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子 午巨门 ， 若 左 辅 、 右弼一入命宫 ， 一入夫妻寓 ， 主生离 ， 会吉曜吉化 ， 仍主 
分居异地 。 昌曲分入二宫 ， 其中有一化忌者 ， 亦然 。 
子午巨门见吉化吉曜 ， 如化禄 、 权 、 科 、 禄存 、 魁 钺 、 辅弼者 ， 男主配聪慧貌 
美 之妻 ， 女主配事业良好之夫 。 
子午巨门 ， 以 『 武杀 』 、 『 紫破 』 、 太阳宫垣 ， 为吉凶 克应的枢纽 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌巨门 ， 见昌曲 、 辅弼皆不佳 。 会禄权科而少煞 曜者 ， 主配偶可以任劳任怨 。 
辰戌巨门为陷地 ， 见煞忌 ， 主夫妻分离 ， 或主重大 口舌 ， 而夫妻又不登对 。 又 
主与配偶的兄弟姊妹不和 。 
辰成巨门 ， 以太阳 、 天梁 、。 天同诸垣为吉凶克应的 枢纽 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 
巳亥巨门 ， 女命主与夫家亲眷不和 ； 男命主与岳家 亲眷不和 。 巳宫者尤甚 。 
亥宫巨门见煞忌 ， 夫妻必多事端 ， 性质较巳宫者为 严重 。 
巳亥巨门 ， 以太阳 、 天同 、 武 曲 、 天梁诸垣为运限 年限的吉凶克应枢纽 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相坐夫妻宫 ， 古人有 『 亲上加亲 』 的说法 。 在现代 ， 则为由同学 、 同事 、 街 
坊关系变成夫妇 。 又或为旧相识 ， 未有感情 ， 经一段时期疏远 ， 重逢后再发生感情 。 
天相坐夫妻宫 ， 又为 『 夫唱妇随 』 ， 宜夫妻合作共事 。 
天相坐夫妻宫 ， 为 『 财荫夹印 』 者 ， 男主得妻家之力 ， 或妻子可以协助自己创业 
兴家 ； 为 【 刑忌夹印 】 者 ， 主因妻破败 。 女命则以此视丈夫 。 
天相坐夫妻宫 ， 刑忌夹 ， 又见空曜 ， 且躔陀罗 ， 婚姻机会甚微 。 
天相坐夫妻宫 ． 女命须视太阳 ， 男命须视太阴 ， 必 须庙旺 ， 见吉 ， 然后婚姻始美 
满 ； 叵落陷 、 化忌 、 见煞 ， 则婚姻不如意 ， 或主感情破裂 。 女命以偏房继室为宜 。 
． 天相坐夫妻宫与其他星曜坐夫妻宫不同 ， 其他星曜 ， 见辅佐 『 对星 』， 便不主有 
两度婚姻 ( 再见煞忌刑曜者 则 为例外 ) ， 而天相 『 对星 』 或为 『 对星 』 所夹 ， 再会另 
一 『 对星 』 ， 则反为两次婚姻的徵验 。 
女命天相坐夫妻宫 ， 最喜廉贞化禄同度 ， 或会禄存 ， 然后始为 『 财印交叠 』 ， 古 
代认为旺夫益 子 。 在现代 ， 此类 夫妻宫的女命 ， 最宜与丈夫合怍事业 ， 或主理丈夫 
的事业 。 
古 人论女命 ， 日 『 天相右弼福来临 』 ， 又说 ， 『 昌曲冲 破 ， 侍妾 』 。 这都是 说命宫 ， 
但在夫妻宫时 ， 每亦有同样的 徵验 。 唯 『 天相右弼 』 ， 仍有偏房的性质 。 
天相在夫妻宫 ， 最忌火铃同度 ， 丰孤独 。 或为夫妻 情缘不投 ， 或主离异 。 
男命夫妻宫天相 ， 若廉贞化禄 同 度 ， 或见 禄 存 ， 主得妻财 ， 但现代却往往主得 
妻子匡扶事业 ， 甚至主理自己的事业 。 
天相在夫妻宫 ， 若得化禄 、 化权 、 化科会照 。 则配 偶宜从政 ， 或宜在企业任职 ， 
但不宜从商 。 从简删需夫妻合作 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未天相 ， 最嫌火铃羊陀同度 ， 火铃尤劣 。 每主干大限夫妻宫见巨门或 『 同梁 』 
守垣时 ， 恋爱屡遭挫折 ． 
丑未天相坐夫妻宫 ， 对宫 『 紫微破军 』 为左右夹 ， 则主第二度婚姻优于第一度 ， 
能得配偶帮助 。 除非曾与人有婚姻解约 、 同居分居 、 或婚姻曾经挫折 ， 否则每主二 
度姻 缘 。 
丑未天相 ， 以天机 、 巨门 、 太阳 、 [ 同梁 l 诸宫垣 ， 为 运限年限吉凶克应的枢纽 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉天相 ， 不但不喜廉贞 ，、 贪狼化忌 ， 且最嫌武曲 化忌 ， 主配偶穷困或灾病 ， 
视所会天府有禄无禄 ， 及煞曜会合情形而定 。 
卯酉天相 ， 若见煞忌 ， 往往主夫妻中道分离 。 
卯酉天相为 『 太阳巨门 』 及 [ 天机天梁 ] 所夹 ， 情形较 其他宫垣为复杂 ， 亦不喜 
见夹宫的星化忌 ， 即使是天机化忌 ， 亦每项主夫妻意见不合 ， 各怀异心 。 更有煞刑 
诸曜与天 相同度 ， 则主分离 。 
卯酉天相以 [ 太阳巨门 ] 、 『 天机天梁 』、 [ 天同太阴 ] 诸 垣 ， 为吉凶克应之枢纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥天相在夫妻宫 ， 以对宫武曲有无吉化为推断关键 。 若武曲化忌 ， 则主配 
偶有意外或有灾病 。 轻则意见不合 ， 中道分离 。 若化权化禄 ， 则宜 『 夫唱妇随 』 。 
巳亥天相若会 『 紫微贪狼 』 多桃花 ， 女命反主宜作偏 房继室 ， 否则夫婿易移情 
别恋 。 男命则主婚前多恋爱 ， 饱历沧桑而后得佳妇 。 
巳亥天相 ， 以 [ 廉贞七杀 ] 、 天梁 、 巨门各垣 ， 为吉 凶克应之枢纽 。 
凡天相在夫妻宫 ， 均宜兼视所会的天府 ， 吉则吉 ， 凶则凶 。 府 库无禄 ， 则不宜夫 
妻合作创业 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁在夫妻宫 ， 每每主婚姻带有 『 灾难 』 的性质 。 指 『 灾难 』 的程度 ， 视实际 
的星曜会合性质而定 。 
一般来说 ， 天梁在夫妻宫 ， 多主初恋失败 ； 更见煞 ， 则终身对此未能忘情 ， 以 
致痛苦 ； 若见辅佐 『 单星 』 ， 则主 恋爱时有第三者介入 。 无煞而见吉 ， 则主 热恋时受 
到挫 折 、 阻力 ， 或因客观环境而致中道分张 ， 唯以后尚有复合的机会 。 叵所会合的 
星曜吉凶交集 ， 则可能有解除婚约 、 婚姻受到压力 、 婚礼被逼延期 、 男女情投意合 
而碍于 客观环 境不能结合 、 或在结婚前一方突然要往外地 ， 种种情形 ， 亦可视为 『 灾 
难 』 。 
由于婚姻曾经波折 。 所以天梁坐夫妻宫的 人 ， 往往婚后情缘更高笃 。 
天梁与天马同躔 ， 主夫妻因环境所逼而致分散 。 行 至夫妻宫入吉限 ， 则破镜重圆 。 
叵除天马外更躔煞忌刑耗诸曜 ， 则为夫妻中道决裂之兆 。 
女命天梁天马 ， 见昌曲 ， 主夫婿风流 ? 虽有家庭责 任心 ， 但却多出外应酬 ， 以致 
夫妻形同会少离多 。 若见煞 ， 尤其是火铃 ， 则主夫妻同床异梦 。 
天梁最忌羊陀 ， 主谗言是非 ， 以致夫妻受压力 。 
天梁与铃星同躔 ， 于夫妻宫行至武曲化忌的火运 ， 常主婚姻生活中断 。 究竟因 
何致此 ， 须视实际星曜组而定 。 
夫妻宫住西 ，【 太阳天梁 】 同度 ， 夫妻最易分离 。 
天梁须藉太阳解其孤克 ， 故天梁在夫妻宫时 ， 须兼视太阳是否在庙旺之宫 ， 庙旺 
则吉 ， 陷地则 凶 。 
天梁在夫妻宫 ， 主夫妻年龄有差距 。 男命 ， 宜妻长 三年 ， 或比自己年少八岁以 
上 。 女命 ， 宜夫长八年以上 ， 或比自己少二三年 。 见天寿同度 ， 差距更大 ， 有时甚 
至可以相差十六年以上 。 
天梁在夫妻宫 ， 若婚前未经挫折 ， 则婚后必主有 一段时期夫妻会少离多 。 若陀 
罗同度 ， 则主平地风波 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午天梁 ， 以子宫为佳 。 午宫者 ， 主配偶多挑剔 。 
子午天梁而对宫太阳化忌 ， 主受配偶拖累 。 铃星同 度者 ， 拖累的程度更大 。 若 
离婚 ， 则在子宫者 ， 常主仍藕断丝连 。 
子午天梁会太阴化忌 ， 则主配偶贫困 ， 或贫苦出身 。 见太阴化禄 ， 辅佐吉曜齐集 ，， 
则配偶出身富裕 ， 或则事业光昌 。 尤宜专业人才 。 
子午天梁 ， 以巨门 、 天同 、 『 机月 』 诸垣为吉凶的枢 纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未天梁以丑宫为佳 。 在未宫 ， 则所会的阴阳皆落 陷 ， 婚姻必有挫折是非 。 若 
更化忌 ， 则配偶多灾病 ， 自身亦受拖累 。 见煞则 主离异 。 则辅弼 『 单星 』 则主第三者介入 。 
丑宫天梁见阴阳在旺宫交集 ， 主婚姻和美 ， 纵见煞 忌 ， 程度亦不如在未宫之甚 ； 
若见吉曜交集 ， 则更主配偶事业光昌 ， 唯仍 难免因工作关系会少离多 。 
丑未天梁 ， 以武曲 、 天同 ． 巨门诸宫垣为吉凶克应 之枢纽 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥天梁主男得美妻 ， 但见禄马 、 煞忌皆主易离散 。 对宫天同化忌者尤美 ， 亦 
更易离散 。 
巳亥天梁 ， 对宫天同化忌 ， 更呢煞曜会照 ， 尤其是 火铃同度 ， 则主离后再克 ， 
克后再离 。 
巳亥天梁 ， 对宫天同化禄 ， 又有吉会 ， 则主夫妻 白 手兴家 。 
巳亥天梁 ， 巳不如亥 。 在巳宫者 ， 主配偶多眺剔 婚姻多风波 。 唯始终有责任心 。 
巳亥天梁以 【 天机巨门 】 一太阴太阳 ] 、 [ 武曲天府 ] 诸 垣为六运流年吉凶克应的 
枢纽 。 
"""
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀临夫妻宫 ， 若会照吉化 ， 且见辅佐诸曜 ， 则宜 配偶各有独立事业 。 若共事 ， 
男命主妻夺夫权 。 
七 杀临夫妻宫 ， 一般以迟婚为宜 。 见火铃照会 ， 或 羊陀照会者 ， 则不但早婚不 
利 ， 而且早年恋爱亦多波折 ， 终于草率成婚 ， 而夫妻感情多隔膜 。 
七 杀夫妻宫见禄马 ， 更见吉化吉曜 ， 主配偶发财于 远地 ； 但见禄马而又见煞忌 ， 
则主夫妻中道分张 。 
七 杀会贪狼化忌 ， 又见火铃 、 空劫 ， 主为人夺爱 。 
七 杀阴煞同度 ， 更会煞曜 ， 主配偶多病 ， 且属神经 性疾病 。 
七杀在夫妻宫 ， 擎羊同度 ， 见天刑 、 天月 、 病符 、 天虚 ， 又见 廉贞化忌 ， 主配 
偶多灾病 。 若又同时见吉曜 ， 则主夫妻有名无实 。 
七 杀会 破军化禄 ， 又见辅佐 『 单星 』 ， 主两度婚姻 。 
七 杀对宫必为天府 ， 若府库空露者 ， 则主婚后贫困 ， 如自身命宫好 ， 则主配偶 
出身贫困 ， 门户不相当 。 锘更见煞忌 ， 则主受配偶拖累以致财帛损失 、 事业倾败 。 
『 廉贞七杀 』 、 『 武曲七杀 』 ， 对夫妻宫来说 ， 皆非良好 的星曜配合 。 若廉贞化忌 ， 
或武曲化忌 ， 更见煞刑虚耗诸曜 ， 及天月 、 天刑 、 空劫 ， 则主配偶有意外或死亡之 
忧 。 
七 杀守夫妻宫 ， 见空劫同度 ， 或空劫夹 ， 主夫妻感 情始热终冷 。 
七 杀为火铃夹 ， 主夫妻 同床异梦 。 更见桃花诸曜 ， 则主为配偶抛弃 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫 七 杀有辅佐诸曜同度 ， 而对宫 【 武曲天府 】 亦 有辅佐诸曜同度 ， 则主与 
已婚的人恋爱 。 
子午宫 七 杀 ， 会武曲化忌 ， 更见煞曜者 ， 主配偶灾 病或贫困 ； 更见吉曜者 ， 主 
苦恋 。 或婚后仍有刻骨铭心的感情困扰 。 
子午宫 七 杀见吉化 ， 主配偶有管理才能 。 所以男命 亦主妇夺夫权 ， 宜夫妇各自发 
展 。 若见武曲化禄 ， 则配偶尤其擅长处理财政 ， 然而男命又主为妻子掌握财权 。 
子午 七 杀以 [ 紫微天相 ] 、 [ 天机巨门 ] 、 天同各垣 ， 为吉凶克应的枢纽 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫 七 杀 ， 亦主 妇夺夫权 。 
寅申 七 杀会破军化禄 ， 而有火铃照会 ， 或见辅佐 [ 单 星 ] 亦主两度婚姻 。 
寅申 七 杀与禄存同度 ， 主配偶自私 。 若更为火铃所 夹 ， 则主配偶灾病 。 
寅申 七 杀 ， 以武曲 、 巨门 、 天同 、 天梁各垣 ， 为大 运或流年吉凶克应的枢纽 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌宫七杀 ， 见煞或辅佐 [ 单星 ] ， 多主有情无缘 ， 有缘无情 。 或主婚后仍有感 
情困扰 。 
辰戌宫 七 杀会对宫廉贞化禄 ， 则夫妻和美 。 若廉贞 化忌 ， 则主生离死别 。 煞霞 
者 ， 离后再克 ， 或克后再离 ， 以迟婚为宜 ， 女命且以偏房继室为宜 。 
辰成寓 七 杀踺昌曲 、 桃花 ， 对宫廉贞又化忌者 ， 主 感情痛苦 。 女命则主因玩弄 
感情而生是非 。 
辰戌七杀见吉化吉曜 ， 主终能获得理想的配偶 ， 而 婚前则有恋爱波折 。 
辰戌 七 杀 ， 以 [ 太阳天梁 ] 、 『 天同巨门 』 、 紫微诸垣 为吉凶克应的枢纽 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军在夫妻宫并非善曜 ， 即使破军化禄 ， 亦主婚前 多波折 ， 引起争夺 。 
破军见火铃 ， 或为火铃所夹 ， 主婚姻受破坏 ， 或受 压力 ， 不宜早婚 。 若早婚 ， 
或婚前顺利者 ， 则婚后反主不和 ， 或竟至夫妻冰炭 。 
破军为羊陀会照 ， 主婚前或婚后 ， 双方曾一度分离 。 
破军见空劫 ， 或为空劫所夹 ， 亦主夫 妻有缘无情 。 
破军见辅佐诸曜 『 单星 』 ， 主二度婚姻 ； 或婚后有第 三者介入 ， 或恋爱时多三角 
关系 。 
破军与禄存同度 ， 主配偶自私 。 更见煞曜 ， 则主婚 姻受家庭阻力 ， 或配偶与家 
庭不和 。 
破军受羊陀夹 ， 又为火铃夹 ， 则主配偶不和及亲家 不和 。 
 
凡破军在夫妻宫 ， 男女皆有驾御配偶的倾向 ， 所以 见煞即易分离 。 
破军会武曲化忌 ， 更见羊陀 ， 主无 闺房之乐 ， 在现 代每因此弄成婚变 。 若更火 
铃同度 ， 则主配偶灾病 ， 或至刑克 。 
破军 、 廉贞 、 天相的组合 ， 若廉贞化忌 ， 主与配偶 的兄弟姊妹不和 。 若廉贞化 
禄 ， 则主婚姻和美 ， 唯若更躔桃花 ， 便主有外遇 ； 若破军化禄 ， 男命主妻夺夫权 ， 
女命反主丈夫发达 。 

"""
        print(tmp)
        print("\n")
        if(star == "破军紫薇"):
            tmp = """『 紫微破军 ] 以年龄有差距的婚姻为佳 ， 亦主妇夺夫 权 ；"""
            print(tmp)
            print("\n")
        elif(star == "破军廉贞"):
            tmp = """【 廉贞破军 】 见辅佐 [ 单 
星 ] 或煞曜 ， 主不和 ； 更见桃花 ， 则必多外遇 ；"""
            print(tmp)
            print("\n")
        elif(star == "破军武曲"):
            tmp = """【 武曲破军 】 见煞主刑克 ， 或分居 。"""
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "破军"):
                tmp = """子午破军 ， 对 【 廉贞天相 】， 可参考上段所述 。 
子午破军会贪狼化禄 ， 更见昌曲 [ 单星 ] ， 或踺桃花 诸曜 ， 均主自身有外遇 。 若 
贪狼化忌 ， 则主配偶有外向之 
子午破军所对的 [ 廉相 ] ， 若为刑忌夹 ， 则须视破军 是否与煞曜同度而定其不良 
性质 。 躔空劫者 ， 主夫妻分离 ； 踺羊陀 ， 则主夫妻口舌不和 ； 踺火铃 ， 则主夫妻刑
克或灾病 。 
子午破军以太阳 、 巨门 、 天 同诸宫垣为吉凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "破军"):
                tmp = """ 寅申破军若见对宫 [ 武相 ] 为财荫夹 ， 则不宜更见文 昌化忌 ， 主经历波折而后得 
成婚嫔 ， 且宜无正式婚礼 ， 否则主婚后有一段时期分散 。 
若所对 『 武相 ] 为刑忌夹 ， 可参考子午破军所述 。 
寅申破军会贪狼 ， 若化禄 、 化忌 ， 亦可参考前述 。 
寅申破军以 [ 天同巨门 ] 、 『 太阳天梁 』 宫垣为吉凶克 应的枢纽 。"""
                print(tmp)
                print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "破军"):
                tmp = """ 辰戌破军 ， 基本性质不良 ， 在夫妻宫 ， 以年龄有差 距为宜 。 
辰戌破军 ， 对 [ 紫微天 相 ] ， 若有 『 百官朝拱 』 ， 则主 配偶事业良好 。 但夫妻间却 
有隔膜 。 
辰戌破军 对财荫夹的 [ 紫相 1 ， 主夫妻年龄差距更 大 。 女命宜配年长十二年以上 
之夫 ， 则可受配偶呵护 。 
若刑忌夹 ， 可参考前述 。 会贪狼化禄 ， 化忌 ， 亦参 考前述 。 
辰戌破军化权 ， 不见昌曲桃花则吉 ； 若见 ， 主自身 有外遇 。 
辰戌破军与陀罗同度 ， 则易与有家室的人恋爱 ， 因 此发生困扰 。 
辰戌破军 [ 武府 ] 、 [ 阴阳 ] 、 天同各宫垣为大运流年 吉凶克应之枢纽 。"""
                print(tmp)
                print("\n")
        
def GongXia4th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """ 
凡紫微在子女宫 ， 均主迟得子 ， 门生弟子以及追随 自己的晚辈亦主迟得 。 亦以 
迟得为宜 。 
紫微在子女宫 ， 须见辅弼 ， 然后才可以成为自己的 助力 ， 若见昌曲 、 禄马 、 魁 
钺 ， 仅对子女或晚辈有利 。 
紫微在子女宫 ， 四煞空劫并照者 ， 宜收养或祀继 ， 然后始能得子 。 同时见桃花 ， 
则主偏房或外室生子 。 夫妻 宫不佳 ， 有生离死别之兆者 ， 则主继室生 子 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "紫薇"):
                tmp = """紫微在子午宫 ， 主子女性格倔强 ， 爱恶随心 。 因为贪狼对拱 ， 故多主头胎生女 ； 
在古代 ， 定子女数目为三男二女 。 若为 『 在野 』 ， 则子女孤独 ， 且性格与自己不合 ； 
若为 『 百官朝拱 ] ， 则子女地位崇高 ， 且子女数目增加 。 
紫微在子午 ， 与禄存同度 ， 主子女自私 。 又躔火铃 ， 则主未婚生子 。 
紫微在子午 ， 只需不为 【 在野孤君 】， 则主下属晚辈得力 ， 且有领导才能 。 若 [ 在 
野 ] ， 则常易因主观而误事 。 若更见煞忌刑曜 ， 则须提防难于驾御 。 
紫微在子午宫会昌曲 ， 主子女聪明秀发 ， 但若更见桃花诸曜 ， 是主女多子少 。 又 
同时见煞刑诸曜 ， 则子多克而女能留 ， 终至变成女多子少 。 见煞而不见桃花 ， 则主 
生二子 。 
紫微在子午宫带煞忌 ， 主反受下属晚辈箝制 。 以贪 狼宫垣为克应之期 。 又或以 
会合武曲化忌的宫垣为克应之期 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """ [ 紫微破军 ] 在丑未宫 ， 以先生女为宜 。 倘煞刑诸曜 会合 ， 头胎生子者 ， 防破相 ， 
重则刑克 。 或不足月生 ， 或有产难 。 
『 紫破 』 守子女宫主 子 女三人 。 见辅佐诸曜对星者 ， 数目增加 ， 但数目仍为单 
数 ， 同时见煞 ， 则由变数克至单 数 。 
『 紫微破军 』 在丑未 ， 见昌曲桃花 ， 主女多子少 ， 亦 主偏房或外宠生子 。 
『 紫破 』 为昌曲左右同夹 ， 亦主有孪生子 。 以不见煞 同度为确 。 只见昌曲夹 ， 
主子女聪明 ， 只见左右夹 ， 主子女得力 ， 且富创造力 。 
『 紫破 』 见煞 ， 一般主下属其反叛性 。 行至巨门 、 太 阳 、『 武杀 』 见煞忌 ， 为克 
应之期 。 又或自己命宫行至 『 刑忌 夹印 』， 子女宫太阴化忌 ． 则主受子女及晚辈拖累 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """ 寅申宫 『 紫微天府 』 主子女五人 。 辅佐对星同会 ， 数 目增加 。 且子女有相当数目 。 
寅申 [ 紫府 ] 见辅佐 『 单星 』 ， 必主有两重子女 ； 故宜 详视夫妻宫 ， 推断其两重 
子女的意义为何 。 
『 紫府 』 与禄存 同度 ， 见火铃 ， 主偏房生子 。 亦主无 晚辈追随 。 
『 紫府 』 会武曲化禄 ， 或廉贞化禄 ! 或财荫夹的天相 ， 则主子女富有 ， 唯与独生 
子的关系易疏远 ， 与女儿关系则佳 。 
寅申 『 紫府 』 会廉贞化忌 ， 主因子女伤心流泪 ； 亦主心腹反叛 。 会武曲化忌 ， 
主子女刑伤 ， 或主子女倾家 ， 亦主受晚辈箝制拖累 。 须详实际星曜组合而定 。 克应 
之期 ， 为廉 、 武 、 巨 、 阳见煞忌刑曜守垣之大限或流年 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """卯酉宫 【 紫贪 】 见辅佐诸曜对星 ， 主子女 七 人 ； 『 孤 君 』 则主四人 ； 在卯 者多行 
生女 ； 在 酉宫者主先生子 。 
[ 紫贪 ] 两邻 ， 一蹿昌曲单星 ； 一躔左右单星 ， 则子 女婚姻有事端 ， 多为其配偶 
与自己不和 。 
[ 紫贪 ] 喜见武曲 、 廉贞化禄 ； 不喜化忌 ， 其推断与 [ 紫府 ] 向 。 
[ 紫贪 ] 与火铃同度 ， 防子女或晚辈骄者 ， 并不主子 女发达 。 若贪狼化忌者则更甚 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """辰戌宫 [ 紫徽天相 ] ， 主子女四人 ； 见辅佐对星则子 、 女数目增加 ； 见煞 ， 则由 
单数克至双数 。 最不喜为刑忌夹 ， 主子女懦弱 ， 晚辈不得力 。 
[ 紫相 ] 躔火铃 ， 主子女宜远方发展 。 会禄存 、 化禄 ， 则可帮助自己事业 。 
[ 紫相 ] 与桃花 、 昌曲诸 曜同躔 ， 子女聪明 ， 再见煞 忌 ， 则恐流连酒色风月 。 若 
空劫同度 ， 则主偏房生子 。 
[ 紫相 ] 守子女宫 ， 一般主有晚辈扶助自己的事业 ， 若煞忌刑曜重重 ， 则反为所 
累 。 其吉凶克应 ， 以 『 武曲天 府 』 、 廉 贞 二垣为枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """巳亥宫 『 紫微 七 杀 』 ， 主子女三人 。 见辅佐对星 ， 数 目增加 ， 但不超过六人 。 同 
时见煞忌刑曜 ， 子女有刑克 。 
巳亥 『 紫杀 』 ， 子女极强头 。 须见禄以调和 ， 否则有 代沟 ， 晚辈性 ： 质亦如是 。 
巳亥 『 紫杀 』 见 『 武曲贪狼 』 躔火铃 ， 主子女远离 ， 更 见忌星 ， 则子女因贪致 
败 ； 论与晚辈的关系 ， 则主受其侵吞剥削 。 
巳亥 『 紫杀 』 最喜对宫天府与禄存同度 ， 则为创业人 才 。 唯亦主受晚辈拖累以 
致自身受损失 。 
巳亥 『 紫杀 』 躔禄马 ， 或与禄马对拱 ， 主 ： 子女能于远 方创业 。 又主自己桃李满 
天下 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机在子女宫 ， 一般均主子少 ， 唯偏房外室生者则 多 。 在社会人际关系而言 ， 
亦主随自己的下属及晚辈稀少 ， 或时时更换 ， 关系不常 。 且均主迟得 。 
天机同会辅佐对星 ， 则子女数目增加 ， 但仍有女多 子少的情况 。 尤其是与桃花 
诸曜同度时 ， 决主女多 ， 在申宫与太阴同躔时尤确 。 下属晚辈亦有同样情况 。 
天机同会四煞空劫 ， 则主无子 。 躔桃花诸曜则可生 女 。 若只会两三点煞曜 ， 同 
时又见辅佐吉曜 ， 则可偏房外室生子 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天机"):
                tmp = """子午宫天机 ， 与巨门相对 ， 主只一子 。 又主时时更 换直接追随自己的下属 ； 如
有门生弟子 ， 关系亦不密切 。 
天机在子午宫 ， 若与火铃同会 ， 主有小产或流产 。 亦主子女出生后不久 ， 即因 
客观环境远游外出 ， 以致时时分离 。 
天机在子午宫见吉化 ， 又得吉曜扶持 ， 而无火铃同 躔毒 ： 宜培养子女为专业人 
材 ， 不宜从商 。 尤以计划 、 管理 、 财务等业为宜 。 
天机在子午宫 ， 巨门化忌 ， 或天机化忌者 ， 宜注意 子女性格 ， 须改善其过高理 
想 ， 不肯脚踏实地的缺点 ， 否则易自误 。 
子午天机 ， 以 『 武曲 七 杀 』 、 『 廉贞负狠 』 、 及大下 机各垣为吉凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天机"):
                tmp = """ 丑未天机与天梁相对 ， 主子女一二人 。 但另有小产 流产 。 若与四煞空劫同会 ， 
则主无子 ， 或 有亦流产 。 亦主下属晚辈极少 ， 且时时更换 。 
丑未天机见吉化 ， 则可增加子女数目 ， 且子女地位 亦主提高 。 
丑未天机在子女宫 ， 子女可能发展为喜挑剔的性 格 ， 宜加以改善 ， 发展为监察 、 
管理 、 计划等 ， 即将挑剔化为心思缜密 。 
丑未天机 ， 以 『 廉贞天相 』、 武曲 、 天梁备垣 ， 为流年大运的吉凶枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """寅申宫 『 天机太阴 』 同度 ， 在寅宫者子女三人 ， 即二 子一女 ； 在申宫者则主女 
多子少 ， 只主一子 ， 若与桃花诸曜同会 ， 女更多 ， 唯亦主偏房外宠生子 。 
寅申 『 天机太阴 』 同度 ， 见煞 ， 又见桃花诸曜 ， 复见 基辅右弼 ， 主 [ 姑子归宗 J 。 
即 自身无子 ， 以姊妹之子承祀 。 唯现代或已少这种情形 。 
寅申 『 天机太阴 ] 会天同化忌 ， 又见煞曜重重者 ， 主 有小产流产 。 或子女小时多 
灾病 。 见辅佐诸曜对星或吉化 ， 主子女数目稍增 ， 亦可改善子女之品格及天赋 。 一 
般主心思浮荡不定 ， 化忌则内向 ， 且精神紧张 。 古则主聪敏 。 
寅申 『 机月 』 ， 以天同 、 天梁 、 巨门三垣为克应之言枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯酉 [ 天机巨门 ] ， 主只生一子 。 见桃花诸曜则多女 。 
卯酉 『 天机巨门 』 纵使吉化 ， 亦主两代参商 。 见煞忌则更甚 。 用来推算跟晚辈 
的关系 ， 则主隔膜 ， 煞重又见阴煞 、 天虚等曜 ， 则主为亲信出 卖 。 
卯酉 [ 天机巨门 ] 为始善终恶之曜 。 推算子女宫时宜 注意及此 。 尤不喜与火铃同 
度 ， 则参商更甚 。 
若天机化忌 ， 则多分离隔膜 ； 若巨门化忌 ， 则口舌 纷争 。 必须见禄然后能改良 
性质 ， 但只主彼此表面融和 ， 内心仍多顾忌 。 
[ 天机巨门 ] 以本身宫垣 ， 巳宫的天梁 ， 亥宫的天同 为吉凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """辰戌 [ 天机天梁 ] ， 稍见煞即主小产 、 流产 。 若煞忌 刑耗诸曜重重 ， 则主子女幼 
年多灾病 ， 且有意外虚惊 ， 及年长则远离父母 。 故以此推凳与晚辈下属的关系 ， 亦 
主不久长 。 
辰戌 [ 机梁 ] 见吉化 ， 或会 吉曜 ， 则子女聪明 ， 但有 主见 。 不宜在幼年时对其诸 
多限制 ， 否则阻碍其心智发展 。 若论晚下 ， 则主可得独立工作 能力之助手 。 
． 辰成 『 天机天梁 』 ， 与火铃同度 ， 主子女远离 。 与羊 陀同度 ， 则宜培养其理工 
方面的兴趣
辰戌 『 天机天梁 』 ， 借会 『 太阳巨门 』 ， 以借会寅宫耆 为佳 。『 太阳巨门 』 主口才 ， 
故亦宜培养子女这方面的发展 。 
辰成 『 机梁 』 ， 以 『 太阳巨门 』 、 [ 天同太阴 ] 两垣 ， 为 吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天机"):
                tmp = """巳亥宫天机独坐 ， 与太阴相对 ， 以巳宫为佳 。 亥宫 天机对巳宫太阴落陷 ， 日生 
人及下半月生人 ， 对长女有妨 。 
巳宫天机 ， 主二女一子 ； 亥宫者 ， 子极迟得 。 桃 花诸曜同度则女儿数目增加 。 
辅佐吉曜同度 ， 则子女数目增加 。 
巳亥天机与四煞空劫同度 ， 正室无子 ， 主偏房外宠 生子 。 
躔桃花 ， 煞重 ， 又见左辅 、 右弼 『 单星 』 ， 主 『 姑子归宗 』 。 
巳亥天机若无吉曜 ， 但与空劫 、 天姚同度 ， 主晚辈 及亲信有权术阴谋 。 又见昌 
曲 、 辅弼对星 ， 则主女性者有助力 。 
巳亥天机以 『 天同巨门 』 、 『 太阳天梁 』 为吉凶克应的 枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """  
凡太阳落陷在子女宫化忌 ， 又见煞曜同会 ， 夜生人 ， 头胎以生女为宜 ， 长子难养 。 
日生人则情况略轻 。 
凡太阳在 子女宫遇上述情形 ， 主提拔后进反招怨忌 。 
凡太阳与太阴化忌会合 ， 则视火铃 ， 若火铃与太阳 同度 ， 则主子女与父母分离 。 
此时即须视夫 妻宫 ， 推断有无夫妻分离的征兆 。 
凡太阳在子女宫 ， 入庙吉 ， 日生人尤吉 ； 落陷凶 ， 夜生人尤凶 。 若日生人入庙 ， 
化忌亦未必凶 ， 仅主父子有 代沟 。 倘辅佐诸曜华集 ， 太阳化忌而与巨门对拱或同度 
者 ， 有时反主子女为法律 、 外交 、 推销等 『 口舌生财 』 的专业人 士 。 
凡太阳在子女宫 ， 必兼视太阴 、 天梁 、 巨门三曜 ， 然后始能综合推断 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "太阳"):
                tmp = """子午太阳与天梁相对 ， 以午宫为佳 。 享宫太阳 ， 夜 生人 ， 头胎以生女为宜 。 若 
生子 ， 主不成器 。 且子女易 抚离 。 午宫者 ， 日生人尤吉 ， 主男三女二 ， 头胎以生子 
为宜 。 太阳化忌 ， 主头胎有损 。 
子午太阳亦喜辅佐诸曜同会 ， 子女数目可增加 ， 且 主子女有社会地位 。 午宫尤 
佳 。 
子午太阳与煞曜空劫同度 ， 则子女有刑克分离 ， 仅 留一子送终 。 
子育太阳 ， 化忌 ， 主父子有代沟 ； 午宫太阳 ， 化禄 ， 则须防子玄虚浮 。 与晚辈 
亲信关系亦可同断 。 
子午太阳以天同 、 『 天机太阴 』 为吉凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "太阳太阴"):
                tmp = """丑未宫 『 太阴太阳 ] 同摩 ， 未宫主子女众多 ， 无煞 ， 可以八胎以上 ； 更躔辅佐吉 
曜 ， 数目尤多 。 丑宫无煞 ， 四胎 。 见辅佐吉曜 ， 数目增加 。 
丑未 [ 阴阳 ] 躔桃花诸曜 ， 则主女多子少 。 夜生人尤 甚 。 卜 
丑未 『 阴阳 』 ， 有一化忌 ， 主子女主观横蛮 ， 人生亦 较多挫折 。 晚辈亲信性质可 
以同断 。 
丑未 【 阴阳 】 与昌曲 、 龙池凤阁 、 天才等曜同度 ， 主 子女聪明 。 见魁钺则主受 
贵人提拔 。 化禄仪科则主贵 。 
丑 未 『 阴 阳 』 见 巨 门化忌借会昔 ， 主子女多思多虑 ， 易悲观 。 子女宫行至借 『 机 
巨 』 安星的宫垣 ， 多生事端 。 详 实际星曜组合而定 。 
丑未 『 太阴太阳 』 以 『 机巨 』 、 天同 、 天梁备垣为流年 大运吉凶克应之枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "太阳巨门"):
                tmp = """寅申 『 太阳巨门 』 ， 子女三人以上 。 主有辩才 ， 及有 学 习外语 、 方言的能力 。 见 
昌曲 ， 主聪敏机智 ； 见魁钺 ， 主有说服别人的能力 ； 见辅弼 ， 主有领导力 。 若太阳 
或巨门化禄 、 权 、 科 ， 则主子女富贵 。 
寅申 『 巨阳 』 ， 躔天刑 ， 见吉曜 吉化 ， 子女为法律人才 ； 若叠禄 ， 则宜异族生财 ； 
若见昌曲禄马 ， 则宜外国谋生 。 
寅申 [ 太阳巨门 ] 若巨门化忌 ， 则必会吉化 ， 故主子 女 『 口舌生财 』 ， 并不主凶 。 
若煞忌刑曜齐集 ， 则主子女有刑克 ， 并不使其本质 变坏 。 
可用以上星曜性质来推断晚辈 、 亲信的本质 ， 则能知人善用 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "太阳天梁"):
                tmp = """卯 酉宫 『 太阳天梁 』 ， 擎羊同度 ， 主子女出生时需动手术 。 若太阳 化忌 ? 则长子 
幼年有灾难虚惊 。 
卯酉 『 太阳天梁 』 若成 『 阳梁昌禄格 』 ， 主子女为学 术 、 专业研究人才 。 躔 天月 ， 
可从事医药 ； 躔 天刑 ， 宜从事法律 。 若禄 、 权 、 科会 ， 则宜从政 ， 以监察职务为主 
要性质 。 见煞 ， 则为理工 、 核数 、 监管 、 企业策划人才 。 亦 
可此性质来推断晚辈 ， 主要助手 、 亲信的才能 。 
『 太阳天梁 』 为孤克之星 ， 故往往主子女远离 。 太阳 在酉宫者尤甚 。 
[ 太阳天梁 ] 只需见禄 ， 与文曲同踺亦吉 ， 在现代为 理工科学研究人才 。 
卯酉 『 太阳天梁 』 ， 以 [ 天同巨门 ] 、 破军两垣 ， 为吉 。 凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "太阳"):
                tmp = """ 辰戌宫阴阳对拱 ， 主子女四人 。 辅佐及桃花皆主子 ‘ 
女数目增加 。 辰宫太阳主聪敏及具魄力 ， 戌宫者平常 。 
辰戌宫太阳独坐 ， 必视茂门 ， 然后可厘定子女晚辈 下属的性质 。 茂门化忌 ， 则 
反可从事法律 ， 太阳化忌 ， 亦主是非口舌以生财 ， 或主在外国机构服务 ， 茂门化禄 
权 ， 则子女为兴创事业人材 。 
辰戌宫太阳独坐 ， 以 [ 天同天梁 ] 、 天机 、 巨门为流年大这吉凶克应的枢纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "太阳"):
                tmp = """巳宫太阳独坐 ， 与巨门对拱亦主子女聪敏 ， 唯在巳宫则更具毅力 。 
巳亥宫太阳见占化 、 古曜同会 ， 子女亦为创业或专业人才 ， 可参考 『 太阳 巨 门 』 ， 
唯巳亥 宫 者 ， 商业性质更重 。 
巳亥寓太阳均主三男二女 ， 躔辅弼桃花则数目更多 。 唯巳宫者易浮奢 ， 亥宫者 
则主沉潜 ， 故人生皆有挫折 。 
巳亥宫太阳独坐 ， 化忌亦无妨 ， 除非火铃同度 ， 否 则不主刑伤 。 唯仍主易分离 。 
巳亥宫太阳 ， 以天同 、 天机 、 巨门为运限年限吉凶 克应的枢纽 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲临子女宫 ， 一般情形下主子女少 ， 又较利女不 利子 ， 故多先生女 。 亦主追 
随自己的后辈较少 ( 此则同时 须视左辅右弼 ) 。
武曲在子女宫 ， 亦主发妻无子 ， 但可有女 。 而偏房 、 继室则可生 子 。 若火铃同 
度 ， 则亦主外室生子 ， 或祀养他人之子 。 
武曲化禄 、 权 、 科 ， 或与辅佐吉曜同会 ， 只视为子 女数目增加 ， 不视为子女品 
格地位的改善 。 
武曲守子女宫 ， 成 ( 铃昌陀武 ) 格者 ， 主生子易夭折 。 武曲化忌尤甚 。 
武曲在子女宫 ， 羊陀不甚畏 ， 只畏火铃同度 。 唯若 武曲化忌 ， 为羊陀所夹 ( 这情 
形只有亥宫的 [ 武曲破军 ] ) ， 则主子女刑克甚重 ， 甚至可能自杀 。 亦主无子送终 。 
武曲为火铃夹亦不利 。 主子迟得 。 [ 武曲贪狼 ] 与火 铃同度 ， 子虽在四十岁以前 
可得 ， 但必主生离 。 辅佐吉曜同会 ， 则为良性的分离 ， 如儿子寄宿学校之类 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """ 子午宫 [ 武曲天府 ] ， 主得三子 。 由于天府为南斗主 星 ， 故若辅佐对星会合 。 数 
目可增加至五胎 若同时见煞 忌刑空劫 ， 则仅得一子送终 。 [ 府库空露 ] ； 则子女及晚 
辈不 得力 。 
『 武府 』 与禄存同度 ， 主 子女晚辈自私 。 行至 『 天机 巨门 』 守子女 宫 之大限 ， 
恐生事端 。 
子午 『 武府 』 见煞刑而不见忌 ， 有时仅主子女破相 、 或性情倔强 、 父子代沟 ， 
未必有刑克 。 在吉曜同时凑集的情况下尤确 。 
子午 『 武府 』 ， 以 『 紫相 』 、 七 杀两垣为吉凶克应的枢 纽 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "武曲贪狼"):
                tmp = """丑未宫 『 武曲贪狼 』 ， 主四十后得子 。 这是古人的说 法 。 古代婚姻年龄较早 ， 四十 
岁得 子已称迟得 ， 在现代 ， 得子的年龄应更晚 。 
丑未 『 武贪 』 见煞在外 ， 又见桃花诸曜 ， 则主偏房 、 外室生子 。 发妻则生女 。 
丑未 [ 武贪 ] 若与火铃同度 ， 则主得子尤迟 。 若早年 生子必须离家 、 寄养 ， 否则 
恐有刑克 。 父子感情至晚年有隔膜 。 推断跟晚辈亲信的关系 ， 亦主始吉终凶 。 
丑未 『 武贪 』 以 『 巨阳 』 两垣为吉凶克应之期 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "武曲天相"):
                tmp = """
寅申宫 [ 武曲天相 ] ， 主先祀一子 ， 然后亲生一子 。 会桃花 ， 则偏房先生子 ， 然后 
发妻生子 。 在现代 ， 亦主婚外生子 。 与晚辈亲信人际关系不佳 。 
． 寅申宫 『 武曲天相 』 ， 见煞忌刑曜 ， 主子女有 刑 克 。 见辅佐吉曜对星 ， 始主子 
女数曰增加 ； 见单星 ， 主婚外 生子 。 
寅申 『 武曲天相 』 以贪狼 、 七 杀两垣 ， 为占凶应验的 枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "武曲七杀"):
                tmp = """卯酉 [ 武曲 七 杀 ] ， 仅得一子 。 若见煞 ， 如多于一子 ， 则主长子有破相 、 伤残 ， 
且往往主继室 、 外室生子 。 见辅佐吉曜 ， 主得子性格刚烈 。 若煞曜空劫与吉曜吉化 
齐会 ， 则主因子性刚而破家 。 
卯酉 『 武曲 七 杀 ] ， 武曲化忌为火铃夹者 ， 刑克伤残 极重 。 必须同时见辅佐吉电 
信局 ， 然后始主迟得子 。 若躔桃花昌曲 ， 则可能有女无子 。 与晚辈人际关系同此推 
断 。 
卯酉 『 武曲七杀 』 见煞 ， 不宜招祀外子 ， 恐恩反招怨 。 故亦主追随自己的晚辈 
反叛 。 
卯酉 [ 武曲 七 杀 ] ， 以巨门 、 天机 、 [ 廉贞贪狼 ] 三垣 为吉凶克应之期 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "武曲"):
                tmp = """辰戌宫武曲独坐 ， 子可较早得 ， 主生一子 。 见辅佐 诸曜则可增加至三子 。 唯仍 
以先得女为佳 ， 否则长子幼年恐多病 。 
辰戌宫武曲会贪狼化忌 ， 又有煞曜同度 ， 则主防子 女骄奢倾家 。 躔空劫 、 火铃 
尤甚 。 若躔羊陀 ， 则仅主极迟得子 。 
辰戌宫武曲会贪狼化禄 ， 又见桃花 ， 则主外室或继室生子 。 倘又躔火铃 ， 仍防子 
女骄奢以致倾败 。 
辰戌宫武曲 ， 以 『 廉贞天相 』 、 贪狼 、 七杀三宫垣为 。 流年大运吉凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """巳亥宫 『 武曲破军 ] ， 主生一子 。 见煞 ， 多于一子则 有刑克 ， 刑至一子为止 ， 须过 
继与人然后可免 。 或主长子破相 。 
[ 武曲破军 ] 守子女宫 ， 基本意义为父子不和 。 或因 各种客观情形以致父子分离 。 
持此推算跟晚辈的运程 ， 可以同断 。 
巳亥 『 武破 』 ， 仅于无煞曜同度 ， 但三方四正有辅佐诸 曜 [ 对星 ] 会合或同度 的情 
形下 ， 可得三子 。 唯仍易与子女分离 。 在此情形下 ， 儿子 ( 特别是长子 ) 往往不足月 
生 ， 或 须动手术生产 。 
巳亥 [ 武破 ] 不宜见廉贞化忌 ， 常生晚年丧子 。 唯仍 须诚详晚运子女宫之实际星曜 
组合情形而定 。 
巳亥 [ 武破 ] 以本宫及 [ 廉贞 七 杀 ] 、 『 紫微贪狼 』 三宫 垣为吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同在子女宫 ， 一般情形下主子女众多 ， 虽头胎以 生女为宜 ， 则虽见煞曜 ， 亦 
不主小产 、 流产 、 刑克 。 
天同在子女宫 ， 主与子女感情易沟通 。 亦可持此论 断跟晚辈的关系 ， 唯嫌其怕 
事 。 
天同在子女宫化忌 ， 若为天同 、 太阴 ； 或天同 、 天 梁的组合 ， 更见煞曜 ， 须防 
子女中有弱智 、 自闭症者 。 
天同化禄 ， 主子女白手可以兴家 。 但亦主追随自己 的晚辈易脱离自己 ， 另起炉 
灶 。 
天同见辅佐诸曜单星 ， 主有两重子女 。 若夫妻宫不 见再婚或有外宠的情形 ， 则 
为收养祀子 。 
天同与桃花 诸曜同度 ， 主多生女 。 尤以天同 、 太阴 的组合为然 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """子午 [ 天同太阴 ] ， 一般情形下主女多子少 ， 且主先 生女 。 在子宫者 ， 子女五人 ， 
午宫者三人 。 见辅佐吉曜可增加数目 ； 见煞忌空劫则有刑克 、 伤残 。 
子午 [ 天同太阴 ] 见昌曲 、 龙凤 、 天才 ， 主子女极聪 明 。 单见龙池 ， 则主有音乐 
天赋 。 若躔火铃 ， 则防聪明太露 。 
子午 [ 天同太阴 ] 见阴煞 、 天姚 ， 双无辅佐对星同会 ， 则子女恐过份内向 。 若化 
忌 ， 则可能发展为权术之士 。 
子午 [ 天同太阴 ] 见 [ 太阳巨门 ] 吉化 ， 又有吉曜同 会 ， 则主子女受异族提拔 、 赏 
识 。 又主有学习方言 、 语言能力 。 唯不如子女宫 『 太阳 巨 门 』 躔度者之佳 。 主 要分
别 ， 在 『 天同太阴 』 者际遇较少 。 
子午 『 天同太阴 』 以 『 太阳巨门 』 、 『 天机天梁 』 及本 宫为吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """丑未宫 『 天同巨门 』 主子女三人 ， 亦以先生女为宜 。 见辅佐诸曜增加 ， 桃花重 
重 ， 则头三胎先生女 ， 然后始得一子 。 
丑未 『 天同巨门 』 喜煞曜激发 ， 否则主子女意志薄 弱 ， 唯有煞则又主刑克 。 
丑未 [ 天同巨门 ] 躔昌曲 ， 又躔桃花 ， 则子女聪敏而 毅力不足 。 女儿尤易失足 ， 
或有畸恋苦恋 。 
丑未 [ 天同巨门 ] 若巨门化忌 ， 则主骨肉参 商 ， 亦主与自己提拔扶持 的人反目 ； 
倘天同化忌 ， 则子女多灾病 。 
丑未 【 天同巨门 】， 以化禄为宜 ， 但却又主子女刚毅 不足 。 
丑未 【 天同巨门 】 ， 以紫徽 、 贪狼 、 『 太阳天梁 』 为流 年大运吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天同天梁"):
                tmp = """寅申 『 天同天梁 』 宜先生女后生子 ， 主有 子 二人 。 唯 在申宫者 ， 稍见煞忌 ， 即 
易仅留一子 。 辅佐诸曜同会 ， 则子女数目增加 。 
寅申 『 天同天梁 』 见煞忌重重 ， 亦主子女伤残 ， 或弱 智 。 火铃 、 空劫尤甚 。 
寅申 『 天同天梁 』 见天马 ， 主子女离家发展 。 
天梁化禄 ， 更见辅佐吉曜 ， 宜培养子女为专业人才 ； 见煞 ， 则以工程科技为佳 。 
寅申 [ 同梁 ] 见天机化忌与煞曜同度 ， 主有流产 、 小产 。 
寅申 [ 同梁 ] 见太化忌 ， 又见禄马 ， 子女破尽祖业而 后离乡兴家 ； 天同化禄 ， 亦 
主子女自兴 ， 唯只主不能承继祖业 。 
寅申 [ 同梁 ] 以天机 、 巨门 、 太阴三垣及本宫为流年 大运吉凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天同"):
                tmp = """卯酉天同独坐主女多子少 。 卯宫者子女五人 ， 酉 宫则四人或二人 ， 或由单数刑 
至双数 ； 不刑见主少小离家 。 
卯酉天同 ， 与子午宫 『 天同太阴 』 有类似性质 ， 可以 同参 。 唯不会 [ 太阳巨门 ] ， 
故性格较为好高鹜远 ， 且理想 高而少实际 。 
若巨门化忌 ， 主子女性格重理想 而脱离现实 ， 但却 固执 。 
卯酉天同以巨门 、 太阳 、 太阴三垣 ， 为流年大运吉 凶克应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天同"):
                tmp = """辰戌宫天同独坐 ， 子女二至三人 。 见煞则只一人 。 见辅佐吉曜则增至三人 。 
辰戌宫天同 ， 主子女感 情 重于理智 。 见昌曲桃花者 ， 感情尤重 。 
辰戌宫天同化禄 ， 主子女不享祖业而自兴 。 化忌 ， 则宜业破败 。 
辰戌宫天同与陀罗同度又躔火铃 ， 主中年子女有伤 残 、 意外 。 
辰成宫天同 ， 以天梁 、 巨门二垣 ， 为吉凶克应的枢 纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天同"):
                tmp = """ 巳亥宫天同 ， 以先生女为宜 。 主子女三人 。 见火铃 、 或见禄马 ， 均主子女离家 
发展 ， 且性格难以捉摸 ， 反叛性强 。 
巳亥天同 ， 最不宜 见巨门化忌 ， 主刑克分离 。 见煞者尤甚 。 
巳亥天同化禄 ， 虽不见马 ， 亦主子女离乡背井 。 
巳亥天同 ， 视借会之 [ 太阴太阳 ] 定子女吉凶休咎 。 妇太阳化忌 ， 有煞 ， 夜生人 
决主克子 。
巳亥天同以 『 太阴太阳 』 、 [ 紫微天相 ] 二垣为吉凶克 应的枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞喜入子女宫 ， 一般情形下 ， 主两代感情浓厚 ， 有隔膜亦能互相谅解 。 所以 
廉贞化忌 ， 往往便代表感情上的创伤 ， 亦即子女的夭折 。 这跟巨门化忌之表征为口 
舌不和 ， 恰成对比 。 
廉贞化禄在子女宫 ， 代 表感情上的喜悦 ，、 故可表征 为得佳儿佳女 、 星曜吉化未 
必表征子女数目增加 、 唯廉贞化禄则可有此表征 。 
廉贞化忌 、 化禄 ， 对此星曜的影响非常敏感 ， 上述 仅为一般原则 ， 具体星曜组 
合如何 ， 时能改变一些细节 。 
例如同一廉贞化忌 ， 有时仅代表子女以怨报德 ， 并 不代表刑伤 。 主要视煞星与 
廉贞是否同度而定 。 若有两颗以上煞曜进入子女宫 ， 则可视为刑伤夭折 。 若煞曜仅 
在三方 ， 则为以怨报德 。 
廉贞与天府同度或相对 ， 为最稳定组合 ； 与破军同 度或相对 ， 最不稳定 。 此为 
推断原则 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """子午宫 [ 廉贞天相 ] ， 主子女二人 ； 见 桃花诸曜或辅 佐诸曜皆主增加 。 若见辅佐单 
星 ， 又见桃花重重 ， 则主两重子女 。 
子午 [ 廉相 ] 为财荫夹 ， 子女虽可秀发 ， 但得子迟 ， 三 十以后子女常易因小产流 
产而致刑克 。 若为刑忌夹 ， 则 反主子女妨害父母 。 须详夫妻宫同断 。 
子午 『 廉相 』 有煞忌空劫刑耗诸曜同会 ， 主亲子刑 伤 ， 以立祀子为宜 ； 若同时 
见吉曜 ， 则立祀后可得一子 。 同时见桃花 ， 主外室庶室生子 。 
子午 『 廉 相 』 以贪狼 、 破军 、 及本宫为流年大限吉凶 克应之期 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未 [ 廉贞 七 杀 ] ， 主仅得一子 。 见辅佐诸曜可增加 数目 ， 且子女品德性格亦有 
改善 。 若四煞空劫天 刑同会 ， 则主有刑克 ， 可能克至仅得一子 。 
丑未 [ 廉贞 七 杀 ] ， 有火铃同度 ， 子女主生离 ， 或宜 寄养 。 廉贞化禄 ， 则感情仍深 
厚 ； 化忌 ， 则主父子参商 。 又主晚辈以怨报德 。 
丑未 【 廉贞 七 杀 】 见吉化 ， 及见辅佐吉曜则子女成 才 。 
丑未 『 廉杀 』 以天相 、 『 紫贪 』 、 『 武破 』 及本宫为吉凶克 应的枢纽 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "廉贞"):
                tmp = """寅申宫廉贞独坐 ， 不见空劫 ， 则主先生女 ， 亦以先 生女为宜 。 更躔桃花诸曜 ， 
则女尤多 。 见辅佐吉曜 ， 主得二子 。 无桃花而见吉曜则主得三子 。 
寅申廉贞 ， 子女不宜从商 。 
寅申廉贞见禄马 ， 子女宜离家发展 。 
寅 申廉贞化禄会武曲化科 ， 为相当优美的结构 ， 子 女可在财政经济方面发展 ， 
唯需以任公职为宜 。 
寅申廉贞化忌 ， 主两代感情创伤 。 须详实际星曜组 合而定事端 。 或主刑克 ， 或 
主感情破裂而有隐衷 。 与后辈关系同此推断 。 
寅申廉贞以杀 、 破 、 狼三垣为流年大运吉凶克应的 枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉宫 [ 廉贞破军 ] ， 主得一子 。 见辅佐诸曜对星 ， 则子女数目增至双数 。 见煞曜
空劫刑耗 ， 则子女克至仅留一人 ； 若吉煞混杂 ， 亦主克至单数 。 见辅佐 [ 单星 ] ， 亦 
主 子女单数 。 
卯酉 [ 廉破 ] 一般情形下主长子难养 。 加吉 、 吉化 ， 则或主长子破相 。。 若见辅佐 
诸 曜 [ 单星 ] ， 则主收养别人子 女 ； 或自己将长子长女出祀承继 。 然亦有特别情形 ， 
主有 [ 假子 ] ( 如向政府或宗族虚报之类 ) 。 
卯酉宫 [ 廉破 ] ， 最喜化禄 。 廉贞化禄则子女善于运 筹帷幄 ； 破军化禄则甚具组 
织力 ， 宜依此善为培养 。 对追随自己的晚辈 ， 同此推断 。 若廉贞化忌 ， 则子女性格 
反叛 ， 而且往往命运有重大挫折 。 故再加煞刑空劫 ， 则主夭折或 
伤残 。 但化忌而见吉曜 ， 则反主为人温文有礼 ， 而具突破现状之才能 。 亦可依此推 
断晚辈 ， 故主有青出于蓝的佳弟子 。 
卯酉 [ 廉破 ] ， 以本宫 、 『 天机天梁 』 、 『 太阳巨门 ] 为吉 凶克应的枢纽 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌 [ 廉贞天府 ] ， 主得三子 ， 见辅佐吉曜对星 ， 则 可至五子 。 桃花诸曜同踞 ， 
则女多子少 。 会武曲化忌 ， 子女克至双数 。 廉贞化忌 ， 子女克至单数 。 
辰戌宫 [ 廉贞天府 ] ， 见吉化吉曜主子女秀发贵显 。 若煞忌刑耗同会 ， 主克 ， 而 
不影响子女品格或地位 。 
戌宫 [ 廉府 ] 会刑忌夹的 [ 武曲天相 ] 而武曲化忌 ， 则 主子女伤残夭折 。 亦主亲近 
的晚辈反叛 。 
辰戌 [ 廉府 ] ， 以 [ 天同巨门 ] 、 七杀 、 破军为吉凶克 应诸垣 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥 [ 廉贞贪狼 ] ， 主仅得一子 。 踞空劫 ， 先子后女 ； 煞忌刑耗同会 ， 则克至留一 
吉曜齐会 ， 数目增至双数 ； 又稍见煞 ， 则不增 ， 或增后仍只留单数 。 
巳亥 [ 廉贪 ] ， 而廉贞化禄 ， 更见吉曜 ， 子女亦必成 才 ， 虽劳碌则难免 。 
巳亥 『 廉贪 』 化忌皆不吉 。 主感情不洽 ， 亦主子女离 家 ； 见煞则主意外或流产 。 
巳亥 『 廉贪 』 以 『 天同天梁 ] 、 太阳 、 巨门诸垣 ， 为流 年大运吉凶克应的枢纽 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """子女宫喜天府加临 ， 主子女孝顺友爱 、 敦厚诚笃 。 且数目众多 。 
子女宫见天府独坐 ， 一般主得五子 。 若桃花诸曜同 踞 ， 又见辅佐对星 ， 则可能 
五子之外更多女 ； 或五女三子 ， 即使见煞 ， 亦主子女总数不少于五人 。 
天府坐子女宫 ， 不忌煞曜 ， 只忌 空劫 ， 为子女有夭 折之征 。 若会刑忌夹的天相 ， 
亦主子女有灾病破相夭折等情 ， 或生产时动手术 ， 或与父母性格不相投 。 
子女宫天府得禄 ， 或 [ 府库空露 1 ， 仅影响子女之际 遇 ， 不影响两代关系 。 
天府与禄 存同度 ， 头胎常过产期生产 。 所会天相为财荫夹者尤然 。 唯若火铃与 
天府同度 ， 则反主不足月生 。 
天府与煞曜刑耗同会 ， 主子女性情倔强 ， 又主破相 。 
天府若得 『 百官朝拱 』 ， 倘辅弼 、 昌曲 、 魁钺华集 ， 可至十胎 。 更见桃花 ， 则子 
女在十人以上 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天府 ， 若对宫 [ 廉贞 七 杀 ] 化忌 ， 有煞 ， 主生 产时需动手术 。 
丑未天府 ， 见辅佐单星 ， 决主有两重子女 。 亦主外 室先生女 。 亦主外室先生女 ， 
正室先生子 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫天府守子女宫 ， 对宫武曲化忌 ， 则 防子女伤 残 ， 或有意外 。 有煞者更确 。 
若武曲化禄 ， 天府见吉曜 ， 则主子女宜从事财经 、 贸易 ， 可由此方面善于培养 。 
亦主亲近自己的晚辈有这方面的才能 。 
卯西宫天府见禄存同度或对拱 ， 如同时见财荫夹的 天相 ， 则主子女能承受自己 
的产业兴家 。 
卯 酉宫天府若府库空露 ， 若更会刑忌夹的天相 ， 常 主子女倾家 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥富天府 ， 最嫌空劫同度 ， 亦嫌陀罗同度或朝拱 ， 主子女际遇坎坷 ， 宜善加 
培育 ， 改善 其性格 。 
巳亥天府若见吉化 、 吉曜 ， 或府库充盈 ， 则子女必 能独当一面 ， 宜发展其组织 
力及领导力 。 
巳亥天府与火铃同度 ， 子女宜离家发展 。 株守于出 生地 ， 则反不得意 。 
巳亥天府与禄马同度或对拱 ， 亦主子女于外埠或外 国发展得成巨富 。 
天府坐子女宫 ， 一般以对宫 ， 及天相 、 破军所踞宫 垣 ， 为流年大运吉凶克应的 
枢纽 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守子女宫 ， 一般主先生女 ， 后生子 ； 或主发妻 先生女 ， 外室 、 继室先生子 。 
太阴在庙旺宫垣 ， 夜生人 、 上半月生人 ， 子女数目 均多 ， 主五至八人 。 若曰生 
人 、 下半月生人 ， 则 为三至五人 。 
太阴在陷宫 ， 夜生人 、 上半月生人 ， 子女数目可有 三人 ， 若日生人又为半月生 
人 ， 则以先招祀子或外室先生子为宜 ， 然后始主得子 。 
太阴守子女宫 ， 见煞忌空劫刑耗诸曜 ， 则子女有刑 克 。 以日生人 、 下半月生人 
为最重 ； 夜生人 、 上半月生人则 轻 。 
太阴庙旺 ， 见禄 ， 主子女富有 ； 落陷 ， 则主 子女软弱 。 庙旺见昌曲等科文诸曜 ， 
主子女聪明 ； 见魁钺及三台八座 、 恩光天贵等科名诸曜 ， 则主 ： 子女贵显 。 见辅弼 ， 
则主子女有助力 。 
太阴与火铃同度 ， 更见天机 ， 子女决主离乡背井 。 亦主多病 。 
太阴落陷而见吉化吉曜 ， 则子女虽佳 ， 但终嫌欠领 导力 。 宜后天予以抚育栽培 。 
太阴落陷 ， 禄存同度 ， 则仅得一子 。 煞重 ， 则宜庶 室或外室生子 。 
太阴与桃花诸曜同度 ， 多女少子 ， 落陷且见火铃 ， 则或主有女无子 。 
太阴独坐子女宫 ， 以太阳 、 巨门 ： 天同及本宫为流 年大运吉凶克应的枢纽 。
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """太阴在卯酉宫 ， 若桃花诸曜重重 ， 则子女易受异性 青眼 ， 须防有感情困扰 。 
卯酉太阴 ， 若天同化忌拱冲 ， 火铃同度 ， 又见阴煞 、 大耗 、 天虚 、 天月 、 病符 、 
沐浴等曜 ， 则防子女弱智 。 怀孕之年 ， 以流年子女宫不见煞忌刑耗空劫为宜 。 
卯酉太阴 ， 若太阳带煞忌来会 ， 又见天月虚耗姚刑 诸曜 ， 或更见文曲化忌来会 ， 
则主子女吸毒 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌太阴 ， 若天机化忌 来会 ， 则主多小产流产 。 
辰戌太阴对宫太阳 ， 各躔文昌或文曲 ， 则子女聪明 而且贵显 。 唯昌曲有一化忌 ，
更见虚耗空劫天月 ， 则亦主子女软弱 ， 且有吸毒倾向 。 
辰戌太阴亦不喜见天同化忌 ， 主子女少小离家 ； 见 煞 ， 且主从此少见面之期 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥太阴主子女易受情困 。 
巳富太阴见煞忌重重 ， 子女多灾病 ， 或有刑克 。 亥 宫虽不怕化忌 ， 亦宜头胎生 
女 。 生子则多灾病 。 
巳亥太阴若太阳天梁带吉来会 ， 则子女聪明贵显 ； 带煞及虚耗天月 ， 则仍主子 
女有吸毒倾向 。 此等分别往往相当微细 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼在子女宫 ， 与桃花诸曜同会 ，。 正室无子 ， 但有 女 。 庶室或外宠则生子 。 
贪狼在子女宫见桃花 ， 又见辅弼单星主有赘婿 。 人 庙会吉 ， 则赘婿与庶生之子 
和好 ； 若落陷会煞 ， 则赘婿与庶生之子不和 。 
贪狼在子女宫 ， 见吉 ， 主父子和好 ； 若见煞忌则父 子不和 。 
上述情形 ， 可灵活运用于晚辈人际关系的推断 。 如正室生女 ， 庶室生子 ， 可表 
征为直接下属人手不足 ， 需向别部门借调 。 
贪狼与火铃同度 ， 主 两代感情起初融洽 ， 至后来却 冷如冰炭 。 并不主子女暴发 。 
贪狼与火铃同度 ， 却又会羊陀 、 空劫 ， 则主小产 ； 更见刑耗 ， 主动手术生产 。 
贪狼与辅佐吉曜同度 ， 主子女数目增加 。 见辅佐单 星 ， 主有外室或继室所生之 
子女 。 
贪狼化忌在子女宫 ， 亦主有外室生之 子 女 。 见煞 ， 正室生者易小产 。 
凡贪狼坐子女宫 ， 以阴 、 阳 、 机 、 巨四垣 ， 为流年 大运吉凶克应的枢纽 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """贪狼在子午 ， 主子女四人 ， 中有二子 ； 见辅佐诸曜 可增加 。 见桃花多则仅能得 
三女一子 。 子女且嫌易流为骄奢 。 
子午宫贪狼与蜚廉同度 ， 见煞而无禄 ， 主子女浪费 。 
子宫贪狼 ， 入 『 泛水桃花格 ] 者 ， 主多生女 ， 或头长 为女 。 并不主子女多桃花 。 
午宫贪狼见吉曜 ， 为 『 木火通明 』 ， 往往头长生子 。 亦不以此厘定子女性格 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫贪狼 ， 主子女仅二人 ， 见桃花及辅佐吉曜 ， 始主子女数目增加 。 
寅申贪狼子女宫 ， 两代有感情 。 较居子午者为厚 。 若会廉贞化忌 ， 则主感情有 
裂痕 。 见煞耗刑曜 ， 则主伤心落泪 。 
寅申贪狼 ， 主子迟得 。 故亦主门生弟子及追随自己 的晚辈迟得 。 若见禄马 ， 则 
四方奔驰 。 故倘辅佐诸 曜华集 而见禄马 ， 又往往为桃李遍天下 。  """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫贪狼主仅得一子 ， 子女则共三人 ， 见辅佐桃 花 ， 则有异胞子女 ， 子女数 
目亦因此增加 。 
辰戌贪狼武曲化禄 ， 又见煞 ， 主中年以后与子女离别 ， 甚至从此天涯 ， 至老方 
见 。 
辰戌贪狼对武曲化忌 ， 煞重 ， 主子女刑克 。 煞轻 ， 同时又见吉曜 ， 主子女有病 ， 
或需动手术 。 
辰戌贪狼与火铃同度 ， 与子女感情 ， 在其中年以后渐成陌路 ， 或在其幼年即见
分离 。  """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门临子女宫 ， 绝非善曜 ， 盖巨门能遮蔽其他星曜 的光辉 ， 唯入庙的太阳 ， 光 
芒万丈 ， 始不受巨门的影响 。 所以一般情形下主头胎有损 。 太阳入庙同度或拱照 ， 
见煞 ， 仍主损长子 ； 无煞 、 见吉 ， 然后头长平安 。 
巨门与太阳同度或拱照 ， 以太阳居寅宫为佳 ， 会吉 则主子女多才 ， 能发展为专 
业人才 ， 唯必带 [ 口舌以求 的性质 。 
巨门与天机同度或拱照 ， 主两代各怀巳见 、 各有机 心 。 视煞曜会合的程度而定 
其轻重 。 须两代分离然后始可化解 。 
巨门与天同同度或对拱 ， 会煞 ， 主子女孤单 ， 防子女意志薄弱 。 更与辅弼同度 ， 
主亲子不得力 ， 庶子或祀子反得力 。 现代又可视为女婿得力 。 
巨 门 化忌 ， 主口舌 ， 见煞 ， 则此口舌且往往带有伤 心流泪的性质 。 故应详细推 
断后运 ， 以视事端的 发展 ， 及推断其细节 ， 以谋事前补救 。 
巨门尤忌羊陀 。 主得子迟 ， 或主得子有刑克 。 若火 铃 、 空劫同度 ， 则仅主体弱 
多病 。 
巨门与入庙的太阳同度或相会 ， 见辅佐吉曜 ， 或见 吉化 ， 则不特子女众多 ， 而 
且主能富贵 。 在现代 ， 往往专业人才 。 
巨门在子女宫得禄 ， 即能减少其孤克之性 。 
凡巨门在子女宫 ， 以廉贞 、 贪狼 、、 天同各垣 ， 为流 年大运吉凶克应的枢纽 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午巨门 ， 成 『 石中隐玉 ] 格者 ， 往往主得子迟 。 或 子女以晚得者为佳 。 
子午巨门化禄最吉 。 见禄则虽不刑克却主子女自 私 。 见对宫天机化禄 ， 子女每 
易离乡发展 ， 若天机化禄 ， 则有流产小产刑克 。 与晚辈关系亦可同推 。 
子午巨门若与 擎羊同度 ， 长子难养 。 
子午巨门 ， 主子女三人 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌巨门 ， 子女三人但有刑克 。 成 [ 反背 ] 格局者 ， 则子女众多 ， 但感情仍主隔 
膜 。 
辰戌巨门与煞忌空劫刑耗同会 ， 则刑克甚重 ， 且主 两代不和 。 与晚辈更易恩反 
成仇 。 
辰戌巨门见煞曜重 ， 宜招祀子 ， 或长子长女宜过继 他人 。 最不宜踞陀罗 ， 主为 
子女担心 ， 此或主童年灾病 ， 或主子女成人后之意外灾难 ， 常驻于巨门本宫或 【 廉 
杀 】 宫垣克应 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥巨门 ， 以亥宫为佳 。 巳宫每主刑克 ， 煞轻亦主 感情隔膜 。 
巳亥巨门最喜太阳吉化来会 。 日生人尤佳 。 则宫度 祥和 ， 不特无刑克 ， 而且主两 
代感情和洽 。 若太阳化忌 ， 或煞忌重重 ， 则刑克生离 ， 或有代沟 。 与晚辈关系同此 
推断 。 又常生为子女或晚辈化耗精神 、 ‘ 金钱 ， 而结果仍不佳 。 
巳亥巨门与空劫同度 ， 子女孤单 。 或主中年生离 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守子女宫 ， 一般主子女二人 。 若与吉化 、 吉曜 同会 ， 则子女可增至六人 。 
见煞则克至单数 。 
天相与昌曲同度 ， 辅弼夹 ； 辅弼同度 ， 昌曲夹 ； 或 昌曲 、 辅弼齐夹 ； 或昌曲恶 
化而辅弼来会 ； 或辅弼夹而昌曲来会 ， 又不见煞忌 ， 亦无刑忌夹 、 火铃羊陀夹等情 ， 
往往主得孪生予女 。 
天相守子女宫 ， 与煞忌刑耗电量同会 ， 主 刑 克 。 再 会辅弼单星 ， 发妻生者 ， 头 
三胎有损 ， 外室继室生青 头 胎有损 ， 唯仍主先得子 。 
天相所会的天府 ， 若属府库充盈 ， 则天相虽不会吉曜 ， 亦主子女五人 。 若府库 
空露 ， 不特子女性质不佳 ， 而且亦刑克 。 
天相与武曲同度或对拱 ， 巳主子女少 ， 若更见煞 、 化忌 ， 则主刑克孤单 。 氩立 
祀子 ， 或偏房继室生子 。 亦主晚辈反叛 。 
天相见昌曲化忌 ， 往往主子女见双留单 。 
天相与紫微同度或对拱 ， 主子女三人 。 见吉 ， 子女 秀 发 ， 富同情 心 ， 但仍主观 ， 
且爱恶随心而强烈 。 若与廉贞同度或对拱 ， 则仅主二人 ， 吉则子女为行政人才 ， 凶 
则刑克 ， 且主代沟 。 
天相守子女宫 ， 若为财荫夹者 ， 则发妻可先得子 ； 若为刑忌夹者 ， 发妻头胎生 
子者则主难养 。 
则荫夹印 ， 主两代感情融洽 ； 刑忌夹印 ， 主两代感 情冰炭 。 见吉曜 ， 则财荫夹 
印者亦主子女宜从政 ， 或任职企业行政主管 。 若刑忌夹印而见凶曜 ， 主子女刑克或 
破家 。 更宜详备大限子女宫 ， 而厘定其是否同时亦主受晚翠拖累而致损失 。 
子女宫财荫夹而见天巫 、 禄存或化禄同度 ， 主 子女可得丰厚遗产 。  
天相在子女宫 ， 常以刑忌夹 、 财荫 夹 ； 或府库充盈 、 府库空露 ， 以及廉贞 、 武 
曲 、 破军躔度的宫垣 ， 为吉凶克应之斯 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未天相 ， 若 见吉 ， 或吉曜夹 ， 子女亦可成才 ； 但主先生女 。 见煞忌 ， 或刑忌 
夹 ， 则有刑克 、 不和等情 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉天相 ， 见煞 ， 常主感情不能融洽 。 廉贞化忌 ， 且主为子女晚辈伤心流泪 。 
卯西天相 ， 桃花重重 ， 亦主偏房继室生子 ， 而发妻 则生女 。卯酉 、 巳亥天相 ， 煞忌刑重 ， 见火铃或空劫同度 ， 主子女离家始吉 。 倘阴煞 、 
天虚 、 大耗 、 天刑同踞 ， 又主子女遇意外或自杀 。 往往以武曲 、 廉贞化忌在子女宫 
之流年大运为克应 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥天相 ， 见煞 ， 主子女有叛逆性格 。 故其中必有 缘故 ， 宜详各流年大运加以 
观察 。卯酉 、 巳亥天相 ， 煞忌刑重 ， 见火铃或空劫同度 ， 主子女离家始吉 。 倘阴煞 、 
天虚 、 大耗 、 天刑同踞 ， 又主子女遇意外或自杀 。 往往以武曲 、 廉贞化忌在子女宫 
之流年大运为克应 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁在子女宫 ， 须视太阳庙陷而定其吉凶 。 若太阳 在庙旺之宫同会 ， 则可减其 
孤克之性 ， 主得子二三人 ； 若太阳征陷宫则以先生女为宜 ， 主得子二人 。 
天梁同会辅 『 左吉曜对星 ， 或禄 、 权 、 科占化 ， 主子 女五至九人 ， 视所会星曜
对数而定 。 且主子女成才 。 
天梁与天机同度或对拱 ， 于大运或流年子女宫不吉 时 ， 每每流产 、 小产 。 
天梁在子女宫见煞忌刑耗诸曜 ， 以得子迟为宜 ， 或 甚至主祀继 。 宜先生女 ， 头 
长子多灾病意外 。 煞重 ， 又踞 空劫 ， 或夹煞曜 ， 则子息孤单 。 
天梁见吉化吉曜 ， 亦主手下人众多 ， 且得力 ， 唯若 同时见煞 ， 则亦主手下人可 
能对自己不利 。 须详各大运 、 流年而定 。 往往于武曲 、 天机 、 巨门各垣克应 。 
天梁在子女宫并非不克子 ， 唯必有子送终 。 
天梁天同同度或对拱 ， 见辅弼 、 昌曲单星 ， 又见桃 花 ， 主庶出一子 。 桃花重重 ， 
或见天姚 、 沐浴之类 ， 则亦主私生子 。 
天梁天同 ， 主先生女 ， 见吉三人 ， 不见吉一二人 ； 天梁天机 ， 见吉二人 ， 不见 
吉一人 ； 梁太阳 ， 见吉七人 ； 不见吉五人 ( 三子二女 ) 。 在现代 ， 可由子女数目的意 
义 ， 推断亲近自己的晚辈 ， 为多为寡 。 
天梁虽亦忌火铃 ， 但却最忌羊陀 。 羊陀同度主子女 灾病意外 ， 火铃同度仅主子 
女庶出或继祀 ， 或子女离家 。 空劫同度 ， 亦影响子女数目减少 。 以上六煞夹天梁者 
同断 。 
天梁在子女宫 ， 以巨门 、 天机 、 太阳诸垣 ， 为吉凶 克应的枢纽 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫天梁 ! 子宫较佳 ， 一般主得子二人 ； 午 宫 先 生女 ， 且仅一子送终 。 
子午宫天梁 ， 均须防子女因强出头而惹祸 。 见吉曜 吉化 ， 又须防子女气高横破 。 
见昌曲主聪明 ； 更见龙池凤阁则必为专业人才 。 
子午天梁会太阳化忌 ， 子女宜从事法律 、 医药 、 社 会工作 ， 即以 救助为一生事 
业 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """丑未天梁亦防小产 。 天机化忌 ， 则主流产 。 倘同时 又见吉曜 ， 则生产时有灾 难 
惊 险 。 若见煞刑诸 曜 ， 始主刑克长子 。 
丑未天梁 ， 煞曜同度 ， 子女宜学习工程或工艺 。 在 现代又往往为电讯 、 电子 、 
电脑工程 。 
丑未天梁子女固不多 ， 亲近的晚辈亦不多 ， 或主得 力者易难 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天梁主先生女 ， 得子仅一人 。 见火铃同度 ， 或 会禄马 ， 子女离乡 。 
巳亥天梁见煞忌刑凑合 ， 宜继祀外子 。 同时见一对 吉曜 ， 又见天巫 ， 往往为外 
室 、 庶室所生之子承家 ； 亦主女婿承家 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀在子女宫主子女少 ， 纵使见辅佐吉曜 ， 亦不主 增加儿子 的数目 。 唯见桃花 ， 
又见禄 ， 则主女儿有三四人 。 
七 杀守子女宫 ， 以先生女后生子为佳 ， 可减少刑伤 。 倘煞忌邢耗空劫诸曜齐会 ， 
则主无子 ， 若有 ， 则须防因子破家 ， 或带伤残 。 
七 杀守子女宫 ， 见空曜 ， 又见华盖 、 昌曲 ， 但不见 吉化 ， 则主子女有遁世的思 
想 。 
七 杀守子女宫与化忌同会 ， 主子女多灾病 ； 更与空 劫同度而不见华盖 、 昌曲 ， 主
子女破败家财 。 
七 杀与紫微化权同度者 ， 得子三人 ， 但性格极刚 ， 除非辅佐吉曜凑合 ， 否则不 
主跨灶 。 与紫微化科同度者 ， 可辅佐诸曜 ， 则必成大器 。 
七 杀人庙 ， 见辅佐吉曜对星 ， 主子女成才 。 唯以 极 迟得子 ， 或先女后子 ， 然后 
始主有子克家 。 见辅佐诸曜单星 ， 则主继室或外室生子 。 亦主成器 。 
七 杀在子女宫虽主子女少 ， 唯若本身命宫见辅佐诸 曜或为紫微 、 天府等主星见 
『 百官朝拱 』 ， 则仍主自身下 属众多 ， 仅门生弟子 ， 及追随自己的晚辈稀少 。 
七 杀独坐 ， 见煞忌刑耗诸曜 ， 往往子息艰难 ， 甚书 无子 ， 但绝不宜招外子 ， 恐 
反招叛逆 。 与晚辈的关系亦同此推断 。 
七杀在子女宫 ， 所对的天府 ， 其为府库充盈 ， 或为 府库空露 ， 可用以推断子女 
享受父母财禄的程度 。 
七 杀在子女寓 ， 以武曲 、 廉贞 、 天府 、 天相诸垣 ， 为流年大运吉凶克应的枢纽 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫 七 杀 ， 喜武曲化禄朝拱 ； 甚嫌化忌 ， 往往主 伤残 ， 煞轻则主动 手术生产 ， 
又主头胎流产 。 
子午宫 七 杀若会破军化禄 、 贪狼化忌 ， 主外室生子 ， 又主子女有挫败影响家业 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫七杀 ， 若见辅佐吉曜 ， 子女亦可三四人 ， 唯 仍以先生女为佳 。 同时见煞 ， 
亦主自己提拔的人反叛 。 
寅申七杀 ， 子女倔强 ， 孤立 ， 须注意培育 ， 特别须 注意训练其处理人际关系 。 
寅申七杀 ， 主晚辈踞傲 ， 不受驾驭 。 于提拔亲信时 务须留意 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫七杀 ， 气质较为纯和 ， 宜见昌曲 ， 则可培养 为理工人才 。 
辰戌 七 杀以戌宫为佳 。 辰宫者主得子迟 ， 否则恐多 灾病 。 见廉贞化忌者尤劣 。 
辰戌 七 杀见 吉曜吉化 ， 子女宫白手成家 。 见煞忌刑 耗则多刑克 ， 或因理想过高 
而致倾败 。  """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军居子女宫 ， 头胎生子必有事端 。 或破相 、 或口 吃 、 或难产 、 或不足月生 、 
或流产 、 或出祀过继 ， 或详实际星曜组合而定 。 
故破军居子女宫者 ．， 以头胎生女为宜 。 见辅佐单星 ， 则主继室或偏房生子 。 若 
更见昌曲 、 桃花诸曜 ， 则主女婿入赘 。 
破军火星同度 ， 主父子分离 。 破军在寅申宫者 ， 如 自己命宫见火铃 ， 亦主两代分 
离 。 
破军会煞忌刑曜 ， 主刑克 。 或纵 有 子亦无靠 。 
破军坐子女宫 ， 若会武曲化忌 ， 化铃 、 空劫照会 ， 则得子可能有残疾 。 
破军必与天相对拱 ， 天相为财荫夹 ， 或为刑忌夹 ， 对子女宫皆有影响 。 
破军得禄 ， 煞轻 ， 则子女有惊险灾病 ， 但终能化解 。 亦主子女可白手兴家 。 
破军化禄 ， 煞重 ， 则往往主发妻生子难养 ， 须继室 或庶室生子 。  
凡 破军在子女宫 ， 大致以天机 、 天同 、 廉贞 、 武曲 ， 为大运流年吉凶克应的枢 
纽
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫破军 ， 见辅佐对星 ， 主子女三人 。 唯个性 强 ， 易有代沟 。 与晚辈的关系 ， 
宜注意调和 。 但主门下出佳子弟 。 
子午破军见廉贞化禄 ， 则两代情深 。 
子午破军见廉贞化忌 ， 则主中年时子女多灾病 。 煞 重且主意外 。  """
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫 破军落陷 ， 子女稀少 ， 或且主继宜外室生子 。 火铃 、 空劫同度 ， 则主子 
女少小离家 ， 或过继出祀 。 
寅申宫破军见武曲化禄 ， 或破军本身化禄 ， 亦主破 家而后成家 。 须详察星盘有 
何事端发生 。 
寅申宫与武曲化忌对拱 ， 煞重 ， 子女有刑克 ； 或主 子女倾家 。 须兼视本身各大 
限流年而推断 。 与晚辈关系 ， 亦同此推断 。"""
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫破军 ， 见辅佐吉曜主三人 。 见煞 ， 仅得一子 。 见吉者得力 ， 见煞者不得 
力 。 
辰戌破军为见禄 ， 即使煞少 ， 往往亦主长子长女体 弱 ， 先天不足 。 
辰戌破军若逢禄马 ， 主子女浪荡 。 不主离乡背井成 家 。 """
            print(tmp)
            print("\n")
        
def GongXia5th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守财帛宫 ， 在最好的情形下 ， 亦仅主财源充裕 ， 并不主能积聚 。 盖紫微偏 
重于名誉与权力 ， 不是财星 。 
紫微化权守财帛宫 ， 见煞 ， 因同时必见武曲化忌 ， 故绝不主富厚 ， 除非从事 『 持 
利器以求财 』 的行业 ( 如外科 、 牙科 、 饮食业 、 理发业之类 ) ， 否则反主场面似乎丰 
裕 ， 实 际却支绌周张的情形 。 
紫微化权不见煞 ， 反见 『 百官朝拱 』 ， 则金钱方面易 得他人支助 ， 命宫为 [ 廉贞 
天府 ] 者 ， 亦主可掌财权 。 
紫微化科 ， 则宜凭名誉 、 商誉以求财 。 得 [ 百官朝 拱 ] 者尤然 。 见煞 ， 不过声誉
减等 ， 或范围缩小 。 
紫徽喜与禄存或化禄同度 ， 或对拱 ， 则可改变其外 表充裕 ， 成为内在充实 ， 化科 
化权的紫微尤宜 。 
凡 [ 紫破 ] 、 [ 紫贪 ] 、 『 紫杀 』 皆主骤发骤败 ， 但其间亦 有区别 ，『 紫破 』 之败 ， 
必因发后又妄图开创所致 ； 『 紫贪 』 之 败 ， 必因发后即浪费金钱所致 ， 『 紫杀 』 之败 ， 
则在于环境忽 生变动 。 故三者以 『 紫杀 』 较难由当事人主动趋避 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "紫薇"):
                tmp = """ 紫微与火星同度 ， 居子午宫 ， 因与贪狼相对 ， 故亦 主一 时横发 。 或对宫贪狼成 『 火 
贪 』、 [ 铃贪 ] 格者亦然 。 除 非 命宫或事业宫有吉化 、 吉曜 ， 否则难以久长 。 
子午宫紫微在财帛宫 ， 有左辅右弼同会 ， 主财源来 自多方面 。 余宫紫微减等 。 
亦主时时可得别人在财帛上加以支持 、 供应 。 
若对宫贪狼化忌 ， 本宫紫微吉煞交集 ， 则受人供应 金钱 ， 必带有相当交换条件 ， 
甚至可流为贪墨 。 
子午紫微为 『 孤君 』 者 ， 主进财艰辛 ， 若 『 在野 』 ， 即 为重重煞刑耗曜在三方四 
正包围 ， 则主挥霍 ， 纵一时横发亦不能久存 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """丑未宫 [ 紫微破军 ] 在财帛宫 ， 主一生必可得一次意 外财 。 以程度言 ， 未宫优于 
丑宫 ； 见吉者性质优良 ， 见煞 者则带凶险性质 。 唯得意 外财后 ， 必于流年经行至丑 
或未宫时 ， 即生极大破耗 。 若有空劫同度 ， 破耗后较得财前更贫困 。 
丑未宫 【 紫微破军 】 而破军化禄者 ， 若掌财权 ， 则易 贪墨 。 或主贪图侥幸 ， 犯 
险冒难以得偏财 。 
． 若破军化权 ， 对主运用金钱的能力强 ， 经波折而成 富 。 一一故在财帛宫 ，【 紫 
破 】 之破军化禄不如化权 。 唯二者皆主挥霍 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """寅申宫 【 紫微天府 】， 需视有禄无禄以厘定其吉凶 。 若有禄 ， 煲唾可积聚而成富 ， 
无禄 ， 则不外充足而已 ； 倘无禄有煞 ， 或且见空劫 ， 则仅主表面风光 ， 且常易因求 
财反生破败 。 
【 紫微天府 】 仅主 积蓄致富 ， 故与 【 紫微破军 】 不同 ， 在保守社会 ，【 紫府 】 较 
佳 ， 在进取社会 ， [ 紫破 ] 则较佳 。 唯 【 紫破 】 于发后须采取保守态度 ： 防再见破耗 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """卯 酉 宫 『 紫微贪狼 』 亦主骤发 ， 若紫徽化科 ， 则财来 较悠久 ， 若贪狼化禄 ， 剥 
财来较急骤 ， 然而亦隐藏破耗之机 。 
『 紫贪 』 有 『 百 官朝拱 』 ， 则 主可发财 而非 暴发 ； 若 『 在 野 』 或 『 孤君 』 ， 则仅 
主贪财 ， 可能不择手段 。 
『 紫贪 』 与禄存同度 ， 见空劫者 ， 主暴败 。 若火铃同 踞 ， 暴发暴改尤速 。 然有 
火铃而无空劫 ， 则 尚可图补救 ， 于 发后持盈保泰即可避免 。 
『 紫贪 』 为火铃者 ， 亦主骤 发 。 夹贪狼化禄 ， 则骤发 程度更大 。 尤喜夹紫微化 
科 ， 则骤发且有声誉 ， 或由是建立商誉 。 
『 紫贪 』 在财帛宫 ， 亦主挥霍 ， 时时作无谓交际应酬 。 但贪狼化禄者 ， 却亦能 
因应酬而得财 。 
[ 紫贪 ] 在财帛宫 ， 财源来自多方面 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """辰戌宫 [ 紫微天相 ] 虽吉化吉曜汇集 ， 一生亦必有一 次波折 ， 或呈胶着状态 ， 难 
得寸进 。 必须渡过此段时期 ， 然后始能开运 。 
倘有刑煞忌耗诸曜 ， 则不但时生波折 ， 而且容易因 多意外开支 ， 而致入不敷支 。
[ 紫相 ] 为财荫夹者 ， 可克享父荫 ， 或掌家族财权 ， 克 承父业 。 若为刑忌夹 ， 则 
主祖业凋零 ， 而身 亦常因财源而生压逼感 。 
[ 紫相 ] 有左辅右弼同会 ， 则宜协助他人理财 ， 不宜 积极开展自身事业 。 纵有自 
身事业 。 亦以作为他人之附庸者为宜 。 如代理业务 、 经销业务 、 经纪行业等 。 亦可 
从事服务性专业 。 
唯 [ 紫微天相 ] 同度守财帛宫者 ， 一生亦必有意外之 财 ， 可主突发 。 无煞忌者则 
能储存 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """[ 紫微 七 杀 ] 在巳亥宫 ， 理财胜于积财 ， 故常常事业 广大 ， 而自身积蓄却不相称 。 
这种财帛宫的格局 ， 只宜以企业公司的资产 ， 作为自己的资产 。 
[ 紫杀 ] 与禄存同度 ， 守财能力较大 ， 但易因财失义 。 
[ 紫杀 ] 在财帛 宫亦主能骤发 ， 唯较难持久 。 见煞者尤甚 。 
[ 紫微 七 杀 ] 亦主财帛变动 ， 故如自己经营事业 ， 则必 须详视流年吉凶 ， 以为进 
退参考 。 于逆境时不宜妄动 ， 否则必多破败 。 见禄者则较佳 。 
[ 紫杀 ] 与空劫同度 ， 破败甚速 。 
唯 [ 紫杀 ] 见 [ 禄马交驰 ] 之局者 ， 无煞 ， 在外埠外国 能发 ， 在出生地反多波折 。 亦 
即仅适合离开出生地环境 。 
[ 紫微 七 杀 ] 而紫微化权 ， 尤宜背井离乡 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机在财帛宫 ， 主财帛有变动或波动 。 通常表现为 财来去 ， 难以积存 。 入庙者 
较佳 。 若落陷 ， 则财源稍顺即生变化 ， 或必须劳心费神 ， 腾挪变化然后始能保住财 
源 。 
天机化权 ， 则性质比较稳定 ， 然而仍必须转换财源 ， 表征为转行转业 。 故以自 
由职业为佳 ； 亦宜从事专业工作 ， 则可不改行业 ， 但改变来财之客户即可 ( 例如律师 ， 
不必 固定的客户 ) 。 
天机为计划的星曜 ， 在财帛宫时 ， 亦宜倾向于劳心 以求财 。 
天机化禄 ， 叠会禄存 ， 且有吉曜 ， 则亦可骤发 。 唯 其骤发 ， 必与聪明机巧有关 。 
若化忌 ， 则机关费尽反而财源中断 ， 所谓 『 机深祸更深 』 是也 。 
天机化禄 ， 则气佳 ， 但仍主财源不只一端 ， 会吉曜 ， 主有多方面的财路 。 若吉 
煞交集 ， 则多反复进退 。 
天机化忌 ， 主财运稍顺即遭破坏 ， 打击或排挤 。 必须于逆境时处之泰然 ， 让时 
间澄清一切 ， 表现出泱泱大度 ， 然后始可保泰持盈 ， 安渡逆境 。 
天机化忌者 ， 亦以从事专业为宜 ， 且以劳心费神的 行业为佳 。 
天机擎羊 ， 主劳心的程度更大 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天机"):
                tmp = """子午 宫 天机入庙 ， 必与巨门相对 ， 故主劳心费神 ， 破唇费舌以求财 。 巨门化禄 
者佳 ， 化 忌者劳神费舌的程度 更大 。 
午宫天机 ， 命宫太阴入斋 ； 子宫天机 ， 命宫太阴落 陷 ， 敝子宫不如午宫 。 在午 
宫者焦虑较小亦较少 。 在子宫者 ， 须小情歼朗以应付横逆 ， 且必须不用机开心计 ， 
然后始能扭转命运 。 
子午宫天机若与煞星同度 ， 则主易失机缘 。 又或因 求全求备 ， 追求理想而反致 
误失良机 。 且一生多竞争 ， 以致尽抛心血 。 
子午天机与空劫同度 ， 主机谋失误 。 
子午天机化禄 ， 或禄存同度 ， 表征为钱财流通 ， 故 可从事经纪行业 ， 费唇舌而 
能得钱财流通之利 ， 此亦以与巨门 相对之故也 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天机"):
                tmp = """丑未宫天机落陷 ， 与天梁相对 ， 主机关巧计以求财 。 因此最宜从事费心机计谋 
人行业 ， 如电脑程序 、 市场策划之类 。 倘有天刑 、 擎羊 、 奏书等曜 ， 则宜从事法律 
工作 。 
由于与天梁相对的关系 ， 若天梁化科 ， 则主依靠知 名度而决定财帛的多寡 。 天 
机化禄 、 权 、 科 ， 会昌曲化科者亦然 。 但基天机化忌 ， 或会昌曲化忌 ， 则 往往计谋 
失误 ， 失时便应坦然承受一些失败 ， 作为经验 ， 以助曰后的开运 。 
丑未天机与天梁化禄相对 ， 则必主机关巧计以求 财 。 倘见阴煞 、 天姚 、 天虚同 
度 ， 则计谋的性质更重 ， 遇吉曜 ， 可以得财 ， 倘有煞曜同度 ， 则 主枉抛心力 ， 不如 
随 缘 ， 尤以空劫同度者更 甚 ， 亦不宜独立经商 。 
丑未天机见煞忌刑耗诸曜 ， 主因官司破败 。 故不宜 争讼 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """寅申 [ 天机太阴 ] 同度 ， 见禄存或化禄 ， 宜在财经机 构服务 。 古人认为乃 『 财赋 
之官 』 因为 『 天机太阴 ] 仅主财 经计划 ， 不主求财的行动 ， 是故不宜经商 。 
若太阴化忌 ， 则主关于投资的计划失误 。 此时申宫 又较优于寅宫 ， 即失误的程 
度较小 。 然均不利于经营 ， 只宜服务公职或财经机构 ， 以上市公司最为适宜 。 但仍 
不宜主持实际投资项目 。 
若太阴化禄则主财气丰盈 ， 虽任职亦主收入丰厚 。 天机化禄者 ， 过手的金钱数目 
相当大 。 
『 天机太阴 』 亦 不喜见命宫天梁化禄 ， 故不宜经商 ， 即使任职亦主人缘不佳 ， 
以其事业宫必同时见陀罗与天同同度之故 ， 主事业上多暗争 ， 影响财帛 。 
『 天机太阴 』 最喜与 『 禄马交驰 』 同度 ， 则主发财于 远方 。 故以离开出生地为 
宜 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯酉宫 『 天机巨门 』 ， 主竞争甚重 ， 经手之事每惹人 垂涎 。 见煞忌者尤甚 。 
若巨门化禄 ， 则主得异族之财 。 叠见禄存 ， 尤足以 成巨富 ， 唯必费尽心神 。 
若巨门化忌 ， 则往往功败垂成 ， 枉抛心力 。 此时不 如随缘 ， 或从事竞争较小的 
行业 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """辰戌宫 『 天机天梁 』 同度 ， 机关巧计以求财的意味 ， 与丑未宫同 。 唯因天梁 同 
度 ， 若会吉曜者 ， 则主易得荫庇 ， 故有祖业 ， 故宜从事专业 。 天机化科或天梁化科 ， 
均主名利双收 。
『 机梁 』 不宜化禄 ， 天梁化禄尤主多暗争 ， 每易受人 排挤 ， 故必须劳心费神以 
求财 。 
『 机梁 』 多变动 ， 故见辅弼 、 魁钺者 ， 指财源不只一 端 ， 往往兼职兼业 。 
『 机梁 』 会化忌 ， 无论天同 、 太阴 、 太阳 、 巨门 ， 皆 主是非暗争极重 ， 尤不喜 
太阴化忌 ， 主时时枉费精神 ， 求财手段错误 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天机"):
                tmp = """巳亥宫天机与太阴相对 ， 不宜自行经营 ， 但却可从 事服务性行业 ， 或居间代理 。 
巳亥天机见禄马交驰 ， 以巳宫天机较吉 ， 更宜作外 国公司经纪或 代理人 。 
巳亥天机不主聚财 ， 化吉亦只主增加金钱流通程 度 ， 故亦可从事财经 、 税务 、 
核数工作 。 
巳亥天机与火星同度者 ， 财帛更难积聚 ， 则源亦时 生变动 ， 故不可因一时顺遂 
即理想过高 。 
巳亥天机得禄 ， 并主为人觊觎 ， 以致收入不稳 ， 财 源不久 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳主贵不主富 ， 故太阳守财帛宫者 ， 其财皆凭社会 地位而来 。 因此必须争取 
地位 ， 如利于学术者 ， 应追求较高学位 ； 利于经商者 ， 应追求代理名牌商品 ， 或自 
行创造商标商誉 ； 利于任职者 ， 应积极进修 ， 争取声誉 ， 或凭人际关系创造升职条 
件 。 
太阳主散 ， 太阴主聚 ， 故太阳守财帛宫 ， 除非有太阴同度 ， 否则必主散财 。 散 
财性质可能格于环境 ， 可能为人际关系所逼 ， 亦可能基于自身性格 。 详名星系组合 
而定 。 
一般而言 ， 太阳化禄 ， 乃自身喜散财 ； 太阳化忌 ， 主 受六亲剥削 ； 太阳化科 ， 
乃因追求荣誉而散财 。 唯太阳 化权较为稳定 ， 可以藉人事控制 ，《 乍后天补救 。 
一般情况下 ， 煞星对太阳的影响并不如对其他正曜 之重要 。 换句话来说 ， 太阳 
与四煞空劫同度 。 不过增加困扰与教财的趋向而已 。 倘如命宫星嗣组合吉 ， 强 lj 
仍不乏进 
财之力 ， 并不因煞暖而致贫乏 。 
太阳入庙 ， 情形远较落陷者为佳 。 盖 入 庙 的太阳影 响命宫 ， 社会地位较受落陷 
太阳影响者为高 。 既然太阳居财帛宫 ， 得财多寡决定于社会地位 ， 敖自以财帛寓太 
阳入庙为优胜 。 
太阳主贵 ， 故喜会财星 ， 则富贵绵远 。 然而太阳化 禄亦主散财 ， 因此只有当见 
禄存 、 太阴化禄 、 巨门化禄时 ， 始主富贵 Ⅺ 太阴化禄最吉 ， 亦最宜经商 。 单见禄存 
则远不 如见禄马交驰 。 
太阳守财帛宫 ， 若夫妻宫有聚财之星 、 如天同化禄 ， 或 [ 天同太阴 ] 任一化禄化权 
之类 ， 则财富宜交配偶处理 。 若田宅宫佳 ， 如 『 紫微贪狼 』 而 贪狼化禄 ， 则可籍置 
业以聚 财 。 此为利 用星曜性质 ， 作后天补救 。 
太阳守 财帛宫 ， 吉煞交集者 ， 每主事业空虚不实 ， 表面风光 ， 而内在周绌 。 此 
可藉后天人事匡正 ， 必须脚踏实地 ， 不滥用声誉 ， 然后始得改变 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "太阳"):
                tmp = """子午 宫 太阳 ， 必与天梁相对 ， 午宫因优于子宫 ， 唯 因天梁的影响 ， 主爨的程度 
甚大 ， 因此必须凭声誉地位以求财 。 子宫太阳落陷 ， 不过花耗精神而已 ， 故尤宜进 
行联苦学术研究 ! 或以解决难题 ( 如医治危症 、 重 症 ； 或济 困扶危的社会服务 ) ， 作为 
一己的财源 。 
子午太阳守财帛宫 ， 能成 『 阳梁昌禄 』 之格 ， 必 有 专 业地位 。 唯行富声名较大 
于子宫 。 
子宫太阳见煞忌空劫 ， 则花耗精神甚大 ； 午宫者较 小 。 
子宫太阳见吉化 、 吉曜 ， 虽主富贵 ， 然不如午宫者 远甚 。 午宫太阳居财帛宫 ， 
若日生人 ， 又有吉化吉曜 ， 且见禄 ， 则主既富且贵 ， 权势及财权皆倾动一时一地 。 
子午太阳守财帛宫 ， 唯不喜天梁化禄 ， 盖益主贵而 不主富 ， 稍多进益 ， 即有时 
非尤怨谣忌 。 
现代社会 ， 子午太阳亦喜经营名牌 ， 或藉广告创造 的商誉 ， 见科文诸曜者尤然 。 
但另一方面 ， 又可转为自身经营传播 、 广告 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "太阳太阴"):
                tmp = """丑未宫 『 太阳太阴 』 同度 ， 基本性质主先散后聚 。 尤 以丑宫者 ，『 后聚 』 的力量 
大 于 未 宫 。 夜生人又优 于日 生人 。 
太阳太阴同守财帛宫 ， 见辅弼 、 魁钺 、 昌 曲者 ， 不见煞忌 ， 主 富而且贵 。 唯必 
须自手兴家 ， 虽有祖荫亦不克 享 。 太阴化渌者富多于贵 ， 太阳化禄者贵多于富 。 前 
者在丑宫较利 ， 后者在未宫者较优 。 
【 太阳太阴 】 而太阴化忌 ， 主因事业浮夸 ， 妄事投资 而引致损失 ； 若太阳化忌 ， 
则主因虚名而受拖累 。 见煞刑诸曜 ， 尤主由是引起是非 ， 甚至因此涉讼 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "太阳巨门"):
                tmp = """寅申宫 [ 太阳巨门 ] 同度 。 太阳化权 ， 巨门化禄者 ， 主受异族提拔得财 。 亦主凭 
口舌以得财 。 无吉化 ， 有禄马交驰亦可 ； 太阳化禄亦有此种征兆 ； 唯财易因出手阔 
绰而散去 。 
寅申宫太阳化忌者 ， 必主受人拖累 ； 巨门化忌者 ， 则主引致官非词讼 。 更见煞 
耗空劫 ， 则主因此负债 、 破产或倒闭 。 
若见巨门化忌而煞不 重者 ( 主要为不见空劫及铃 星 ) ， 则主以口舌以求财 。 例如 
经纪人 、 教师等 。 
【 太阳巨门 】 纵使见吉化 、 吉曜 ， 亦主财由自身创立 ， 不主得现成产业 。 亦主 
必须竞争而后得 。 见煞忌者 ， 竞争尤剧 。 煞忌交集 ， 必须任劳任怨以求财 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "太阳天梁"):
                tmp = """卯酉宫 [ 太阳天梁 ] 同度 ， 成 [ 阳梁昌禄 ] 格者 ， 由社 会地位决定其财富之多寡 。 
倘见文曲化科者 ， 太阳必同时化权 ， 又得借会巨门化禄 ， 尤主既贵且富 ， 权力与财 
富皆令人艳羡 。 
卯 宫 [ 太阳天梁 ] 即使不见煞忌 ， 亦主争 产争财 。 唯 见吉化及禄存 ， 财帛却优于 
酉宫 。 
卯酉宫 『 阳梁 』 纵有吉化 ， 如大运财帛宫见忌星 ， 又 与空劫同会者 ， 此大运即 
为财帛困乏之期 。 若无此大运 ， 则于流年见同样情形时亦克应 。 
『 太阳天梁 ] 最不喜空劫 ， 主虚空不实 ， 表面浮华而 内在困乏 。 太阳化禄 、 化科
者浮华更甚 ， 天梁化禄者亦主有隐忧 。 唯太阳化权者较稳定 ， 天梁化科者清贵 ， 精 
神享受多于物质享受 ， 而其物质享受亦由名誉而来 。 
然而成 『 阳梁昌禄 』 格者 ， 见空劫同度 ， 却往往为发 明创造的因素 ， 可藉此进 
财 。 
『 阳梁 』 而太阳化忌 ， 主财源不稳 ， 亦主因受人拖累而 破败 。 会巳宫太阴化忌 ， 
亦为破败之兆 ， 亥宫太阴化忌则反主能突破环境以得财 ， 如商誉突然建立 ， 学术上 
有所突破之类 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "太阳"):
                tmp = """辰戌宫太阳与太阴相对 ， 一般情况下 ， 辰宫优于戌 宫 ， 唯太阴化禄者 ， 却以戌 
宫为佳 。 
戌宫太阳 ， 目月反背 ， 唯见吉化吉曜者 ， 反成奇格 ， 主经艰苦而确立事业 ， 财 
帛亦由是而来 。 少年时期艰苦者 ， 中年后名利尤大 。 
辰戌太阳喜魁钺夹 ， 主有人提拔 。 若火铃夹者 ， 则 主财易散难聚 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "太阳"):
                tmp = """巳亥宫太阳独坐对巨门 ， 亦宜是非口舌以求财 。 可 参考寅申宫 『 太阳巨门 』 同 
度的情形推断 。 
唯亥宫太阳落陷 ；， 极不宜 见煞忌 ， 否则仅能艰苦渡 日 。 日生人尤甚 。 
巳亥宫太阳见禄马交驰 ， 主远离出生地以求财 。 在 巳宫者 ， 见吉曜必能富裕 ； 
在亥宫者 ， 见吉曜主受异性提携 ， 唯仍难成富局 。 
巳亥太阳守财帛宫 ， 必主多理想而欠财力实现 ， 以 致理想挫折 。 巳宫者较吉 。 
巳亥太阳 ， 吉煞交集 ， 则必须凭口舌以生财 。 若见 科文诸曜 ， 亦能富贵 。 
巳亥太阳喜巨门化禄拱照 ， 则受异邦人赏识 ， 由是 提高社会地位 ， 财源亦因之畅 
顺 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为财星 ， 主求财的行动 ， 故必先有事业然后有钱 财 。 一般而言一最利经商 ， 
但有 时亦利于从事专业 。 唯必缺少父荫 ， 须藉一己之力开创 。 
因武曲擅长于行动 ， 所以亦长于以钱赚钱 ， 一般很 少会安于任职 。 唯 『 武曲天 
相 』 者有时例外 。 
武曲化禄 ， 或与禄存同度 ， 不见煞忌刑曜 ， 必可成 巨富 。 克应之 期 ， 多在财 星 
叠禄的 大 运 。 唯原 局 若 同 时 见文曲化忌者 。 则多损失 。 
武曲为金属之星 ， 敝亦宜从事与金属何关的职业 ， 如手术 、 妇产科 、 牙科 、 机 
械工 程等 。 古 代的通货亦为金 属 ， 如银两 、 铜钱之类 ， 故当武曲化禄 、 极 、 科时 ， 
亦为从事财政经济 、 金融企业的表征 。 若又见煞 ， 则倾向于工程技术等专业 。 
武曲化 忌 ， 主周转困难 、 失业 、 破产之类 ， 视同会 煞曜凶 星多寡而定 。 最不宜 
见地劫 、 地空 、 天删 、 大耗 、 天 超等曜 。 
武曲踞寡宿 ， 男命 ， 主财权落于妻手 。 
武曲踞孤辰 ， 主白 手兴家 。 
武曲与龙池凤阁同度 ， 主以金属工艺兴家 ； 更见天 月 ， 则为利用金属器械的医
疗人才 。 若见天刑 ， 亦可为军警保安人员 ， 唯必须无煞曜同寓始合 ， 若有 ， 则为持 
利器之下等行业 ， 如屠宰 、 肉贩 、 理发之类 。 
武曲踞擎羊 ， 为刑法 ， 然亦主竞争 ； 踞陀罗为阻滞 。 最不宜兼踞火星 。 古人有武曲火铃同寓 ， 因财被劫 ，『 武 曲羊陀兼火宿 ， 丧命因财 』 的说法 。 
『 铃昌 陀武 ， 限至投河 』 ， 在财帛宫主 重大倾 败 。 一 － 所谓 『 铃昌陀武 』 ， 即武 
曲与文昌 、 铃星 、 陀罗同度或相 对 。 若原局有 【 铃昌陀武 】 的结构 ， 但非财帛宫 ， 
则当大运或流年财帛宫值此星系时 ， 有流煞冲起 ， 亦有破败的倾向 。 
武曲见贪狼则不畏火铃 ， 否则必因财而生事端 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """子午宫 [ 武曲天府 ] ， 为财星喜得财库 ， 故必须见禄 然后始成格局 。 武曲化禄最 
佳 ， 因同时必叠禄存 ， 可成巨富 。 武曲化权亦佳 ， 因事业宫亦必见禄存 ， 富亦不小 。 
武 曲化科 ， 则事业宫廉贞叠禄 ， 亦成豪富 。 
若武曲化忌 ， 则必同时府库空露 ， 则主一生困乏 ， 甚或寅吃卯粮 。 此时 夭府同 
时化科 ， 仅主在财帛上有信誉 。 
武曲化禄 、 权 、 科而见空劫 ， 则一生必有一段时期感到困乏 。 以大运财帛宫化忌 
之年 ， 或见煞耗空劫之年为克应 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "武曲贪狼"):
                tmp = """丑未宫 [ 武曲贪狼 ] 同度 ， 有火星或铃星同踞 ， 主暴 富 。 若同时再见煞忌 ， 则暴 
起暴跌 。 
丑未 [ 武贪 ] ， 一般情况下主得偏财 ， 有煞而不重者 ， 更倾向于偏门行业 。 例如 
火星陀罗同度 ； 擎羊铃星同度之类 。 唯亦同时必主争夺 ， 而且财帛聚散如浮云 。 
[ 武贪 ] 为火铃夹 ， 亦主横发 。 若煞忌同踞 ， 则横发 横破 。 
【 武曲贪狼 】 见吉曜 ， 尤其是文曲文昌 ， 为社交活跃 之征兆 ， 其 财亦由交际应 
酬而来 。 若见煞忌空劫刑耗 ， 则虽终日应酬 ， 亦劳而无功 。 即所谓 『 煲无米粥 』 。 
【 武曲贪狼 】 化禄化权 ， 则不宜同时有文曲化忌同踞 ， 如有 ， 则进财虽多 ， 但 
散财亦不少 。 唯当事人却常抱 『 小 财 不出 ， 大财不入 』 的态度 ， 不以为不利 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "武曲天相"):
                tmp = """寅申宫 [ 武曲天相 ] 同度 ， 不擅理财 。 
『 武曲天相 』 以武曲化科为最佳 ， 盖必同时会廉贞化 禄与破军化权 ， 若无煞忌 
空劫 ， 可成富局 ， 唯难成巨富 。 
若有巨门化禄 、 太阳化权相夹 ， 则主发财于远方 ， 或主受外国人提拔 。 
若刑忌夹 、 羊陀夹 、 火铃夹者 ， 一生财帛损耗甚大 ， 主财 帛为兄弟或友人所夺 。 
若与人合作 ， 切须慎防 。 
『 武曲天相 』 亦主凭特殊技能以求财 。 见科文诸曜 ， 则倾向于文学艺术 。 
[ 武相 ] 喜禄马交驰 ， 主离乡背井以建立事业 ， 因此 成富 。 
『 武相 』 与辅佐诸曜同度 ， 仗义疏财 。 但若昌曲化忌 ， 则每因此反受拖累 ， 或 
致受骗 。 
『 武相 』 见煞 ， 进财艰辛 。 踞擎羊 ， 主争财 ； 踞陀罗 ， 进财拖延 ， 二者均须改 
变行业 。 踞火铃 ， 财难积聚 ； 踞空劫 ， 内在空耗 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "武曲七杀"):
                tmp = """卯酉宫 『 武风七杀 』 ， 主白手兴家 。 见吉化者 ， 必白 手以成大业 。
【 武杀 】 亦为横发之星系 。 羹筐必须见化橡或禄存始是 ， 且须无煞曜伺踞 。 若有 
煞 ， 则主争财 ， 不主横发 。 或 一 发 即蹶 ， 财帛慢慢消磨 。 
【 武杀 】 见吉曜 ， 投资额巨大 ， 其资财往往在企业资 产上 。 不主积蓄 。 若同时 
见煞 ， 剐事业虽大 ， 但财帛反而有损 。 
【 武杀 ] 若见煞忌刑耗并集 ， 则主倾败 、 倒闭或破产 。 以武曲化忌冲会廉贞化忌 
最为恶劣 。 
【 武贪 】 主挥霍 。【 武杀 】 亦主挥霍 ， 睢 【 武贪 】 之挥霍乃 志在应酬 ；『 武杀 』 
之挥霍 ， 常常一文不落虚空地 。 者又与 [ 武相 ] 之疏财仗义截然不同 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "武曲"):
                tmp = """辰戌宫武曲独坐 ， 与贪狼相对 。 必须经历艰辛而后 成富 。 
武曲对 [ 火贪 ] 、【 铃贪 】， 亦主突发 。 若有吉曜吉化 而无煞忌 ， 则不主横破 。 
辰戌武曲得禄 ， 可成富局 。 以禄存在命宫 ， 天马在 命宫或迁移宫者最为上格 。 
唯天马不宜与空劫火铃同度 ， 否则破格 。 此乃因辰戍二宫为罗网 ， 必须藉命宫禄马 
之力以脱罗网羁缠 。 
辰戌武曲化忌 ， 必生破败 。 见煞曜刑耗 ， 亦主困乏 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """巳亥『 武曲破军 』 ， 性质 不 良 ， 因一生起伏波澜甚大 。 
『 武破 』 得 禄 权科会者 ， 一 生人亦至少 有一 次困境 ， 但克服困难之后 ， 仍能致 
富 。 
若武曲化忌 ， 则不宜经商 ， 以任职为宜 。 更不宜投 机 ， 否则终生陷入困境 ， 极 
难恢复元气 。 
『 武破 』 见贪狼化忌 ， 主无心插柳柳成阴 ， 于事业外 别开生路 ， 由是富足 。 盖 
此时必同时见破军化禄 ， 主财源有意外改变 。 
『 武破 』 而破军化禄 、 化权者 ， 一生事业必屡有变化 ， 大致上愈变愈奇 。 
『 武破 』 守财帛宫 ， 勇于投资 ， 而俭与应酬 。 所 以平常并不大手笔 ， 只于创业 
时往往孤注一一掷 。 
『 武破 』 见禄马 ， 必须离乡背井以成富局 。 命寓有火 铃 ， 则立业异乡 ， 祖业不 
守 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守财帛宫 ， 主白手兴家 。 
火铃同度者 ， 有祖业亦必散尽 。 然后始主自身创兴 。 若空劫同 度 ， 则自身开创 
亦何破败 ， 仅能东山 复起 ， 结局 富裕 。 
天同在财帛宫不喜独坐 ， 若独坐 ， 必须中年辛苦求财 ， 至晚年始得顺遂 。 亦即 
白手兴家的程度更大 ， 情形亦较艰辛 。 
天同化禄 ， 决主晚年可成富局 。 但若同时见煞 ， 则发迹之前 ， 必须财帛破败净 
尽 ， 至身无一文 ， 然后始有意外收获 。 若无煞者 ， 则破败程度较轻 。 
天同化权 ， 一般情形较为稳定 ， 虽亦主白手兴家 ， 但 [ 白手 ] 的程度不致身无分文 。 
天同与陀罗同度 ， 往往五十岁后始环境变佳 。 能否 成富 ， 须视晚运优劣而定 。 
天同化忌 ， 主 一生财运反复 。 更见煞刑虚耗诸曜 ， 则 财源稍顺双告更迂 ， 必须时
时另起炉灶 。 
天同喜见禄马交驰 ， 则为离乡背井 ， 白手以成富局 。 更叠化禄 ， 尤主发财万镒 。 
凡天同在财帛宫 ， 所业宜带享受性质 。 或为消遣享 受时所应用的物品 。 倘见科 
文诸曜 ， 尤主优雅享受 ； 见桃花 ， 则宜以异性为顾客对象 。 
"""
        print(tmp)
        print("\n")
        if(star == "天同巨门"):
            tmp = """『 天同巨门 』 与阴煞 、 天虚 、 大耗同度 ， 则主机关巧 计 。 见天刑 ， 宜从事法律 ， 
或与纠纷有关的事业 ( 如执达 吏 、 公正行 ) 。 
『 天同巨门 』 与昌曲化忌同踞 ， 更见桃花及刑耗 ， 主 因色破败 。 其中隐痛且不 
足为外人道 。 
『 天同巨门 』 喜左右夹 、 昌曲夹 ， 则积财能力稍强 。 若 火铃夹者 ， 则主财帛不 
积 。 倘火铃夹巨门化忌 ， 又见刑耗 ， 则为因官非词讼而破财 。 
『 天同巨门 』 见吉化 、 吉曜 ， 亦宜传播工作 ， 或专业 工作以求财 。 
『 天同巨门 』 在寅申宫 ， 见吉曜 ， 主财源丰茂 ， 而当 局者却并斤斤计较金钱 。 
若天同化禄 ， 则主有意外财 ， 但非横财 。 但天梁化 禄 ， 则财源往往受入指责 。 
天梁化禄与火铃同度 ， 更见天姚 、 阴煞 ， 则主贪墨 。  """
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """
【 天同天梁 】 躔禄马 ， 或对面福德富有禄马 ， 亦可因 远方财而成富 ， 但不主商 
业贸迁 。 见天巫者 ， 主远方有现成事业 ， 因承继或接受而成富局 。 
『 天同天梁 』 与天才同度 ， 或与龙池凤阁同度 ， 上凭 技艺生财 。 
[ 天同天梁 ] 与昌曲 、 桃花同度 ， 见天马而不见禄 ， 主财由异性来 。  """
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """子午宫 [ 天同太阴 ] 同度 ， 为天同坐财帛宫众星系 中 ， 最利财源的星系 。 天同化 
禄 ， 则破尽祖业后突然兴起 ； 太阴化禄 ， 则一生至少有一次意外财源 。 
[ 天同太阴 ] 在子宫者 ， 女命 ， 往往主与异族通婚而 成富 。 男命则主得外族财 。 
唯太阴化禄者不是 。 
『 天同太阴 』 与禄存 同度 ， 事业宫见天马 ， 亦主发财 于远域 。 
[ 天同太阴 ] 若太阴化权 ， 则少年必主飘流 ， 在异域 先有地位 ， 再成富裕 。 
『 天同太阴 』 若天同化忌 ， 或太阴化忌 ， 财帛皆难积 聚 。 又见煞刑诸曜者 ， 且 
见虚耗 ， 主财源波动 。 
『 天同太阴 』 与擎羊同度者 ， 因财起纠纷 。 或主财源起竞争 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """丑未宫 『 天同巨门 』 ， 基本性质主因财而生是非口 舌 ， 故最宜费唇舌以求财 。 巨 
门化忌者 ， 尤非费唇舌以求财不可 。 若见羊陀 ， 亦主劳心 。"""
                print(tmp)
                print("\n")
            
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天同"):
                tmp = """卯酉宫天同独坐 ， 与太阴对拱 ， 决主白手兴家 。 天 同化禄者 ， 凭薄资又成富局 。 
卯酉天同与太阴化禄对拱 ， 因事业宫巨门必同时化 忌 ， 故主费口舌以求财 。 
卯酉天同化忌 ， 倘更有羊院夹 ， 主因财致祸 。 福德 宫见桃花者为色祸 ： 无桃花而 
昌曲化忌 ， 主替人负债 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天同"):
                tmp = """辰戌宫天同独坐 ， 与巨门相对 ，， 基本性质主求财辛 苦 ， 颇费周章 。 唯魁钺夹者 ， 
则一 生多机缘 。 
辰成天刚何煞嗣度 ， 澡为必费心力 。 
若天同与天姚 、 阴煞 、 天虚同度 ， 或铃星同度 ， 皆 主求财赞尽机关 。
辰成天同化忌 ， 火铃夹皆 ， 主受人拖累而破财 。 更 见刑耗 、 空劫 ， 主官非词讼 。 
辰戌天同即使化禄 ， 亦只宜服务他人 。 自行经营 ， 财更难聚 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天同"):
                tmp = """巳亥宫天同独坐 ， 与天梁相对 ， 不主财 旺 。 唯命宫 『 天机巨门 』 叠禄者为富局 。 
此乃命宫使然 ， 不关财帛宫星 曜 。 
巳亥宫天同 ， 对拱天梁化科 ， 则名大于利 。 唯若文 曲化忌同度 ， 则为伪君子 ， 名 
虽高而求财手段不正 。 
巳亥宫天 同化忌 ， 天刑同度 ， 因财而招讼事 ， 且易引起损失 。 
巳亥天同化权 ， 因命宫必同时见巨门化忌 ， 亦主劳 心费力 ， 求财多起是非 。 
巳亥天同于财帛为弱寓 ， 稍见煞即主劳心费力 。 不 见煞 ， 见渚吉 ， 然后晚年始 
能富裕 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞征财帛寓 ， 性质俐当于复杂 。 尤其对四化异常 敏感 ， 变化甚大 。 
廉贞主竞争是非以求财 ， 此为其基本性质 。 其化忌 ， 见煞 ， 且有刑耗诸曜 ， 则 
不但求财艰难 ， 且易生词讼 。 见昌曲化忌 ，。 且易为人侵吞财物 ， 或替人背债 。 
但廉贞化 禄 ， 或禄存同度 ， 却易成富格 。 其财每由 交际应酬而来 。『 小钱不出 ， 
大钱不入 ] ， 即为此种格局的克 应 。 若廉贞化禄而有煞同度 ， 又见吉曜 ， 其人用钱恰 
能用在刀口 。 
廉贞化禄见魁钺 、 昌曲 、 辅弼 ， 则财源丰茂 。 有火 星擎羊同度 ， 主暴发 。 唯财 
不易聚 。 有铃星陀罗 ， 则艰辛以求财 ， 或多虚少实 。 遇空劫则多破败 ， 且常常牵涉 
是非争讼 。 
廉贞在财帛宫 ， 吉凶诸曜交集者 ， 其人多浮华 。 昌 曲同度 ， 亦主华而不实 。 一 
生追逐财富 ， 毕竟但得表面风光 。 若同时化禄 ， 则主豪奢 。 
廉贞化忌 ， 主因财失义 ， 亦主受人拖累 。 
廉贞化忌而空劫 同度者 ， 上述情形更甚 ， 不但易涉 讼事 ， 而且每每因此倾破家 
财 。 
廉贞与煞曜同度 ， 有空劫 、 大耗者 ， 主遇盗 。 
廉贞与昌曲化忌同度 ， 见大耗 、 阴煞 ， 亦主被盗 ， 或主受骗 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """子午 『 廉贞天相 』 ， 加强廉贞的交际应酬色彩 ， 为长 袖善舞的商人 。 若成财荫夹 
印之局 ， 则每每因此受到同报 。 故此种格局 ? 容易经商而成富裕 。 
『 廉贞天相 』 而刑忌夹印 ， 或廉贞化忌 ， 则主因无谓 应酬而致破财 。 有煞曜空 
劫者 ， 则主是非词讼 。 
最喜廉贞化禄 ， 则于交际中得财 ， 可以成富局 。 
『 廉贞天相 』 与空劫同度 ， 则难以积财更见刑煞 ， 有 是 非词不达意讼 ， 或虽表 
面风光 ， 其实内在空虚 ， 寅吃卯粮 。 
『 廉贞天相 』 亦可横发横破 ， 但性质较为和缓 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未宫 『 廉贞 ， 七 杀 』 同度 ， 在未宫为 『 雄宿乾元格 』 ， 若得禄则可成富格 ， 唯 
仍须历艰辛 。 丑宫虽不成 『 雄宿乾元 格 』， 但见禄亦可成富 ， 唯财源不如在未宫之畅
顺耳 。 
『 廉贞 七 杀 』 在财帛宫 ， 为浮华性质至少之星系 。 故 除廉贞化禄外 ， 见破军化禄 
或贪狼化禄 ， 均可成富 ， 而且主充实而不空虚 。 
[ 廉贞 七 杀 ] 有昌曲同度 ， 则主同情心强 ， 化忌则不 宜代人负债 。 
『 廉杀 』 在财帛宫 ， 擅积财而不擅理财 ， 辅佐诸曜同 会者 ， 则理 财能力较佳 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "廉贞"):
                tmp = """寅申宫廉贞独坐 ， 与贪狼相对 ， 理财能力甚强 。 与 火星同度者 ， 亦主横发横破 ， 
且对钱财相当重视 。 
廉贞坐寅申 ， 最宜从事财经事业 。 若廉贞化禄 ， 可成富局 ， 贪狼化禄 ， 尤存利 
己之心 。 火贪化禄 ， 主突发 ， 只需见好收篷 ， 亦不致暴败 。 
寅申宫廉贞 ， 最喜禄马交驰 ， 不但善于理财 ， 且主 贸适得利 。 
廉贞于寅申宫化忌 ． 事业受挫折 ， 往往功败垂成 。 若同时见煞刑耗曜 ， 且主词 
讼 。 火铃夹者尤确 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉宫 [ 廉贞破军 ] 同度 ， 财源不稳定 。 若破军化禄 ， 往往须兼行兼职 。 
[ 廉贞破军 ] 在财帛宫 ， 破军化禄则不宜见火星 ， 主 因贪反生破败 ， 或理想太高 ， 
屡生挫折 。 
[ 廉贞破军 ] 与禄存同度者 ， 则 喜见火星 ， 或火星 与命宫 [ 武曲贪狼 ] 同度 ， 此为巨 
富之格 。 但发盾仍有破败 之机 ， 以流年命宫或财帛宫见煞忌刑凑之年为克应 。 
[ 廉破 ] 与空劫同度 ， 主横生破败 。 但若同时见禄及 吉曜者 ， 则吉凶系于一线 ， 
一念之差 ， 可以成败立判 。 大致而这 ， 不宜赶尽杀绝 ， 最宜留有余地 ， 见好收篷 。 
『 廉破 』 守财帛宫不宜投机 ， 否则必生破败 。 即使见 吉 ， 破败后亦难恢复元气 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """ 辰戌 『 廉贞天府 ] ， 擅积财 ， 亦擅理财 ， 但若府军空 露 ， 则 纵腾挪变化 ， 亦难以 
积存财帛 。 
若廉贞化禄或命 宫 有禄存 ， 若事业宫有禄存 ( 叠 禄者更佳 ) ， 则为富格 。 
若天府化科 ， 则在财帛方面一诺千金 。 若此时会武 曲化忌 ， 容易手头困乏 。 故 
不宜投机 ， 亦不宜轻于言诺 ， 以免受人拖累 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥宫 『 廉贞贪狼 』 同 度 ， 二者任一化禄 ， 与火铃同 度 ， 均主得偏财 ， 但暴得 
暴失 ， 见刑耗空劫 ， 且主因此破败 。 
巳亥 [ 廉贪 ] 与桃花同度 ， 则为艺术之星 。 但倾向于 表演 。 
巳亥 『 廉贪 ] 为色彩 ， 故主从事美观之事业以生财 。 又为娱乐及享受 ， 亦宜从事 
此等行业 。 
巳亥 『 廉贪 』 与昌曲同度 ， 则为 浮华 ， 亦主繁文缛节 ， 故有装饰意味 ， 此亦为 
生财之性质 ， 如美术设计之类 。 唯进财亦有虚浮现象 ， 见虚耗 ， 主虚空不实 。 
『 廉贪 』 而廉贞化忌 ， 决生破败 ， 不宜求偏财 ； 贪狼 化忌者 ， 则主求财目标不 
易达到 ， 但因事件进行 ， 反而另外有生财之道 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """"天府守财帛宫 ， 不主富厚 ， 仅主其人有储财及理财 能力 。 必须见禄 ， 然后始可 
成富局 ， 禄存或化禄均可 。
天府守财帛宫 ， 亦喜见辅佐诸曜 ， 则增加其储财能 力 ， 亦增加其进财能力 。 
若不见禄 ， 则宜天府化科 。 此主有信誉 ， 特别于理 财及投资方面 ， 必有人予以 
信赖 ， 由是开展财源 与职业 。 
天府已主保守 ， 用钱非常有计划 ， 倘禄存同度 ， 更 主凡事小心谨慎 。 此则仅利 
于发展现成事业 ， 不利开创新局 。 
天府禄存同度 ， 更宜见辅佐诸曜齐会 ， 然后始主有 助力及发展机会 。 
天府不得禄 ， 又 不化科 ， 且无辅佐诸曜 ， 则为空库 。 有财星同度或相会 ( 如武曲 ) 
尚可 ； 如无 ， 则仅主利于受 薪服务 。 自行经营 ， 不主发达 ， 易错失良机 。 
天府与禄存同度而不见辅佐诸曜 ， 则进财艰难 ， 稍 见煞即有破耗 。 
空库者若更与煞忌空劫同会 ， 则为 [ 府库空露 ] ， 主 困乏 ， 仅宜受薪 ， 自行经营 ， 
则必引起争夺 。 
空库或 露库者 ， 与阴煞 、 天姚同度 ， 则主机关巧计 以谋财 。 若文昌化忌或文曲 
化忌同踞 ， 则为巧骗或受骗 ， 此须详命宫及福德宫而定其为骗人抑或受骗 。 
天府得禄见吉 ， 若有空劫同度 ， 每进财亦必受损失 ， 唯进财之数大于损财耳 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未 宫 天府与 『 廉贞 七 杀 』 相对 ， 且 成 『 日 月夹财 』 之 局 ， 古人云 ，『 日月夹财 ， 
不权则富 ， 加羊陀冲守则宜僧道 。 』 此局必须见禄 、 权 、 科及吉曜 ， 然后始入格 。 
丑未宫天府亦宜昌曲 、 左右同度 ， 则亦主掌财权 。 
丑未宫天府若有昌曲同踞 ， 又同会桃花诸曜 ， 则最 忌天姚同度或对拱 ， 则主掌 
妇人之财 ， 性质优良者 ， 可以为银会会首 之类 。 若性质不佳 ， 则主生事端 。 
丑未天府会刑忌夹印的天相 ， 亦主在金钱方面受压 力 ， 会财荫夹印的天相 ， 则 
必得荫庇之力 ， 或有管理现成事业的机会 。 
天府对冲廉贞化忌 ， 则多挫折 。 有煞同度者更主破 败 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫天府独坐 ， 与 『 武曲 七 杀 』 相对 ， 以武曲为财 星 ， 故掌财权之力 ， 大于 
丑未宫天府 。 是故最宜见辅佐诸 曜 同会 ， 主有现成事业 ， 或经营家族事业 。 
若见空劫刑耗 ， 且武曲化忌 ，． 则主事业破败 ， 或从 事新项目投资失败 ， 以致影 
响原有事业根基动摇 。 
最喜见武曲化禄 ， 或天相为财荫夹 ， 则经营事业有 所发展 ， 利创新猷 。 
若武 曲化科 ， 则理财能力甚佳 ， 所渭 『 以钱生钱 』 ， 易得人信任 ， 最宜积集资金 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天府为 『 紫微 七 杀 』 相对 ， 最喜紫微化权 ， 天 府同时化科 ， 则一生职掌财 
权 。 在现代 ， 宜经营基金 、 财务机构等 。 
巳亥天府最宜见禄马交驰 ， 同时见辅佐吉曜 ， 则可 掌权于国际性财务机构 。 
唯若成空库 ， 则在巳亥宫之天府 ， 一生财源波动甚 大 ； 虽小心谨慎从事 ， 事机 
依然有失 。 
巳亥宫天府最不宜 『 露库 』 ， 否则稍有发展 ， 即为人 觊觎 。 倘见空劫 ， 更主突生 
破败 。 
巳亥天府最为惜财 ， 非 见现金则无安全感 ， 故若见煞 ， 则影响发展机会 。 
巳亥天府亦最不喜会刑忌夹的天相 ， 主受财政压 力 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴为财星 ， 但太阴主静 ， 主藏 ， 故在财帛上表征 为储蓄 、 积聚 ， 以及思考 、 享 
受 。 此跟天府不同 ， 因为天府仅有守财的意义 ， 不表征为享受及思考 。 这有如一个 
银行 ， 银仓可能积存许多钞票 ， 但银行职员本身并不会将存款作为自己的精神享受 。 
太阴则等如基金经理 ， 对因自己计划得出来的成果 ， 自然有满足的感觉 。 
太阴又与武曲不同 。 仍以财经机构为例 ， 太阴等于 决策投资计划的经理 ， 而武 
曲则属执行计划的人员 。 于决策时 ， 固然要力求冷静 ， 在执行计划时 ， 尤其需要当 
机立断 。 所以 武曲主决断 ， 而太阴则主计划 。 
太阴之主计划 ， 亦即擅长运用钱财 。 而且在精神上 享受运用钱财的成果 。 其所 
得 ， 并不全部属于自己 ， 但仍然可因此而成富裕 。 
太阴化禄 ， 或与禄存同度 ， 皆主富裕 。 化权则增加 其计划理财 ， 及享受财富的性 
质 。 化科则仅为理财的知名度 。 
太阴入庙 ， 夜生人决主富贵 ， 其实 ( 即社会地位 ) 亦由富而来 ； 日生人次之 。 太 
阴落陷 ， 则进财维艰 ， 夜生人较吉 ， 曰生人更甚 。 
太阴亦喜同会辅佐诸曜 ， 以其亦为夜生人之主星 也 。 
太阳主贵 ， 先有社会地位然后有钱财 ； 太阴主富 ， 先有钱财或在财经界上有 成 
就 ， 然后始有社会地位 。 
太阴化忌 ， 一般情形下主受引诱而致投资失败 。 所 谓受诱 ， 指受人不正确的引 
导 ， 亦指受潮流引诱 。 若更遇文曲化忌冲会 ， 则此种引诱且带受欺骗性质 。 
若有煞曜 ， 主成败不一 且 引致纠纷 ； 见空 劫 ， 则为 盗贼之灾 。 太阴化禄冲会文 
曲化忌 ， 则主被绰或遗失 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫太阴独坐 ， 与天同相对 ， 在酉宫入庙 ， 故优 于在卯宫落陷 ， 唯二者皆主 
白手兴家 。 大致上可参考子午宫 『 天同太 阴 』 同度时的情形推断 。 
卯本太阴 ， 在求财时常过份追求理想 ， 因而亦时有 失落感 。 
卯西太阴会照太阳及天梁 ， 故当同会昌 曲 、 天才 、 龙池凤阁 ， 或且见化科之时 ， 
亦主其财源带有学术意味 ， 一般表征为财经研究 。 
卯 酉太阴会太阳化科 ， 尤主学术研究 。 或代理名牌商品 ， 或在有名机构服务 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰 戌 太阴与太阳相对 。 一般情形下 ， 戌宫优于辰宫 。 唯辰宫 [ 日月反背 ] ， 若禄 
权科会 ， 见吉曜 ， 亦主成大富之 格 。 
辰 戌 太阴最喜太阴化禄 ， 主寓而后贵 ； 太阳化禄则 先贵而后富 ， 故一般宜以先任 
职企业然后自创 ； 会天同化禄亦主白手兴家 ； 会天机化禄 ， 则仅主过手钱财数量大 。 
若天同化忌 ， 则劳心劳力以求财 ； 天机化忌 ， 则奔 波劳碌 ； 太阳化忌 ， 则得财 
亦同时有是非 。 
太阳化禄 、 化科 ， 均主有产业承继 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥宫太阴与天机相对 ， 亥宫优于巳寓 。 在亥寓 者每因机遇而成巨富 ； 在巳宫者 ， 
辛霜酸露 ， 四处奔流 。 
亥宫太阴守财帛宫 ， 却主先有地位名誉然后有财 富 ， 故绝非经商致富之命 。 即使
太阴得禄亦然 。 若见科文诸曜 ， 尤宜学术研究 。 
在巳宫者 ， 虽有相同性质 ， 但名誉地位减等 ， 而 进 财亦较少 ， 或较艰辛 。 
由于天机的影响 ， 故主变动 。 性质不占时 ， 主财帛不聚 ， 或主所任职务长期带流 
动色彩 。 若性质优良 ， 则主所涉及者有大量金钱流通 。 例如从 事社会工作 ， 所牵涉 
者 为大量救济金 ； 从事银行业务 ， 所牵涉者为大量存贷 ； 从 事学术研究 ， 由专利导 
致大额投资 ， 或成为公众的日常必须品 。 
巳亥宫太阴不宜与空劫同度 ， 否则常生枉抛心力 ， 或时生挫折 ， 功败垂成 。 
太阴在十二宫 ， 唯居巳亥守财帛宫主贵不主富 ， 此 点最宜再三注意 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守财帛宫 ， 手段阔绰大方 ， 但仍精于盘算汁较 ， 所以对于财帛的态度 ， 
其内心与外表常不一致 。 
贪狼守财帛 ， 主擅长运用金钱 ， 但却不擅长守财 ， 且常常有以攻为守的倾向 ， 
因此往往倾向于投机 。 
贪狼与羊陀 、 空劫 、 大耗会同 ， 则以不投机为宜 ， 否则倾家 。 即使贪狼化禄 ， 
亦主波折挫败 。 不从事投机 ， 则仅主事业上有极 大竞争 ， 或计划常因客观环境影响 
而生变化 ， 虽受一时损失 ， 容易东山复起 。 
。 贪狼化权 ， 反而增加投机性及多生变动 ； 贪狼化禄 ， 则无论财政状况如何 ， 
均表现阔绰 ， 追求豪华风光的享受 。 唯贪狼化忌 ， 反容易自我克制 。 
火星或铃星与贪狼 同度 ， 更见禄存或化禄 ， 决主突发或暴发 。 若同时有空劫者 ， 
一发即生破败 。 无空劫 ， 会吉曜 ， 然后始能保泰 ， 且必须及时收手 ， 不可以为永远 
幸运 。 
贪狼叠禄 ， 常得意外之财 。 但若同时与煞刑虚耗诸 曜同会 ， 则亦带有灾难性 。 
如得伤残保险赔偿 ， 亲属人寿保险赔偿 ： 或有后遗症之赌博得利 ， 均主得财而同 时 
惹来灾祸 。 
贪狼躔昌曲桃花 ， 因色损财 ， 更见煞刑诸曜 ， 因色 倾家 ， 且惹官非词讼 。 
贪狼与阴煞同度 ， 主受骗 ； 与天月同度 ， 主因病破财 ； 与劫煞同度 ， 主田财起 
争夺 。 此均以同时见羊陀空劫者为然 。 
贪狼化忌 ， 与火铃同度 ， 更见天虚 ， 又会禄存 ， 则其人宜以偏门起家 。 
贪狼守财帛 ， 会廉贞带禄存 ， 又见破军 ， 有火铃会照 ， 亦宜财不由正路来 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午贪狼守财帛 ， 与紫微相对 ， 得紫微化权拱照 ， 则财源稳定 ， 而可得多方面的 
财源 。 紫微化科拱照 ， 则终生先名后利 ， 亦主以交际应酬 ， 多结人缘 ， 由是营运得 
利 。 
子 宫贪狼成 [ 泛水桃花 ] 之局者 ， 吉则宜经营以异性为对象之行业 ； 凶则主因色破败 。 
吉凶交集而 同时有火铃同度 ， 财由异性而来 ， 亦因此生破败 。 
子午贪狼若不见紫微吉化 ， 纵使贪狼化禄 、 化权 ， 亦主动荡变迁 ， 或需时时出差 ， 
或多到外埠洽谈商务 。 见 事业宫破军与禄马同躔者 ， 尤主外务得意 ( 不一定迁移外 
地 ) 。 
子午贪狼守财帛者 ， 以掌握财权为满足 ， 不一定要 自己拥有大量资财 。 故亦宜 
任职大企业营业部门 。 但不宜作计划工作 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫贪狼独坐 ， 与廉贞相对 ， 一般来说 ， 廉贞化 忌 ， 则宜半偏行业 ， 或 『 凶 
事以求财 』 ， 以带血光为佳 。 在 现代 ， 经营 冻肉亦属此类 ， 亦可为外科 、 牙科 。 
倘廉贞化禄对拱 ， 与火铃同度 ， 亦主横发 ， 有煞曜 会合 ， 更见阴煞天姚 ， 则主 
半偏行业得财 。 必须见吉 ， 然后主艺术或带装饰享受性质的行业起家 。 若吉煞交集 ， 
则进财同时亦有损耗 ， 且主横发横破 。 
寅宫贪狼化忌 ， 主时时改变行业 。 不化忌 ， 但成 『 风 流采杖 』 之局者 ， 则主投 
机致祸 ， 或经营半偏及偏门行业而致身败名裂 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫贪狼独坐 ， 与武曲相对 。 火铃宜与贪狼同度 ， 若与武曲同度者 ，． 则虽横 
发亦必同时起竞争 。 
喜武曲财星化禄 ， 则 运用财帛的能力甚强 ； 化权 、 化科次之 。 
辰戌宫 【 火贪 】、【 铃贪 】 以得贪狼化禄为贵 ； 主突 然财运亨通 ， 且略带投机色 
彩 ， 但必须见好收篷 ， 得意不宜再往 。 若贪狼不化禄者 ， 突发程度较逊 。 
辰戌贪狼落罗网 ， 若命宫或迁移宫有禄马交驰 ， 则 主离乡背井 。 以成富局 。 唯 
一生事业财源必多变动 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守财帛宫 ， 基本性质为劳心费神以求财 ， 或主以 口舌求财 。 且不宜心高气 
傲 ， 否则必生破败 。 
巨门化禄 ， 亦仅主利于口舌求财 ， 如律师 、 教 师 、 推销 、 传播 、 表演等行业 。 巨 
门化忌者尤然 ， 否 则 必多是非词讼 。 
巨门坐财帛宫 ， 有禄 、 权 、 科同会 ， 更见 辅佐吉曜 ， 必可成富 。 唯若锋芒毕露 ， 
盛气凌人者 ， 必反遭入排挤 ， 以致失败 。 
巨门之财 ， 不过一代 。 故凡巨门坐财帛宫 ， 宜兼视 子女宫 ， 子女宫不吉者 ， 主子 
女散财 ， 更见刑耗煞曜 ， 及阴煞 、 大耗 、 天虚 、 破碎 、 蜚廉诸曜 ， 则子女因牵涉官 
非而破败 ， 或骄奢致败 。 
巨门化忌固易惹是非 ， 太阳化忌亦主生极大口舌 ， 且见天刑 ， 则主因财而致兴讼 。 
唯从事刑法纪律行业者 ， 则 反吉祥 。 
巨门与火 、 铃星 、 空劫 、 大耗同度 ， 则主因火灾 、 兵 灾而致破耗 。 
巨门 、 擎羊 、 天刑同度 ， 主词讼 ， 或主财帛竞争 。 从事有竞争意味的行业 ， 如 
法律拍卖行 、 经纪行等 ， 则主 吉祥 。 
巨门与太阳同度或对照 ， 有吉化者 ， 或命宫见禄马 交驰者 ， 主一生受异族信赖 
而成富 。 且主其人有语言天才 ， 此种技能 ， 亦可帮助其进财 。 
 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫巨门与天机相对 ， 见禄 ， 为 『 石中隐玉格 』 ， 主中年后脱颖而出 ， 突成巨 
富 。 唯早年必受艰辛 。 发达之后 ， 若锋芒太露者 ， 又易成为他人攻击目标 。 若骄奢 
淫佚 ， 亦往往因此致败 ， 且易一蹶不振 。 子午巨门居财帛宫 ， 亦宜在异族经营之机构服务 ， 则主先得信誉 ， 然后事业发
展而富裕 。 
若见科文诸曜 ， 则以传播事业为宜 。 亦先有名然后 有利 。 
倘子午巨门与桃花诸曜同度 ， 则 宜从事以口才为主 之表演事业 。 化禄化忌皆然 。 
子午巨门与煞曜同度者 ， 事业每多纠纷 。 与桃花 诸曜同度 ， 又见阴煞 、 天姚 ， 
则因财而招色祸 。 从事演艺者尤须慎防 。 
子午巨门不见吉化 ， 但有禄存同度 ， 又见火铃 ， 且 躔刑耗者 ， 主争财兴讼 。 有 
天巫 ， 则主遗产争夺 ， 或主现成事业起竞争 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫巨门与天同相对 ， 主白手创业 ， 且以专业为 宜 ， 因之可以成富 。 
辰成为罗网 ， 又为巨门陷地 ， 故亦主奔波劳累 。 所 从事专业亦以带奔忙性质者 
为宜 ， 如建筑地盘工程师 、 航 业工程 、 运输工程等 。 
辰戌巨门与煞曜同度 ， 奔波尤甚 。 若 无禄权科会 ， 又不见辅曜吉曜 ， 亦无魁钺 
来夹 ， 则仅宜以劳力求财 。 
辰成巨门化忌者 ， 为反格 ， 可得意外高职 ( 如未有 足够资历 ， 却能得任需资历之 
职位 ) ， 因而收丰厚 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 己亥巨门独坐 ， 对宫为太阳 ， 故利于以口舌求财 。 
巳亥巨门见太阳化禄 ， 亦主受异族推崇 ， 在异族中 有信誉 。 
若巨门化禄 ， 亦宜门市 、 零售等业 。 以异族为主要 顾客对象者更宜 。 亦宜以外 
地人士或游客为顾客对象 。 
巨门化忌及会天机化忌之时 ， 则以任职为佳 ， 不宜 自行经营 。 
巨门化为权星 ， 在巳亥宫 ， 必须从事 [ 口舌生财 ] 的 行业 。 
巳亥巨门见禄马交驰之局 ， 亦利在外地贸迁 。 在现 代最宜日用品零售 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相坐财帛宫 ， 有些情形与天府相似 。 天府为财库 。 但天相却亦可为财印 。 
以现代意义而言 ， 天相等于提款的印鉴 ， 则虽府库充盈亦无所施用 。 所以当天相坐 
财帛宫时 ， 必须辨其是否属于财印 。 
成财印的天相 ， 如得财荫夹印 ， 与禄存 、 化禄同度 或对拱者皆是 。 此主富厚发 
达 。 若不见禄 ， 但见吉曜会聚 ， 而天府虽不得禄但亦不空露者 ， 天相虽非财印 ， 但 
亦不致成为破印 ， 亦可得富足 。 
破印者 ， 为刑忌夹 、 火铃夹 、 空劫夹 、 有煞同度又 会煞 ， 或空劫同 度会煞者 ， 
皆是 。 凡破印 ， 主财帛波动 ， 煞 忌重重者 ， 或且致倾家 。 唯无论何种程度之不吉 ， 
大多数情况下均受人牵累而致 。 
天相与禄存同度者 ， 其对钱财之谨慎态度甚于天 府 。 唯与天府不同之处 ， 则在 
于天相守财帛时 ， 常能慷慨解囊以济人之危 ， 天府则对此更小心谨慎 。 
天相喜与化禄或禄存同度 ， 必主富厚 。 尤喜化禄 ， 财帛更主丰盈 。 且亦可掌财 
赋之权 ， 能在现成局面下发展事业 。 
天相为财荫夹 ， 更易得现成机会 ， 发展现成事业 。 故亦喜同会魁钺 ， 或得魁钺 
夹 。 
天相若为刑忌夹 ， 则主受掣肘 ， 或受拖累 。 更加有 煞同宫 ， 或空劫同度 ， 则主 
倾覆破尽祖业 ， 一四十以后始渐兴家 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天相 ， 与 [ 紫微破军 ] 相对 ， 可主突发 。 但突 发前必有一段时期经济困难 ， 
或财源虽有 ， 但却似鸡肋 。 
丑未天相之突发 ， 仍视会合星曜而定其程度 。 见吉化吉曜则突发之后可平稳 ， 
若有煞忌 ， 则 仍主波动 。 
丑来天相 ， 常以 『 紫破 』 或天相大运或流 年 ， 为突发 克应之期 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉寓天相独坐 ， 与 『 廉贞破军 』 相对 ， 基本性质不 吉 。 故稍见煞曜 ， 其财源 
即不稳定 ， 且时生改变之心 。 
若与空劫同度 ? ： 再见煞忌 ( 尤不宜廉贞化忌 ) ， 则 易因拖累而致生纠纷 。 若再有 
天删 、 大耗 、 阴煞 ， 或更与昌曲化忌对冲 ， 于此大限流年 ， 必生严重破败 ， 可至倾 
家 。 唯若继续行至吉限 、 吉年 ， 则主可以东山 复起 。 此为一项 重要征验 。 
卯酉天相见禄 ， 又见吉化吉曜 ， 财帛虽丰盈 ， 但仍 主改变 ， 故一生必至少有一 
次重大的转行转业 ， 转变财源 。 
卯酉天相若见吉曜太多 ， 则容易过分奢望 ， 生改变 之心亦由此而来 。 盖以为改 
变环境即可达到理想 ， 然结果 必仍然失望 。 后天趋避 ， 以不作急剧转变为宜 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥宫天相 ， 对 『 武曲破军 』 ， 财源亦不主稳定 ， 唯 较 对拱 『 廉贞破军 』 为佳 。 
－ 一天相独坐的三种情况 ， 其实皆 主不稳定 ， 唯对拱 『 紫微破军 』 之不稳定 ， 系主 
突发 ， 以及 突发后仍有波动 ；『 廉贞破军 』 之不稳定 ， 常常出于自发 『 武曲破军 』 之 
不稳定 ， 则为客观环境所致 。 人类常易克服 客观环境的改变 。 但却不易克服内心的 
情绪 ， 因此天相对 [ 武破 ] ， 其客观境遇一般便比对拱 [ 廉破 ] 为佳 。 
巳亥天相最畏武曲化忌冲拱 ， 则 _ 生波折重重 ， 当 境况较佳时 ， 又生变化 。 惟若 
仍有吉曜会合 ， 而煞不重者 ， 则可从事 『 凶事以求财 ] 的行业 。 如饮食业 、 冻肉业等 ， 
则 波动较少 。 或从事专业亦可 ， 则以受雇用为宜 。 
巳亥天相见武曲化禄 ， 必躔陀罗 ， 或与陀罗冲拱 ， 故性质亦不全美 。 
巳亥天相见武曲化权 、 化科 ， 又有吉曜同拱 ， 则财 源较为稳定 ， 且主终有积蓄 。 
巳亥天相躔空劫刑煞 ， 则有破败 。 客观 环境改变频仍 。 
巳亥天相见禄马交驰 ， 主常得外地提供之生财机 会 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守财帛宫一般不宜经商 。 ( 反而天梁居迁移宫 者可成富商唇贾 ) 。 从事商业 
活动 ， 亦以任职为宜 ， 否则必 生重大困难 ， 有时且可能引起危机 。 
天梁不宜化禄 ， 若化禄 ， 反主有纠纷 、 困扰 。 有煞 忌同会者 ， 往往因此引致官 
司词讼 。 若同时会吉曜 ， 则困扰较小 ， 亦较易化解 。 
天梁有管理 、 监察 、 查核的性质 。 居财帛宫 ， 亦以 此类性质为宜 。 若天月同度 ， 
则变为查察病情 ， 故可以医药业求财 ； 若天刑同度 ， 则刑法纪律的监管 ， 故可以司 
法 、 军警等业为求财的手段 。 
天梁为荫星 ， 故主有父祖之荫庇 。 有时并不主遗产 的承继 ， 而是藉长辈的声誉
而得助力 ， 由是生财 。 有时又主因长辈的人际关系而得事业 ， 由是生财 。 或主有现 
成事业生财 。 
天梁守财帛宫 ， 亦先名后利 。 故天梁化科 ， 优于天 梁化禄 。 
天梁守财帛宫 ， 宜以服务为目的 ， 不宜以求财为目 的 。 志在服务者 ， 财禄自然 
充裕 ， 若志在求财 ， 则易渎职 ， 反滋困扰是非 。 
天梁在 财帛宫化禄 、 叠禄 ， 皆只主一时之富 ， 但背 后却受人讥评 。 交入不佳岁 
运 ， 立时惹起是非困扰 。 故宜广结人缘 ， 以不损害他人利益为求财之大前提 ， 且须 
顾及公正 ， 然后才能后天趋避 。 然究不如志在服务者之佳 。 
天梁会禄权科 ， 而非天梁化禄者 ， 名高利厚 。 
天梁天马同度于财帛宫 ， 财帛难聚 。 且主时时调换 工作环境 。 
天梁守财帛 ， 纵见凶曜 ， 亦终不致贫之 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫天梁 ， 子优于午 ， 盖子宫天梁得午宫太阳 正 照 ， 招是非妒忌的性质大为减 
少 ， 尤以化禄者为然 。 
子宫天梁 ， 一生多进财钱会 ， 但散财亦不少 。 必须 天梁本身不化禄 ， 而会照化 
禄或禄存 ， 然后始成富局 。 
午宫天梁 ， 进财机会较少 ， 散财机会亦较少 。 唯 一旦富足 ， 或享受较奢即易受 
人妒忌 。 
子午宫天梁 ，。 亦可成 [ 阳梁昌禄 ] 之扃 ， 若更见科文 诸曜 ， 尤喜文昌化科 ， 或文 
曲化科 ， 则名高利厚 。 在现代 ， 亦可以专利发明致富 。 
若昌曲桃花同会 ， 则为艺术 、 传播 。 宜以此为业生 财 。 
经商者 ， 则多为承继现在事业 ； 应以商誉为重 。 若 建立商业后即妄自尊大 ， 即立 
生破败 ， 或引起重大风波 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天梁独坐 ， 与天机相对 ， 财帛动荡 。 唯左辅 右弼夹者 ， 始主能积存 。 
丑未天梁 ， 有昌曲夹 ， 一生名大于利 。 故求利不如 求名 。 
丑未天梁 ， 以丑宫优于未宫 ： 此与子午宫同意 。 
丑未天梁会太阴化禄 ， 主有现成事业或 遗产承继 。 天巫躔天梁 ， 或躔太阴者尤确 。 
丑未天梁不成 『 阳梁昌禄 』 格 。 但日明并照 ， 亦成格 局 。 在未宫者 ， 曰月反背 ， 
必须见吉化始可补救 。 但仍主在是非纠纷困扰中进财 。 且得财后必有破耗随来 。 
丑来天梁 ， 见太阴化科 ， 则天机必同时化忌 ， 主因 财受谤 。 未宫者尤甚 。 故得 
财亦不宜张扬 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天梁与天同相对 ， 主白手兴家 。 若禄马交驰 ， 决主一生财源在于异域 。 
由于天同的影响 ， 主早年以至中年财帛难聚 。 纵有 祖业亦不克享 。 唯若左辅右 
弼 ， 一居命宫 ， 一居财帛宫者 ， 则主定有祖业承继 。 或必有主理现成事业的机会 。 
巳亥天梁落 陷 ， 财源不广 ， 亦较难积聚 ， 此亦由于本身对财帛并不重视 ， 宁愿 
重视精神享受有关 。 然而凡得财必主劳心费神 ， 以致引 起矛盾 ， 为本星生活费居财 
帛宫 的最大缺点 。 
巳亥天梁若先名后利者 ， 对上述缺点即可弥补 。 故 最宜见昌曲交会 ， 亦宜化科 。 
若会天同化忌 ， 只宜专业人士 ， 或零售业亦可 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀守财帛宫 ， 主掌财权 。 这种掌财权的性质与天 府不同 。 大致而言 ， 天府 主 
守 ， 七杀主攻 。 天府主在现成 局面下发展 ， 七杀则主创出新局面 。 一一由于天府与 
七杀 永远相对 ， 所以虽各具不同本质 ， 然而亦互相影响 ， 故 主 
守者亦有故势 ， 主枚者亦有守势 。 主攻者亦有守势 。 彼此相成相因而不离其本质 ， 
故在其他星电会合下 ， 天府亦可能变为以攻为守 ， 七杀亦可以变为以守为攻 。 在推 
断时对此应仔细分别 。 
关于七杀守财帛宫 ， 本派传有一首歌诀 ： [ 寅申子午 能横发 ， 即酉得财亦耗磨 ， 
辰戌二宫为富局 ， 丑未积财巳亥多 。 ] 由此歌诀可见 ， 凡七杀守财帛宫 ， 本质皆为富 
局 ， 仅 卯酉二宫陷地 ， 横发后亦易消磨殆尽 ， 然而亦曾一度成富 
也 。 坟 本不喜 七 杀坐财帛宫 ， 至少不许为富局 ， 实误 。 
七杀成富 ， 首要条件为得禄 ( 此点与天府相同 ) 。 禄 存或同会化禄均可 。 盖必须 
得禄 ， 然后所掌财权始成局面 。 否则虽掌财亦仅主范围极小 。 
七杀喜见禄 、 权 、 科会 。 更加辅佐诸吉 ， 即掌财赋 大权 。 
然而 七 杀守财帛宫 ， 亦与守命宫相同 ， 一生必有一 次波折 。 故必须经历风险而 
成富 。 唯若投机失败 ， 则甚难渡过风险 。 
若 七 杀有禄 ， 且见吉曜而无煞 ， 则经风险亦可夷然 ， 能在友人帮助下东山复起 。 
但若无吉有煞 ， 或吉少煞重 ， 则经风波后恢复元气维艰 。 投机荷且主一蹶不振 。 
七 杀见禄马交驰 ， 又见禄杈科会及辅佐吉曜者 ， 在 现代 ， 往往为跨国机构掌财 
权人物 。 局面小者亦得掌远方财 。 
七 杀与空劫 、 大耗同度相会 ， 谋财费力 。 且得财同 时亦生破耗 。 更见天刑 ， 则 
不宜偏门行业 ， 否则主易犯官司刑法 。 
七杀躔擎羊主争夺 ； 躔陀罗主招忌 ； 躔火铃则丰横 发横破 。 
七 杀会煞曜重重 ， 且见刑耗 ， 或文曲化忌者 ， 主一 生易招盗贼 。 
凡 七 杀在财帛宫 ， 则田宅宫必是太阴 ， 若太阴落陷 ， 火昨遭到度 ， 而七 杀又见 
煞耗者 ， 则须防火灾 或兵灾 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫 七 杀独坐 ， 对宫 『 武曲天府 』 ， 见吉化或禄存 者 ， 常得意外财 。 唯此意外 
财并非由非法途径得来 。 
子午七杀躔火铃 ， 则主冒险犯难之财 ， 且不易积聚 。 
子午 七 杀无占化吉曜 ， 一生至少亦得一次意外财 。 须注意保存元气 ， 因为机会难 
再 。 武曲化忌者 ， 则破败后只能慢慢培养元气 ， 稍急躁即环境更劣 。 
七 杀在寅申二宫独坐 ， 对宫为 『 紫微天府 』 ， 亦主横 发 。 其性质可参考子午二宫 。 
唯若紫徽化权 ， 则恐因弄权而致倾败 。 喜会紫微 化科 、 天府化科 ， 则虽不横发 ， 
但风波亦小 。 且常主其人在财政营运上 ， 倾向 于以守为攻 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申 七 杀见禄马交驰 ， 主一生必至少有一次事业 上的重大改变 。 此改变且倾向于 
良好的 转变"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌 七 杀独坐 ， 对宫为 [ 廉贞天府 ] ， 若见吉化吉曜 ， 亦主富裕 。 且擅长于以财和 
再 ， 但却不宜投机赌博 ， 否则必生破败 。 
辰戌七杀会谦贞化禄 ， 一生财帛不安 ， 收入纵多 ， 支出亦大 ， 或人口不安 ， ’ 或常 
遭盗贼 ， 或因疾病 。 无煞有吉同会者 ， 则程度不重 。 
辰戌 七 杀见廉贞化禄 ， 则一生常得意外财 。 见破军 化禄 ， 则事业不只一端 ， 财 
源来自多方面 。 
辰戌宫 七 杀会贪狼化禄 ， 于运限吉时 ， 常有意外财 ， 但运限一过 ， 便立即呈胶 
着状态 ， 一此时只能持盈保泰 ， 不可妄求发越 ， 否则反主破败 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守财帛宫 ， 不擅理 财 ， 其本质为开创财源 。 其 开创财源的方式亦与常人不 
同 。 唯财源开创之后 ， 跟随者亦必众 。 有煞 ， 且易引起极大竞争 ； 无煞 ， 则虽有跟 
随者亦影响不大 。－ 一天机守财帛亦筒类似性质 ， 不同的是 ， 天机所得者为现成机 
会 ， 但无人过问 ， 一旦过问却引起竞争 。 此与破军之自行创造机会不同 。 
破军守财帛宫 ， 有多方面的财源 。 
破军火星同寓 ， 亦主横发 ， 其横发性质与 『 火贫 』 、 『 铃贪 』 不同 。 贪狼所得之 
财 ， 有得诸意外 ， 不期 而 得的性 质 ， 但破军所得者 ， 却因开创财源而致 。 
破军喜与禄存或化禄同度 。 倘破军本身化禄 ， 则必 兼行兼职以生财 。 有 禄 ， 固 
主收入丰厚 ， 亦主财源较为稳 定 。 
破军守财帛宫者 ， 多主转变行业然后始能致富 。 即 使见煞忌 ， 转行之后亦可改 
善环境 。 若见禄权科会 ， 则其转变必出于突然 。 一一故破军化禄 ， 或会禄极科者 ， 
最喜见魁钺 ， 则一生多机会 。 
破军与擎羊同宫 ， 亦主横发 。 但此机警发带有争夺 的意味 ， 即由横夺而来 。 故 
葱起是非纠纷甚大 ， 若有宅劫 、 刑耗 ， 则主横得横失 。 
破军守财帛宫 ， 主先破后兴 。 唯若无吉化吉会 ， 且 见煞曜者 ， 则破败之后 ， 其 
复兴亦敏感外强中干 。 
破军与武曲化忌同躔 ， 常感财力不足 。 若勉强周张 ， 则不但东挪西补 ， 而且 愈 
图改变愈加速破败 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 子午宫破军 ， 对宫为 [ 廉贞天相 ] ， 最喜廉贞化 禄 ， 则破军必同时化权 ， 主权力 
与财帛俱增 ， 名利双收 。 
唯若破军无禄 ， 仅见辅佐诸吉 ， 而煞曜亦不重者 ， 则一旦掌权 ， 破耗立至 ， 必 
须重新整理业务 ， 然后始能恢复旧观 。 
若有煞忌空劫 ， 同破财损耗极大 。 而且往往功败 垂成 。 
子午破军有吉化吉曜 ， 则先有名然后有利 。 虽名大 于利 ， 然而亦必富裕 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫破军 ， 对宫为 [ 武曲天相 ] 。 若武曲化忌者 ， 主寅吃卯粮 。 
寅申破军 ， 必先破尽祖业然后兴家 ， 纵使禄权科会 者 亦然 。 
寅申破军 ， 对宫天相为财荫夹者 ， 必有祖荫 ， 然而 必不守 。 刑忌夹者 ， 则反主 
有薄资 。 但二者发展 ， 却以前者为大 。 
寅申破军见化忌 ( 贪狼化忌例外 ) ， 发财之后必有 破耗随来 。 
寅申二宫破军 ， 常有坏方向的改变 。 纵有吉曜 ， 如 无禄存化禄 ， 亦常主一起即 
蹶 。  """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌宫破军落罗网 ， 对宫为 『 紫微天相 』 ， 必须有一 次突破然后始得成功 ， 纵会 
占化吉曜者亦然 。 
辰 戌 破军喜魁钺夹 ， 或对宫魁钺夹 ， 则一生多发展 或创新的机会 。 
辰戌破军见煞忌刑曜 ， 则每况愈下 ， 故每须详大 运流年而定进退之机 。 
辰戌破军最不喜陀罗同度 ， 则主有突破机会亦易失 却 。 
辰戌破军与空劫同度 ， 主财转困难 ， 故极不宜经商 。 有时分期付款购物亦须小 
心 ， 可能因此左支右出 。"""
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "亥" or dizhi == "丑"):
            tmp = """破军在亥子丑三宫 ， 皆不宜文曲化忌同度 ， 主生重 大破败 。 如更见煞曜刑耗冲 
会 ， 则主倒闭或倾家 。"""
            print(tmp)
            print("\n")

def GongXia6th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫徽 属土 ， 主阴分 ， 故于脏腑为脾 。 人身吸收营养 ， 专赖 脾土营运 ， 所以由紫 
微即可知其吸收营养情况 ， 倘为 [ 在野 ] 或为 [ 孤君 ] ， 均易因脾土弱而致血气两亏 。 
紫微见虚耗 、 昌曲 ， 则因脾土而影响肠胃 ， 表征为呕 吐 、 腹泻 。 轻则为气胀胸 
闷 。 见空劫为心气痛 。 
若见辅佐诸曜重重 ， 则脾土应防过亢 ， 不但易摄取营 养过分 ， 且脾土过强 ， 亦 
影响心肾 。 此以心属火 ， 火受强土所绁 ； 肾属水 ， 水为强土所克 ， 失去平衡 ， 便易 
滋和心 肾疾患 。 且脾土本身过强 ， 亦主胃病 。 
紫微与桃花诸曜同度 ， 或得桃花诸曜朝拱 ， 主色欲 ， 亦主妇女暗病 。 倘星盘中 
有肾病的星曜且合 、 则可断为因色事而致亏损 。 
"""
        print(tmp)
        print("\n")
        if(star == "紫薇贪狼"):
            tmp = """于紫微诸星系中 ， 尤以 『 紫微贪狼 』 的组合最主色欲 。 见辅佐诸曜 ， 亦不能减 
轻此特徵 。 故见煞即主肾病 ， 以五行言 ， 则因贪狼属阳木 ， 又属水 ， 木绁水 ， 而紫 
微土则来克水 ， 肾属水 ， 受到重重克浅 ， 故主有疾 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇破军"):
            tmp = """『 紫微破军 』 亦有肾病的倾向 ， 盖破军属水 ， 与紫微同 度 ， 不受土克也 。 唯与 [ 紫 
贪 ] 的性质又有不同 。 『 紫贪 』 何贪 狼木 ， 可以引起肝阳上亢 ， 为喜色欲之根源 ， 所 
生肾病必为亏损 ； 而 『 紫破 』 则属为土水相克 ， 故主肾经暗病 ， 女命 尤主妇科暗病 。 
倘 [ 紫破 ] 见桃花及煞曜 ， 则为性病 ， 尤主皮肤痕迹 。 无桃花 ， 则为脾土受湿所 
致之皮肤病 。 """
            print(tmp)
            print("\n")
        elif(star == "紫薇天府"):
            tmp = """紫 微天府的组合 ， 两颗属土的主星同度 ， 故主脾胃肠 脏疾患 。 得百官朝拱 ， 则脾 
土过重 ， 见桃花虚耗 ， 则亦色欲 。 
若 『 紫府 』 与火铃同度或对冲 ， 且见武曲化忌来会 ， 则 为消化器官溃疡 、 瘤肿 
之疾 ， 若更见天月 、 血蛊 、 天虚 、 阴煞等杂曜 ， 则有发展为癌症的倾向 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇天相"):
            tmp = """紫微天相的组合 ， 由于天相属水 ， 故主糖尿 、 肾石 、 膀胱石 ， 即属于 『 水道 』 
系统的疾病 。 见空劫 ， 可为前列腺 、 摄护腺的疾患 。 见火铃 ， 则为脾土受湿 ， 发展 
为皮肤过敏 ， 如风疹之类 。 
若 『 紫相 』 会武曲化忌 ， 则为动手术之兆 ， 特别主肾 部开刀 ； 然而有时却为骨 
癌之兆 ， 须详 杂曜而定 。 一 － 凡杂曜见天德 、 阴煞 、 天刑 、 天虚 、 大耗 、 天月 、 劫 
煞者 ， 皆有助于癌病的确定 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇七杀"):
            tmp = """[ 紫徽 七 杀 ] 主脾土不养肺金 ， 故主胃纳不佳 ， 影响肺 脏或呼吸系统 “ 然肺与大 
肠互为表裹 ， 故亦可发展为肠病 。 
『 紫杀 』 见武曲化忌 ， 则 防跌扑损伤 ； 见谦贞化忌者 ， 为血症 ， 或为血光意外 ； 
倘桃花重重 ， 而廉贞化忌 ， 则为性病 ， 或为脓血 。 
『 紫杀 』 见煞 ， 主因胃纳过佳而引致肠胃病 。 叵火铃同 度 ， 则为溃疡 。 
凡紫微星系 ， 擎羊同度 ， 更见天刑 ， 皆主手术或物理 治疗 。 与擎羊同度主包皮 
过长 ； 女命则主阴冷暗病 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机属木 ， 主肝脏 。 又主四肢 ， 尤主手指足趾 。 此以 木之枝条 ， 譬如手足也 。 
故天机落陷 ， 更见煞 ， 主手足受伤 。 若入庙见煞 ， 则 多主肝病 。 
肝木可克脾土 ， 所以天机过旺 ( 如化禄 、 权 、 科 ) ， 则 主肝阳上亢 ， 以致胃纳不
佳 。 
天机见 疾厄宫 者 ， 亦主幼年何惊风等疾 。 煞忌重重 者 ， 则 主幼年多灾病 。 倘更 
落陷 ， 则主受伤 ， 尤以手足为 然 。 
天机入庙见左辅右弼 ， 有时为骈指之应 。 
女命天机与桃花诸曜同度 ， 则为阴虚 ， 亦主子宫不 正 ， 经期不准 ， 时因此以致 
不孕 。 
男命天机与桃花诸曜同度 ， 则为肾水与 肝术失调 ， 以 致心肾不交 ， 亦可视为内 
分泌失调 。 由 此引发诸般虚损 。 
天机又主思虑 ， 故若化忌 ， 或与天同化忌拱会 ， 则主 神经衰弱 ， 亦主肝阳上亢 。 
凡天机守疾厄宫 ， 皆不喜擎羊 、 天刑同度 ， 主肠胃 手 术 、 若蜚廉 、 天月同度 ， 
则为虫疾 ， 且常倾向手患肝虫 。 与 天梁同度时 ， 更易克应 。  
若天机天梁同会 ， 太阴化忌 ， 天机必同时化禄 ， 天梁 必同时化权 ， 此吉化不足 
以消解疾病 ， 反而因太阴化忌的关系 ， 表现为阴虚阳亢 。 于年老时 ， 表现为视力及 
听觉皆 衰退 ， 且易中风 ， 以致手足瘫痪 。
"""
        print(tmp)
        print("\n")
        if(star == "天机太阴"):
            tmp = """『 天机太阴 』 ， 若太阴落陷 ， 则为肾水不足以养肝木 ， 故易表现为神经系统疾患 。 
女命亦主内分泌失调 。 
若天机太阴同度或对拱 ， 而天机及太阴皆落陷者 ， 则 为虚不受补 。 见煞 ， 则为 
先天不足 ， 阴阳两分皆亏损 ， 表现为诸般弱症 ， 或主暗疾 。 """
            print(tmp)
            print("\n")
        elif(star == "天机巨门"):
            tmp = """『 天机巨门 』 守疾厄宫 ， 巨 门主 消化系统 ， 受肝木所 克 ， 故为肝胃不和 ， 表现 
为气痛 、 胸闷 、 腹胀等症候 。 巨门化忌者尤甚 ， 若煞重 ， 则为胃下垂 、 胃神经痛等 。 
煞忌交躔 ， 则主肠胃风痛 、 下痢等疾 。 """
            print(tmp)
            print("\n")
        elif(star == "天机天梁"):
            tmp = """天机 、 天梁的组合 ， 见羊陀天刑 ， 为盲肠炎 ； 再见火 铃 ， 而天机化忌者 ， 主胃 
神经痛 ， 或胃溃疡 。 杂曜又 不 吉 者 ， 可能发展为胃癌 ； 女命亦则为乳癌 。 
天 
机天梁见煞忌 ， 而桃花昌曲诸曜并集 ， 又见虚 耗刑 月等杂曜 ， 则女命为子宫癌 ， 轻 
亦主子宫病变 。天机天梁的组合 ， 女命又主易流产 、 小产 ， 火星天马 同度者更确 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳属火 ， 为阳明 。 故太阳入庙 ， 必主阳明火盛 ， 易 晕眩 ， 有头风 。 此即所谓血 
夺过高也 。 一一太阳所主之晕眩与天机不同 ， 天机为肝风 ， 与阳明晕眩有别 。 
太阳为南离之火 ， 故又主眼目 ， 凡太阳守疾厄宫 ， 必 有目疾 ， 如近视 、 散光之 
类 。 尤不喜在午宫 ， 则阳光过盛 ； 亦不喜在戌宫 ， 嫌日已西堕 ， 皆主目疾 。 见煞 ， 
每主动眼部手术 ； 煞忌重重 ， 又与天刑 、 天月 、 空劫 、 伏兵 、 蜚谦诸曜同会者 ， 每 
主失明 。 尤不喜同会文昌文曲化忌 。 
阳明火盛则影响肺经 ， 故文呼吸系统疾患 ， 或大甩燥 结 。 由大甩病患引伸 ， 则 
为痔疮 、 便血 。 陀罗同度 ， 多主肺经疾患 ， 擎羊同度则为大肠 。 一一依中医王里沦 ， 
肺与 大 肠互为表裒 ， 故二背有关 ， 但亦有细 别 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阳太阴"):
            tmp = """太阳 、 太阴的星系 ， 在未宫及辰宫者 ， 阳明火盛而阴 分不足 。 在丑宫及戌宫者 ， 
则多虚阳上亢 。 前者为内分泌失调 ， 后者则表现为头风或偏头痛 。 尤不喜太阳化忌
或太阴化忌 ， 皆主眼目疾 ， 或肝胆经疾 。 
若太阳太阴与空劫同度 ， 更见煞照 ， 又见天刑 、 天伤 者 ， 主 驼背 ， 煞轻则为寒 
背 。 亦主患破伤风 。 
阴阳昌曲交会 ， 而昌曲任一化为忌星者 ， 亦主眼目 疾 。 若阴阳辅弼交会 ， 而阴 
阳任一化为忌星者 ， 则主大细眼 ， 或两目视力不平衡 。 
阴阳昌曲火铃六曜交会 ， 更见煞忌 刑 曜 ， 及天月 、 阴 煞 、 华盖 ， 则为严重内分 
泌失调 ， 其重者 ， 可致身体部分畸型 ， 或有器官生长异彤 ( 如心脏二尖瓣狭窄之类 ) ， 
或半 身不遂 。  """
            print(tmp)
            print("\n")
        elif(star == "太阳巨门"):
            tmp = """太阳 、 巨门的星曜组合 ， 不喜太阳落陷 ， 否则为阳分 不足 。 表现为低血糖 、 低 
血压 ， 或易手足冰冷及诸般弱症 。 
若太 阳 人庙 ， 有煞 ， 则为口腔 、 食道疾患 。 亦易患头 风及高血 压 、 高血糖 。 
若巨门化忌 ， 则为火灼金伤 ， 易患呼吸器官疾患 。 见空劫同度 ， 则为肺气肿 。 
太阳巨门 ， 与陀罗 、 天刑 、 天月同度 ， 亦易发生半身不遂 。 """
            print(tmp)
            print("\n")
        elif(star == "太阳天梁"):
            tmp = """太阳 、 天梁的组合 ， 最易成为内分泌失调 ， 如甲状腺 肿大之类 ( 俗称大颈泡 ) 。 
倘煞忌重重会合 ， 火铃同度 ， 见天虚 、 阴煞 、 天月 、 大耗 、 天德 、 天刑诸曜 ， 
女子主患乳疮 、 乳癌 ， 男子主患胃疮 、 胃癌 。 
太阳天粱亦主心脏 ， 及脑部疾患 。 然本质却与太阳太 阴的星系不同 。 阴阳星系 
为心肾不交 ， 阴阳失调 ， 以致怔忡 、 失眠 ， 引起心疾 ( 古代以脑部亦属心疾 ) ， 而阳 
梁则由 器官病变引 发 。 如血管栓塞即是一例 。 
太阳天梁有煞 ， 亦主食物中毒 ， 或吸毒 。 以见火铃 、 阴煞 、 天月 、 虚耗等曜为 
然 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲属金 ， 主呼吸器官疾患 。 
金气肃杀 ， 故又主损伤 。 尤其是武曲 ， 七 杀的组合 。 然凡武曲守疾厄宫 ， 有擎 
羊 、 陀罗 、 天刑等曜 ， 皆有动手术或损伤的倾向 。 与火铃同度 ， 亦主受金属创伤 。 
武曲与火星 、 天马 、 哭虚同度者 ， 主鼻衄 ， 更见空劫 ， 则为肺支气管炎 、 气管 
炎 、 痨病之类 。 煞轻则主咳嗽 。 
武曲守疾厄宫 ， 亦主幼年易患百日咳 ， 晚年则易惹风 痰 。 
若武曲与羊陀同度 ， 又有火星 ， 则火炎伤 金 ， 决 主 呼吸器官病患 。 更见武曲化 
忌 ， 又会杂曜不吉 ， 则为肺癌 、 甩 癌或气管严重病变 。 天马同度 ， 防癌症扩散 。 
最具瘤肿 、 溃疡以致癌症倾向的星曜组合 ， 为武曲与 七杀及武曲与破军 。 尤不 
宜火星 、 天马同度 ， 武曲化忌 ， 以及见天德 、 天伤 、 天刑 、 天虚 、 大耗 、 阴煞 、 劫 
煞等杂曜 。 
"""
        print(tmp)
        print("\n")
        if(star == "武曲七杀"):
            tmp = """武曲 七 杀又主小儿麻痹 、 疯狗症 ； 武曲破军则为牙 病 ， 尤主牙周病 。 
一一流年见此组合 ， 则防意外损伤 ， 如木压 、 雷惊 ( 在现代可视为触电 ) 。 又主 
因盗受伤 。  """
            print(tmp)
            print("\n")
        elif(star == "武曲天府"):
            tmp = """武曲天府 的组合 ， 见忌星及煞曜 ， 则为水厄 。 然亦主哮喘痰涌 、 肺气肿 。  """
            print(tmp)
            print("\n")
        elif(star == "武曲天相"):
            tmp = """武曲天相及武曲破军 ， 见 煞 ， 主破相 ， 防跌撞意外及 发炎 。 尤以面部为然 。
武曲天相又主疮瘢 、 植皮手术 ， 又主小肠痛症 。 
『 武曲天相 』 同度 ， 其破相必在不经眼之处 ， 如下巴 、 发际 、 或舌头破损 。 
武曲天相亦主暗疾 。 女命尤防子宫及生殖器官病变 。 
武曲化忌 ， 天相同度或对拱 ， 更见火铃 、 天马 、 空劫 ， 则 为肠瘤 ， 以致癌症 。 
轻则为肠炎 。 
唯 [ 武曲天相 ] 对破军 ， 或 『 武曲破军 』 对天相的组合 ， 若见煞忌刑耗及恶曜重 
重 ， 有时可发展为骨髓病变 ， 或至血癌 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲破军"):
            tmp = """武曲天相及武曲破军 ， 见 煞 ， 主破相 ， 防跌撞意外及 发炎 。 尤以面部为然 。
武曲天相又主疮瘢 、 植皮手术 ， 又主小肠痛症 。 
『 武曲天相 』 同度 ， 其破相必在不经眼之处 ， 如下巴 、 发际 、 或舌头破损 。 
武曲天相亦主暗疾 。 女命尤防子宫及生殖器官病变 。 
武曲化忌 ， 天相同度或对拱 ， 更见火铃 、 天马 、 空劫 ， 则 为肠瘤 ， 以致癌症 。 
轻则为肠炎 。 
唯 [ 武曲天相 ] 对破军 ， 或 『 武曲破军 』 对天相的组合 ， 若见煞忌刑耗及恶曜重 
重 ， 有时可发展为骨髓病变 ， 或至血癌 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同属水 ， 故主膀胱水道之疾 ， 包括疝气 、 淋病 、 尿 道 、 肾脏等排泄系统疾患 。 
由于水绁金气 ( 天同又属金 ) ， 故天同亦可引发气管 、 支气管疾患 。 以此见陀罗 
同度为确 。 
天同主享受 ， 若化忌 ， 则主泻泄 。 若与太阴同会者 ， 则为阴虚不足 ， 表现为虚 
泄 、 下痢 。 桃花诸曜同度则为梦遗 ， 或夜尿 。 均主肾气不足 。 
天同与火铃同度 ， 若天同落陷 ， 更见空劫 ， 则为膀胱 尿道发炎 ， 或前列腺 、 摄 
护腺病变 。 见天月者 ， 先天肾气不足 ， 易生蛋白尿 。 
天同 与天马同度 ， 主气虚 。 若更见煞 ， 则为气衰亏损 ， 易生诸般弱症 。 
天同太阴的星曜组合 ， 主湿气 ， 可发展为水肿 、 腹水 。 火铃星同度 ， 则为湿火 
留筋 ， 以致四肢 痛楚 。 
若太阴化忌 ， 则为阴虚亏损 。 或水泛木飘 ， 以致肝炎 性腹水 。 一调治之道 ， 必 
须肝肾两顾 。  
"""
        print(tmp)
        print("\n")
        if(star == "天同巨门"):
            tmp = """天同巨门的基本性质为管道 ， 故主食道 、 气管 、 肠脏 疾病 。 亦主神经痛 。 盖神经 
为人身最微细的管道也 。 
若煞忌刑耗齐集 ， 则可发展为骨髓疾病 ， 或白血球过 多 。 
一般情形下 - 天同瓯门何煞 ， 或写 ! 劫同度 ， 均主骨 殖变异 ， 或退化 ， 或增生 ， 
以致冲经受压 ， 产生疼痛 。 火铃同度者尤甚 。 若天刑 、 天月同度 ， 则可能为终身疾 
患 ， 如先天骨髓畸变之类 。  """
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """天同 、 天梁星系 ， 古人认为主 『 下部 疾 』 ， 即排泄系统 及生殖系统疾病 。 此 以天 
同化忌者主克应为多 。 
若见煞 ， 尤其是见火铃 ， 则主肝气痛或心气痛 。 唯若 刑煞忌并见 ， 又有天月 、 
天德 、 天马等曜 ， 则主心肌栓塞 。 
天同天梁亦主疝气 ， 此以与空劫同度为克应 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞属阴火 ， 故主血 。 凡廉贞所主病患 ， 大致上皆 与血分有关 。 
古人以为 『 男重精 ， 女重血 』 ， 故廉贞亦主精液 。 视是 否不孕 ， 无论于何宫度 ， 
前人皆视廉贞 。 见火铃空劫于陷乡 ， 如恰值大限子女宫 、 疾厄宫 、 命寓 ， 皆定为不 
孕 。 
由血类推为精 ， 则为梦遗 、 手淫 、 精子不足等病患的 克应 。 
故廉贞化忌 ， 便视为血疾 。 固主咯血 ， 亦主凶意外 而 见血光 。 
由此引伸为脓血之灾 ， 故又推断为疮癞 、 梅毒 、 淋病 之类 。 最温和的克应则为 
暗疮 。 若凶煞道重 ， 且见武曲化忌 ， 则为血癌 。 
于女命 ， 推断为经血枯少 、 白带 、 经期不准之类 。 
廉贞化忌最不宜与武曲化忌冲会 ， 若冲会 ， 则为意外 血光之灾 。 灾厄大小 ， 兼 
视命宫 、 福德宫而定 。 
古人之疾病理论 ， 分阴阳表裹 。 血属阴 ， 为裹 ， 与之 相对者则为气 。 气属阳 ， 
为表 。 表里相依 ， 因之由廉贞亦 可视气分疾患 。 
故廉贞亦主感冒 、 咳嗽 、 肺病之类 。 以见火星 、 陀罗 为重 。 
于各星系中 ， 以廉贞 、 七 杀的星系 ， 尤主呼吸器官疾 病 。 最常见者为鼻敏感 、 
鼻窦炎等 ， 以有煞同度为是 。 若煞重 ， 则为肺病 、 肺炎 。 天月同度则为百曰咳 、 痨 
病 。 
廉贞对四化及煞曜异常敏感 ， 须注意大限 流年 彼此冲 会的情况 。 大致而言 ， 最 
不喜见武曲化忌 ； 亦最艮氓键 、 陀罗同躔 。
"""
        print(tmp)
        print("\n")
        if(star == "廉贞天相"):
            tmp = """廉贞 、 天相的组合 ， 主糖尿 ， 亦主膀胱石 、 胆石 、 肾 石 。 亦以见煞忌为是 。 
若廉贞天相与火铃同度 ， 或与空劫同度 ， 则为皮肤敏 感 、 皮肤显影疹 。 严重者 
则为狼疮 。 
倘廉贞天相为刑忌所夹 ， 则为管道闭塞 ， 须注意各器 官管道 ， 及内分泌腺 ， 有 
时病变又在骨髓 。  """
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """廉贞破军与煞同度 ， 亦主结石 。 
若火星同度 ， 则为意外受伤 。 与文曲化忌同度 ， 则主水厄 。 
凡 『 廉破 』 所罹 之意外 ， 皆 主头面 受伤 ； 符 『 廉杀 』 ， 则 防伤骨 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞贪狼"):
            tmp = """廉贞 、 贪狼的星曜组合 ， 有 煞忌 ， 决 主 生殖器 。 生殖系统疾患 。 亦主肾病 。 倘 
廉贞化忌与贪狼化忌同度或对拱 ， 则为肾血两经疾患 ， 互相影响 ， 易成种种病变 。 
最坏的情况 ， 为肾脏机能破坏 。 轻者为尿毒 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府属阳土 ， 于脏腑为胃 。 所以紫微守疾心寓主泻 泄 ， 而天府则不然 。 冈泻泄 
乃脾腑之疾 ， 不关肠胃 。 此类细微分别 ， 必须略有中医知识 ， 然后始能推断 。 
天府守疾厄宫 ， 若为 [ 府库空露 ] 者 ， 可推断为消化力 不足 ， 消化机能失常 ， 又 
见紫微 、 天月 ， 则为闭口 痢 。 有 时又表征为饮食机能受到障碍 。 
倘如天府有禄 ， 或化为科星 ， 则为实性胃病 ， 如属于 热性的胃病 、 胃炎之类 。 
倘廉贞带煞来会 ， 或廉贞化忌 ， 则为胃出血 。 无煞 ， 则于廉贞属火 ， 火土相生 ， 一 
般仪属胃 热 ， 胃热日久则转化为湿热 。 
然而天府却常易受其他星曜影响 。 故与武曲同度 ， 天 将土生武曲金 ， 便不表征 
为胃病 ， 反而表征为肺经之疾 ， 即以武曲为主要推断 。 此种性质 ， 又不仅限于正曜 ， 
有时与天府同度的杂曜 ， 亦可发生影响 。 例如陀罗同度 ， 可表征为喉病 ； 月德 、 天 
月同度 ， 则为便血 。 凡此皆应仔细征验 。 一一陀罗 、 铃 、 铃星二曜与天府同度 ， 常 
主胆病与喉病的表征 ， 仅在于有无铃星同蹿耳 。 此即为应仔细征验之一例 。 
天府与廉贞 、 七 杀相对 ， 天刑同度或对拱 ， 却主跌扑 损伤 。 若火铃躔天府 ， 则 
为肠胃损伤 。
"""
        print(tmp)
        print("\n")
        if(star == "天府廉贞"):
            tmp = """天府与廉贞同度 ， 有时仅主呼吸器官疾患 ， 并由此转 为弱症 ， 例如哮喘 。 转为 
弱症的克应 ， 为天月 、 阴煞等同度 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴属阴火 ， 故主亏损 。 一般而言 ， 主肾脏或主神经系统 。 
在中医理论 ， 严重的神经衰弱 ， 稍为心肾不交 ， 以致 出现身体虚弱的情况 ， 所 
以其实神经系统疾患 ， 亦与肾脏有关 。 不过所表徵者 ， 并非肾炎等实质病变而已 。 
这种情形 ， 尤以天同的影响为最 ， 其次则为天机 ， 然 而二者却又有别 。 大致而 
言 ， 天同较具体表徵为肾病 ， 天机则较具体表征为神经 。 
由字肾弱 ， 所以亦可发展为眼病 ， 一如自内障 、 飞蚊症 等 。 此以文昌或文曲化 
忌 ， 见煞曜的情形较严重 。 笔者见过一个命例 ， 所患者为 f 视网膜色素细胞退化 ] ， 
目前仍属不治之症 。 此类病例较少见 ， 但断为斑点性眼病则仍属准确 。 
天机的影响 ， 则为盗汗 、 阴虚 、 记忆力退化之类 。 然当见煞忌时 ， 亦可表徵为 
妇女 暗病 ， 及男子早泄 、 遗精之类 。 
若太阴 、 天机 ， 受天同化忌的影响 ， 更有煞曜及天虚 、 阴煞 、 华盖 、 天马诸曜 ， 
则为阴痿 。 
太有又主水湿之疾 ， 故为泻痢 、 鼓胀 。 以见天机化忌 或贪狼化忌 ， 有煞同躔之 
年限为克应 。 若文曲化忌同度 ， 则为斑疹 、 皮肤湿热 、 癣疥等疾患 。 
太阴若化为忌星 ， 更加天虚诸曜 ， 有龙池同度 ， 晚年 主重听或耳聋 。 此乃肾气 
不足之患 ， 与七 杀龙池之主损伤 性耳病不同 。 
太阴化禄 ， 于年限化为忌星 ， 则主阴虚 ， 亦可转化为 肾阳不足之疾患 。
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼属阳木 ， 又属水 。 故于疾病 ， 为肝病 ， 又 主生殖 系统疾患 。 
凡贪狼与紫微同度或相对 ， 与廉贞同度或相对 ， 皆有 生殖系统疾患的倾向 。 唯 
火星 、 铃星同度者 ， 皆主肝病 ， 此乃由煞曜性质影响之一例 。 
若贪狼蹿疾厄宫 ， 擎羊火星同躔 ， 或陀罗铃星同躔 ， 主脓血之疾 。 
会廉贞化忌 ， 女主血崩 ， 男主遗精 ， 重者则主阳痿或 早泄 。 见天虚 、 阴煞 、 天 
伤者尤确 。 
紫微贪狼的基本性质虽主色欲诸疾 ， 惟以贪狼化忌者 始确 。 所谓色欲诸疾 ， 男 
主阳痿 、 早泄 、 阳亢 ； 女主阴冷 、 子宫阴冷 、 子宫不正等 ， 与生殖器官疾患不同 。 
生殖器官疾患 ， 指发炎 、 瘤肿之类 。 
贪狼火星同度 ， 为痔疾 。 更加擎羊 ， 则为痔漏 。 
贪狼与廉贞对拱 ， 有火星在三方相会 ， 为肝肠上亢 ， 肾水不足 。 
贪狼与武曲对拱 ， 金木相克 ， 若火星与贪狼同度者 ， 病源为阳明火盛 ， 以致伤 
害肺经 。 若火星与武曲同度者 ， 则为肺经本身病患 ， 与阳明火亢无关 。 如肺炎 、 肺 
痨即是此类 。 
贪狼亦主自蚀 ， 或皮肤有白癣瘢 。 
贪狼与文曲化忌同度 ， 则为目疾 。 
贪狼火星 ， 或贪狼擎羊 ， 主肝炎 ， 有鼻头发红之克应 。 
女命贪狼 ， 见煞 ， 亦主肝风头痛 、 头晕 。 

贪狼亦主胆病 、 惊风之类 ， 以火铃同 躔 为确 。 见天刑 、 天月 ， 则为肝疾 ， 病不 
在胆 。 
"""
        print(tmp)
        print("\n")
        if(star == "贪狼武曲"):
            tmp = """贪狼与武曲 、 文曲同度 ， 若武曲化忌 ， 又有煞 ， 主意 外损伤 ， 若文曲化忌 ， 则 
主 水厄 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门属阴土 ， 故主消化系统 ： 又属阴金 ， 故主呼吸系 统 。 其分别 ， 前者以见禄 
存 、 化禄为徵兆 ， 后者以见天同 、 火星为征兆 。 
巨门化忌 ， 病在食道 、 鼻咽 ， 以及气管 、 肺经等 。 最 轻为口疮 、 痹滋 。 见煞刑虚 
耗为重 ， 见煞少 ， 杂曜又吉者 则轻 。 
天同 、 巨门的星系结构至为复杂 ， 既 呼 吸系统疾患 如前述 ， 然而又主坐骨神经 
痛 、 骨殖增生 、 骨殖退化诸患 。 以铃星 、 空劫等为克应 。 
若巨门化忌 ， 擎羊 、 陀罗同度 ， 又见天刑 、 天德 、 天 月 、 天 虚 、 天伤 、 阴煞等 
曜 ， 则主胃癌或食道癌 、 鼻咽癌 。 
若如前述 ， 唯非羊陀同度 ， 而为火铃同度 ， 则为阴疽 、 肺 病 。 更见凶曜则为肺 
癌 。 
巨门与陀罗 、 天月 、 天刑同躔 ， 所会之太阳有煞同度 ( 尤忌空劫 ) ， 则为半身不 
遂 、 中风瘫痪 。 
嫠定中风 、 高血压 ， 以太阳为主 ． 故以太阳 、 巨门之 星系 ， 最具此疾倾向 。 
巨门与天机相对 ， 天机木可克巨 门土 ， 然而巨门阴金 又可克天机木 ， 故须详同 
度诸曜 ， 然后始可作出实际推断 。 一般情况下 ， 主肝胃不和 、 反胃 、 打噎 。 但若巨 
门 与陀罗 相会 ， 又见天机与火铃同度 ， 则主血压 、 血管栓塞诸症 。 若见空 劫 ， 则为 
怔忡 、 失眠 、 心肾不交等患 。  
"""
        print(tmp)
        print("\n")
        if(star == "巨门天机"):
            tmp = """天机巨门 ， 火星 同 度 ， 又主脑微血管破裂 ， 表现为 晕眩 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相属阳水 ， 故亦主湿疹 、 肾脏 、 风湿等疾患 。 所谓 肾脏疾患乃指排泄系统而 
言 ， 不指生殖系统 。 
然而天相受同度呀对拱之正曜影响甚大 ， 故可转化为 种种疾患 。 一一 
与紫微同度 ， 为膀胱水道系统疾患 。 或为脾土受湿 ， 以致皮肤湿疹 、 过敏 、 痕 
痒 。 若空劫同度 ， 则为胃气 、 胸满 、 打噎等患 。 


· 但假如夹宫的巨门化禄 ， 则天相受其影响 ， 可转化为 胃气痛 。 若巨门化忌 ， 则 
为虚性胃病 ， 如胃下垂 。 若夹宫天同化禄 ， 则为糖尿 ， 大同化忌义主肾炎 。 
与之同会的辅佐煞化 诸 曜 ， 以及夹宫辅佐煞化 诸 曜 ， 亦有重要影响 。 一般而言 ， 
如 羊 陀夹 、 火铃夹 ， 皆足以增 加病情 。 空劫夹 ， 其病患足以削弱体质 。 所以同一糖 
尿病 ， 有空劫夹 者 ， 往往影响及性机能 。 又如同一膀胱疾患 ， 有空劫者 ， 可发展为
小便失禁 。 举此为例 ， 除例即 可推详 。 
天相与羊陀相会 ， 或为羊陀夹 ， 则为风 湿骨 痛 。 更见 忌星夹 ， 或同会 ， 则主心 
脏病患 ， 或主中风 。 
若与火铃同度 ， 或火铃夹 ， 则亦 主湿病或为 肾经受 湿 。 
天刑同度 ， 有煞 ， 主动手术 。 天月同度 ， 则主转化为慢性病 ， 或为流行性传染病 。
"""
        print(tmp)
        print("\n")
        if(star == "天相廉贞"):
            tmp = """[ 廉贞天 相 ] 同度 ， 主破相 。 或主手术 ， 详见于武曲一节 。 
星曜对拱性质 ， 大致与同度相同 。 唯此时必为天相独 坐 ， 于推断 时 ， 应参照夹 
宫星曜 ， 及天府性质而定 。『 逢府 看相 』， 其实 『 逢相 』 亦未尝不看天府 。  """
            print(tmp)
            print("\n")
        if(dizhi == "丑"):
            tmp = """如天相在丑 ， 对宫为 『 紫微破军 』， 因受 [ 紫破 ] 性质影 响 ， 须防性病或肾病 。 此 
种性质 ， 与天相本身的性质有所开阖 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁属阳土 ， 主脾胃 ， 女命亦主乳房 。 于五 官则为鼻 。 守疾厄宫 ， 一般情形下 
主此类症候 。－ 一天梁之鼻病 ， 多在鼻实 。 
若天梁守疾厄宫 ， 而无煞忌利曜交会者 ， 主病 少 ， 或 病情轻 。 纵 有煞忌 ， 一般 
亦可转危为安 。 更喜天寿同度 。 唯若煞忌重重 ， 则必罹险症 。 
若天梁天寿同度 ， 而刑煞忌曜交侵 ， 且又见天 月 、 阴 煞 、 天虚 、 大耗 。 则其病 
虽无生命之虞 ， 但却必带病延年 ， 或受终身痛苦 。 
天梁 、 天机同度或会照 ， 主手指足趾尖受伤 。 以会陷尤甚 。 馀详天机一节 。 
若天梁与羊陀 、 天刑同会 ， 则主外伤手足 ， 内伤筋络 。 亦主跌打旧患瘀痛 。 
天梁亦主内分泌疾患 ， 尤以太阳对照或同度者为然 。 
此组星曜 ， 若见阴煞 、 天虚 、 天月 、 天刑 、 华盖 、 天德 ， 则 往往为服毒或中毒 ， 
又为误服药 、 误诊误治之克应 。 
天梁与空劫同度 ， 为风湿 、 麻湿 、 麻痹 ， 或妇科风病 ( 其实为神经痛 ) 。 病无实 
质 ， 亦不致影响寿命 ， 唯颇缠绵 。 见天月尤确 。 
若火铃同度 ， 为天梁所最不喜 ， 更 见天刑 、 天月 、 阴煞 、 天虚 、 天德 、 大耗等 
曜重重 ， 则男主胃癌 ， 女主乳癌 。 凶曜较轻 ， 亦主瘤肿 。 唯男命不喜会太阳化忌 ， 
女命不喜会太阴人忌 ， 会则主瘤肿易扩散 。 
羊陀一会 ， 见空劫 ， 刑煞虚耗之星不重 ， 则为神经系 统疾患 。 见刑曜 ， 则为伤 
痛 ， 或主动手术 。 
天梁天马 ， 与火星同会 ， 则为流行传染病 。 更见天月 、 天刑 ， 则为神经痛 ， 或内 
分泌失调影响之痛症 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀属阴金 ， 故主呼吸系统疾患 。 如咳嗽 、 哮喘 、 痨 病 、 肺炎 、 气管炎之类 。 
七 杀带威杀之气 ， 故文主伤痛 ， 如跌打刀伤 、 交通意 外 。 以此 [ 廉贞七杀 ] 的星 
系尤确 。 若廉贞化忌 ， 更见刑煞 ， 决主意外受伤 。 
尤不宜居于陷宫 。 若在卯 、 酉 、 巳 、 亥四宫 ， 见羊陀 、 火铃 ， 又见天刑 、 天月 
者 ， 每主终身残疾 。 廉贞七杀星系 ， 更主小儿麻痹 、 骨痨 、 驼腰曲背 、 不良于行等 
疾 。 
七 杀若不与擎羊同度 ， 但却相会 ， 为盲肠炎 。 若在寅 申二宫 ， 则主肠胃疾 。 煞 
重者 ， 为肠胃瘤肿 。  
七杀火星同度 ， 为眼炎 ； 龙池同度 ， 重听耳聋 ； 凤阁 同度 ， 则为鼻病 ； 擎羊同 
度 ， 眨眼 ； 陀罗同度 ， 齿疾 。－ 一凡此皆以单见一曜为准 。 若更兼见其他煞曜 ， 即 
不如是 。 
武曲影响 七 杀 ， 为跌打损伤诸疾 。 若武曲化为忌星 ， 同显呼吸器官瘤肿 。 
若廉贞一曜 ， 则影响 七 杀为呼吸器官敏感 ， 或为哮 喘 ， 或为鼻敏感 、 鼻窦炎之 
类 。 
紫微影响 七 杀 ， 为内伤 、， 气痛 。 亦主肠胃慢 性 发炎 。 若煞忌重重 ， 则为腹膜炎 。 
古代肺病无特效药 ， 常伴以咯血 ， 故 七 杀又为血星 。 于现代 ， 仅视之为肺病可 
矣 。 然七 杀带血的性质 ， 则仍于 外伤 、 瘤肿等疾克应 。 一一然须细详 ， 若七 杀与铃 
星同度 ， 更见虚耗 ， 则主瘀血 ， 而不主鲜血 。 陀罗同度 ， 病在骨齿 。 但陀罗铃星同 
度 ， 则为骨髓之疾 ， 或主筋骨脉络受暗伤 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """七杀在寅申二宫 ， 火铃交射 ， 主血痔 ， 或主便血 。 又 或主下部疮疾 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军属阳水 ， 然而由于其化为耗星的关系 ， 所以多 主消耗性疾病 。 
最常者为糖尿 ， 或为不能吸收某种营养的内分少失 调 。 故天盘疾厄宫见破军守 
垣 ， 刑煞重重者 ， 童年即须防先天性疾患 。 严重者则为侏儒之类 。 唯与天同 、 太阴 
所主之弱智不同 。 
普通情况下 ， 破军守疾厄宫 ， 亦主童年有脓血癣疥之 疾 。 或主体弱 ， 或主易受 
创伤 。 
破军与天相相对 ， 古人认为主易破相 ， 即由易受创伤 此种 性质而来 。 唯通常仅 
主在下巴 、 发际等不显眼的部位 。 较特殊者 ， 则为在舌头 、 口腔 、 齿龈 。 
破军与武曲同度 ， 或与 『 武曲天相 』 相对 ， 见陀罗 ， 主 齿疾 ， 又主牙疮或牙周 
病 。 年限见之则主拔牙 。 
倘煞忌重者 ， 却为跌扑骨伤之疾 ， 或主骨折 。 齿与骨 同一星系克应 ， 有时甚难 
分别 。 
破军与火铃同度 ， 主阴虚 、 肾亏 。 由是引致目疾 。 若 虚耗之星重重 ， 且见天刑 ， 
男主阳痿 ， 女主经痛 ， 皆属消耗性病患 。 
破军与煞忌同躔 ， 见天相 、 廉贞 ， 为结石 。 以见陀罗 者尤确 。 若火铃同度 则为 
皮湿掺 、 皮肤敏感 。 有时亦为 因糖尿引起之皮肤痕痒 。 或因 内分泌失调引起之皮肤 
伤患 。 
破军与擎羊 、 火星同度 ， 见删耗 ， 又主白血球过多 ， 由内脏发炎引致 。 
破军会武曲化忌 ， 或廉贞化忌 ， 而刑煞虚耗诸曜毕集 者 ， 且所见杂曜亦不吉 ， 
则 须提防由瘤肿变为癌症 。 
破军会火铃天马 ， 为传染病 、 流行病 ， 又 为突如其来 之病变 ， 如天花 、 麻痘 ， 
见昌曲化忌 ， 尤须提防 。 于成年 人 ， 则为德国荨麻疹 、 疯病之类 。 
以下名条 ， 列举疾病名称 ， 然后举出可能发生此种疾 病的星系 。 凡此星系在命宫 、 
疾厄宫 ( 有时神经系统的疾 患 ， 及长期慢性病则在福德宫 ) ， 无论流年 、 大限 、 天盘 ， 
皆主克应 。 
推断原 则 ， 仍须注意疾厄宫之本质 。 例如贪狼带煞守 疾厄宫 ， 本质可能为肝病 ， 
亦有可能为肾病 ， 此为本质 。 
行至大限疾厄宫见 『 廉贞天 相 』 ， 天 相 为刑忌所夹 ， 此 为肾病或性病之兆 。 由于 
原局贪狼何肾病的本质 ， 故于行此大限时便主克应 。
然后细查此大限内之流年 ， 必可找出发病的年份
"""
        print(tmp)
        print("\n")
def GongXia7th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫迁移富有百官朝拱 ， 则宜迁移 ， 主有人提携 ， 或 有助力 ； 若为在野 ， 或为孤 
君 ， 则迁移后反主损失 、 孤立 。 
紫微与禄存同度 ， 必为羊陀所夹 ， 若羊陀裔冲 ， 则 出外主受人排挤 ； 倘同时见 
吉 ， 则 主既有助力 ， 亦 有 破坏 力 。 
紫微化科在迁移宫 ， 见辅佐吉曜 ? 主 在外有人敬 重 ； 化权 ， 只宜凭一己力量打开 局面 ， 助力反少 。 
紫微躔擎羊主受 打 击 ； 躔陀罗主 惹 麻烦 ； 躔火铃主 惹是非 ； 躔空劫主受挫折 。 
躔桃花诸曜主在外有感情困扰 。 

紫微与火 、 铃同度 ， 又见天马 ， 往往主迁移不只一 度 ， 即一迁再迁 ， 与家人不 
聚 一地 。 
紫微在迁移宫见桃花 ， 又见昌曲 ， 主在外有艳遇 。 若同时见煞忌 ， 则在外易因 
色招祸 ， 以致破财损失 ； 再见刑劫 ， 主因色惹官非 ； 见虚耗天月病符 ， 主因色致病 。 
"""
        print(tmp)
        print("\n")
        if(star == "紫薇破军"):
            tmp = """天相坐命 ， 迁移宫 为 『 紫微破军 ；是否 
利 于 迁移 ， 须详实际星曜组合而 定 。 一般情形为既有助力 ， 亦 有破坏力 ， 须祥视那 
一方面的力量加强 。   """
            print(tmp)
            print("\n")
        elif(star == "紫薇天相"):
            tmp = """若破军坐命 ， 迁 移宫为 『 紫微天相 』 ； 是否 
利 于 迁移 ， 须详实际星曜组合而 定 。 一般情形为既有助力 ， 亦 有破坏力 ， 须祥视那 
一方面的力量加强 。  """
            print(tmp)
            print("\n")
        elif(star == "紫薇天府"):
            tmp = """七 杀坐命 ， 迁移宫为 『 紫微天府 』 ， 并 不 一 定代表 迁移有利 ， 往往迁移后经历波 
折艰危 ， 然后始能安定 ， 虽 『 紫 府 』 为百官朝拱者亦然 。 倘紫微在野 ， 或为孤君 ， 
又 或 府 厍 空露 ， 则极不利迁移 ， 往往主倾败 、 挫折 ， 或灾病频仍 。 """
            print(tmp)
            print("\n")
        elif(star == "紫薇七杀"):
            tmp = """命宫天府 ， 迁移宫为 [ 紫微七杀 ] ； 若紫徽化权 ， 绝 对不利迁移 ， 或主因发生重 
大事故而被逼迁移 ， 往往须承受财产上的损失 。 若紫微化科 ， 天府在亥宫者不必迁 
移 ； 在巳宫者则以迁移为较有利 ， 此因禄存同时必在卯宫之故 ， 影响天府不同性质 。 
紫微在迁移宫 ， 同会刑忌夹的天相 ， 或再见天刑 、 大耗 、 天虚 、 空劫等曜 ， 主 
在外受压力 ， 或致发生纠纷 、 是非 。 """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """在卯西二富无正曜 ， 迁移宫为 『 紫微贪狼 』 ， 又 见辅佐吉曜同会 ， 多主迁移有利 。 
    但若原来命宫已见吉化 、 吉 曜 ， 则亦未必一定非迁移不可 。 尤其是所会天相为财荫 
    夹 ， 或所会天府为库廪充盈之时 ， 不主迁移有利 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """辰戌 [ 紫相 ] 在迁移宫 ， 见煞 ， 天月同度 ， 则出门易 染病 ， 且往往为缠绵之疾 。 
紫微在迁移宫 ， 喜辅弼夹 ； 魁钺夹 ； 昌曲夹 。 分别 主得助力 ； 得人提携 ， 得人 
欣赏 。 不喜火铃 、 羊陀 、 空劫夹 ， 其性质与同度相同 。   """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机居迁移宫 ， 主利出门离乡发展 。 此乃由于星曜 性质浮动之故 。 但却不一定 
离乡定居 ， 有时仅为从事经常需要离家的行业 。 在古代 ， 为驿夫 、 水窖 ； 在现代可 
为海员 、 航空 、 运输等业 。 其至有时仅主其人经常转工 、 转 业 。 
古人云 ： [ 天机出外遇贵 ， 居家我是非 。 ] 此不可一概 而论 ， 仅于命宫无正曜 ， 
借迁移宫星 曜安宫的情形下 ( 即 在申寅二宫 ， 对宫为 『 天机太阴 』 ；  
 
迁移宫天机与火铃同度 ， 主出外奔忙 ， 风露辛酸 ， 不安一地 ； 与羊陀同度 ， 主 
是非口舌 ； 与空劫同度 ， 主阻碍挫折 。 若诸煞交并 ， 又见刑耗诸曜 ， 则主破财或意 
外 。 尤其是当天机与天梁同度或对拱时 ， 更主出外多困扰虚惊 ，但终能化解耳 。 
迁 移宫天机见禄马交驰 ， 则虽主经常迁动 ， 但却多 享受 ； 若见天马而不见禄存 ， 
又躔煞曜 ， 则在外必每多劳而无功 ， 或奔波劳累 ， 不守一地 。 
天机在迁移宫 ， 与昌曲同度 ， 不宜更见桃花 ， 否 则不但浮动不安 ， 而且往往因 
情愫而羁留异地 。 见吉尚主在外成家 ， 见煞则在外破耗 。 
天机在迁移宫与诸吉同会 ， 则 大利离开出生地发 展 。 
天机与天梁同度或对拱 ， 出门多人扶持 。 由于天梁 为荫星 ， 所以更主多现成机 
会 。 见魁钺同会者尤确 。 纵有煞星 ， 不过虚惊 。 煞曜与吉曜交集 ， 往往主因祸得福 ， 
如遇到麻烦 ， 但却因此结识到有力的支援 。 
天机与太阴同度或对拱 ， 一般利出门求财 ， 唯必终日烦忙 。 见禄者尤吉 ， 因禄 
与太阴气机相投之故 。 若见煞忌刑耗 ， 则反主破耗 。 吉化吉曜与煞曜交集 ， 则虽得 
财却多是非 。 又或主成功而有挫折 ， 须详实际星曜组合而定 。 
天 机与巨门同度或对拱 ， 基本意义为飘荡 ， 最宜出 门经营 ， 尤以推销 、 传播 、 
旅游等行业为宜 。 见煞忌则主在外经营失败 ， 或受压力 。 
天机巨门不恋故土 ， 天机天梁则恋家园 。 此种基本 性质最宜加以区别 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """在卯酉二宫 ， 对 
宫为 [ 天 机巨门 ] ) ， 若迁移寓的三方四正会吉 ， 优于命宫 ， 然后才 主克应 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """又如子午宫巨门安命 ， 会太阳 化忌 ， 且见火铃 、 空劫 ， 迁移宫天机独坐 ， 则仍 
以离开出生之地或久居之地为宜 。 尤其是天机在午得会寅宫禄存 ， 更利迁移 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳 宜 动不 宜 静 ， 宜发散不 宜 收敛 ， 居迁移宫 ， 主不利祖业 ， 离乡背井发福 。 
古代女命太阳居 迁移宫 ， 离家迁移 ， 何时亦为再嫁 之兆 ， 这是因为古代女子无 
事业 ， 故 迁动不手开创 。 
太阳入庙守迁移宫 ， 则出外发达 ， 能 有所 表现 ； 若落陷 ， 则浮动不安 ， 奔波劳 
碌 。 
太阳主贵 ， 亦即对社会地位的争取相鼍重要 ， 居迁 移宫亦有同样意味 ， 故往往 
表现为适宜任外求学 、 进修 ， 增加资历 ， 未必适宜在外经商 。 
命 宫 无正曜 ， 对宫 『 太阳天梁 』 、 『 太阳太阴 』 、 『 太阳 巨门 』 ， 皆宜离乡背井 ， 移 
根换叶 。 若命寓有火铃者 ， 更主他乡即是故乡 。 禄马同会命宫或迁移宫 ， 亦 主 一生 
事业皆 宜在异域 ， 或受外邦人支持 。 
太阳落陷 ， 又见煞忌刑耗诸 曜 ， 则不利迁移 ， 往往 徒劳无功 ． 而且易招是非 、 
破耗 、 挫折 。 
凡太阳居迁移宫 ， 仅利于发贵求 名 ， 不主聚财 。 此 乃基本性质 。 故除非有其他 
主财帛的星曜会合 ， 即 使太 阳化禄 ， 亦不主 迁移可以致富 。 
太阳与巨门同度或对拱 ， 一般较利经商 ， 可得异 乡或外邦人赏识 ， 唯主劳心 。 
见火铃则更主奔波 。 若巨门仙忌 ， 则必费唇舌 。 太阳化忌者 ， 则易招口舌尤怨 ； 见 
煞 ， 更主代人受过 。 若见吉化吉曜 ， 则助力始大 。 
太阳天梁的组合 ， 以求名 、 求学为主 。 见昌曲更佳 。 不然 ， 亦利于专业 。 
太阳与天梁同度或对拱 ， 若太阳化禄 ， 或会禄 存 ， 亦 必以专业为宜 。 在现代 ， 
往往又为代理外国名牌商品的表徵 。 亦可以反过来 ， 靠商品牌子在外埠经销 。 
太阳天梁而太阳化忌 ， 则在外易惹风波 ， 若同时见 吉会 ， 则往往因祸得福 ； 若 更见煞刑诸曜 ， 则主风波甚大 ， 唯终能化解而已 。 唯此星系 ， 有时又为 [ 凶事以求财 ] 
的性 质 ， 故可在异邦从事医药 、 保险等行业 。 
太阳与太阴同度或相对 ， 星曜浮动太甚 ， 故主浮动 无根 ， 亦主奔波 。 
唯太阳太阴而太阳化禄 ， 则虽不居一地 ， 但却仍受 异乡或外邦人的助 ； 太阴化 
禄 ， 更主得财 。 唯若太阳化忌 ， 则在外乡易受压力 ； 太阴化忌 ， 在外乡投资失败 。 
太阳太阴会天马 ， 在外奔波劳碌更甚 。 宜从事带移 动性质的行业 ， 如运输之类 。 
见煞曜 ， 则身心皆劳累 。
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲守迁移宫 ， 主迁移异地后必多忙碌 。 能否有收 获 ， 则须视是否会吉曜而定 ， 
尤喜见禄 ， 则主在外贸迁得利 。 若见煞忌刑耗诸曜 ， 主在外多是非挫折 ， 以致悲观 ， 
往往淹留异乡 。 
武曲与贪狼同度或相会 ， 最宜在外经商 ， 见占化吉 曜 ， 或见 [ 火贪 ] 、 『 铃贪 』 ， 
可主横发资财 ， 同时见煞 ， 则横 发横破 。 
凡武曲与 『 火贪 』 、 『 铃贪 ] 同度或相对 ， 则于发财之 后 ， 最宜回本土本根 。 但若 
命宫在丑未二垣 ， 无正曜 ， 对宫为 [ 武曲 贪狼 ] 者 ， 须详原局财帛宫之天相而定 。 为 
财荫 夹者则宜还乡 ； 为刑忌夹者则不宜 。 
武曲在迁移宫化忌者 ， 每主在异乡流落 。 见天月 ， 则主染病异乡 。 羊陀夹者 ， 
主客死异乡 。 
若非 『 武贪 ] 的格局 ， 则不宜躔火 、 铃二曜 ， 若更无 吉曜同会 ， 则主到处飘流 ， 
不居一地 。 倘同时又见禄马 ， 则主因其本身职业须时变换环境 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """武曲独坐辰戌宫 ， 其性质大致据对宫贪狼而定 。 火 铃夹者 ， 奔波劳碌不堪 。 奔 
波是否有成 ， 则须详实际星曜组合而定 。 唯若对宫贪狼为火铃夹者 ， 大利迁移 ， 主 
暴发 。  """
            print(tmp)
            print("\n")
        if(star == "武曲破军"):
            tmp = """古人有武曲会 七 杀 、 破军 ， 则在外身心不宁的说法 ， 但根据徵验 ， 所指仅 [ 武曲 
七 杀 ] 、 『 武曲破军 』 两组星系 。 必 须武曲本身吉化 ， 然后始主安宁 。 若见煞忌刑 耗 ， 
则在外必多破败与挫折 ， 以致淹留 。  """
            print(tmp)
            print("\n")
        elif(star == "武曲天府"):
            tmp = """『 武曲 天府 』 在迁移宫 ， 星曜性质较为稳定 ， 若命 宫 七杀会吉曜 、 吉化 ， 反以 
不离出生地为宜 。 若命宫不 吉 ， 而 『 武府 』 得禄 ， 始以离乡发展为佳 。 
『 武府 』 最不宜会廉贞化忌 ， 主在外时有伤害感情的事发生 。 倘武曲又为化忌 
星 ， 则主交通意外或事业挫 折 ， 或 主极伤害感情的破财 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲天相"):
            tmp = """『 武曲天相 ] 守迁移宫 ， 吉则可获人提拔 ， 凶则主受压力而生破败 。 武曲吉化 ， 
财荫夹则吉 ； 武曲化忌 ， 刑忌夹则凶 。 
[ 武 相 ] 躔 陀罗 ， 若无魁钺 、 辅弼同会 ， 亦主客路淹留 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲七杀"):
            tmp = """古人有武曲会 七 杀 、 破军 ， 则在外身心不宁的说法 ， 但根据徵验 ， 所指仅 [ 武曲 
七 杀 ] 、 『 武曲破军 』 两组星系 。 必 须武曲本身吉化 ， 然后始主安宁 。 若见煞忌刑 耗 ， 
则在外必多破败与挫折 ， 以致淹留 。[ 武曲 七 杀 ] 会廉贞化忌 ， 又与煞曜同度 ， 主交通意 外 。 
[ 武杀 ] 在 迁移宫 ， 出门多阴滞 、 困扰 ， 纵见吉星祥 曜亦不清闲 。 
[ 武杀 ] 与煞曜同会 ， 在外多是非纷扰破败 。 羊陀主 是非 ； 火铃主纷扰 ； 空劫主 
破败 。 若更见天刑 、 大耗 ， 主官非 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守迁移宫 ， 一般主出门得福 。 唯天同化忌者 。 则主多担心 。 若躔桃花诸曜 。 
则多感情困扰 。 
天同化禄 ， 不主出外发财 ， 但主纳福 。 必须何禄存 叠冲 ， 然后始主发财 。 所 谓 
纳福 ， 但主安定 ， 而不 必劳心 劳力 ， 或遇事可得他人助力 。 
倘天同与火铃同度 ， 则每多挫折不安 ， 往往功亏一 篑 。 必费尽心力然后始可扭 
转局面 。 
若与羊陀同度 ， 则出外多是乒 ， 或惹灾厄 。 更天 同化忌 ， 见天刑者 ， 是非必大 ， 
或且惹官非 。 若见天月则主染病他乡 。 
天同化忌而与空劫 、 大耗同度 者 ， 主出外破耗 ， 或 旅途失财 ， 文曲化忌同度 ， 则 
主被盗 。 
与羊陀 、 火铃 、 空劫 同度 ， 而天同吉化 ； 或天同与 天梁对拱者 ， 则虽有灾厄而 
终能化解 。 如被盗而能寻回失物 ， 有官非而终能和解 ， 有是非词讼反因祸得福 。 
天同吉化 ， 或与古曜同 会 ， 则迁移大利 ， 见魁钺者 更主得贵人提拔扶持 。 
天同与太阴同度或对拱 ， 以太阴庙旺为宜 。 由于太 阴移动不常 ， 故主出外奔波 ， 
唯太阴庙旺者 ， 奔波较少 ， 而成功机会亦大 。 太阴落陷 ， 则劳而少成 。 
天同与天梁对拱 ， 一般亦主利迁移 。 唯若命宫天梁 化权 、 化科者 ， 或会辅佐吉 
曜者 ， 则以不迁移为宜 。 但天梁化禄 ， 却又利迁移 。 天同吉化 ， 会吉曜 ， 出门得福 
荫 。 
天同躔禄存 ， 天梁躔天马 ， 出门求财大利 ， 但迁移 必不只一度 ， 或主迁移后仍 
得远方之财 。 古人谓主 [ 客中作 客得财 。 ]
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯"):
            tmp = """天同对拱太阴 ， 以卯宫为佳 ， 不独天同入庙 ， 且太 阴在酉亦乘旺 ， 故远较天同 
在酉为佳 。   """
            print(tmp)
            print("\n")
        if(star == "天同巨门"):
            tmp = """天同巨门的组合 ， 主是非口舌 。 唯见吉则主劳心得 财 。 
天同巨门见昌曲 、 桃花 ， 主在外惹感情困扰 ， 见煞 则主因之破败 。 
[ 天同巨门 ] 同度 ， 其感情困扰的性质 ， 甚于天同与 巨门对拱 ； 是非口舌的性质 
则较轻 。  """
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """[ 天同天梁 ] 同度 ， 命宫必无正曜 ， 若命宫不会吉 ， 而 迁移宫会吉 ， 则主出外受 
人提拔 ， 或在异地有现成机会 。"""
            print(tmp)
            print("\n")
        elif(star == "天同太阴"):
            tmp = """天同太阴的组合 ， 若太阴化忌 ， 绝不宜在外投资 。 更见煞 ， 主破财尚招困扰 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """． 廉贞守迁移宫 ， 通常均主宜离开出生地发展 。 尤其 星当命宫星 曜较迁移宫之廉 
贞星系为弱时 ， 更非离出生地发展不可 。 一一例如天相坐命 ， 羊陀夹 ， 对宫为 [ 廉破 ] 
与 禄存对拱 ， 即为命宫不如迁移宫之一例 。 
廉贞坐迁移宫 ， 古代认为利于仕宦 ， 尤其是 『 廉贞 天相 ] 的组合 ， 为离乡出仕 ， 
或任职僚幕之兆 。 在现代 ， 可 将大企业机构的行政管理职务 ， 视为与僚幕有同一性 质 。 
廉贞化禄 ， 昌曲同度相会 ， 古代认为宜离乡 古 藉参 加典试 ， 可中式 ， 在原藉典 
试则不中式 。 现代亦可视为赴外邦求学的徵兆 。 
迁移 宫廉贞化忌 ， 有羊陀夹 ； 或与羊陀借冲 ( 一躔 廉贞 ， 另一经借星安宫后恰能 
与廉相会 ) ； 或羊陀与廉贞同 度有流 羊流陀冲起 ， 更与忌星叠冲 ( 尤忌冲武曲化忌 ) ， 
或 会刑忌夹的天相 ， 凡此格局 ， 更见天刑 、 阴煞 ， 均主出门死于外道 ， 或惹凶祸灾 
非 。 
若仅廉贞化忌 ， 见煞曜 ， 则仅主出外因游乐应酬而 生是非 ； 见空劫 ， 则主因争 
财而致祸 。 
廉贞守迁移 ， 有天月同度 ， 又见煞 ， 逢化忌冲起 ， 主染病他乡 。 
廉贞化禄 ， 只主在外得意 ， 并不主发财 。 亦主多缘 。 
『 廉贞 ] 在迁移宫见财荫夹者 ， 见刑忌夹者贞归三挫折不顺 。 刑忌夹而廉贞化忌 ， 
更不利迁移 。 
"""
        print(tmp)
        print("\n")
        if(star == "廉贞七杀"):
            tmp = """『 廉贞七杀 』 见煞忌刑凑 ， 主出门有祸 。 廉贞化忌 ， 有 血光灾 ， 故多主交通意 
外 。 
[ 廉杀 ] 化禄 ， 或贪狼化禄 ， 叠禄存来会 ， 主出外得 财 。  """
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """[ 廉破 ] 守迁移宫 ， 擎羊 、 天刑同度或对拱 ， 为潜伏 交通意外的星系 。 当流年羊 
叠并 ， 或廉贞化忌之年 ， 即为出事之期 ， 即使见吉亦主伤残 。 
凡廉贞坐迁移 ， 与杀 、 破 、 狼同度或对拱 ， 文曲化 忌同度 ， 更见煞曜 ， 主出门 
受骗 ， 或主失物 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞贪狼"):
            tmp = """[ 廉贪 ] 在迁移宫 ， 会吉化吉曜 ， 则主在外多交际应 酬 ， 人缘广阔而不深厚 ， 见 
化禄者主因此而得财 。 见化忌者则多劳心费神 ， 往往功败垂成 ， 到手的利益为人夺 
去 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞天府"):
            tmp = """[ 廉 府 ] 主出门经商得安定发展 。 唯若府库空露 ， 或 会刑忌夹的天相 。 则主出门 
受人威胁 。 倘库廪充盈 ， 或会财荫夹的天相 ， 则主有现成机会 。 
『 廉 府 』 见桃花 ， 反主得财 ， [ 廉贪 ] 见桃花 ， 则主在外 酒色徵逐 ， 荒废正业 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府在 ， 迁移宫 ， 一般安定 。 即迁移后町稳步发展 。 天府化科 ． 尤主受异乡人 
尊敬 。 
府库空露 ， 见阴煞 、 天姚 ， 主出门受阴谋陷害以致 破财 、 损伤 。 
若府廪充盈 ， 又见吉星祥曜会合 ， 则出门 可 以创业 兴家 。 
天储与文曲化忌同度 ， 出门小破财 。 主 被扒窃或遇 盗 。 更会武曲化忌 ， 则破财 
程度增大 ， 阻主有损伤 。 
天府与擎羊 、 天刑同度 ， 出 门 招忌 ， 往往惹是非 ．， 
天府与擎羊 、 天月同度 ， 主异乡染病 。 
天府与陀罗同度 ， 出门往往迁延 ， 致 回 乡受阻 。 天 月同度则带病回乡 。 唯若煞 
忌刑重者 ， 则 主客死他乡 。
天府在迁移宫 ， 喜与紫微同度 ， 主出门近贵 。 亦喜 与武曲同度 ， 主经商可以致 
富 。 唯必须见吉曜吉化始确 。 
逢府看 相 ， 故天相之吉凶 ， 影响天府甚大 。 若府廪 充盈 ， 叉会财荫夹 、 权禄夹 、 
双禄夹的天相 ， 则离乡决主发财 。 倘府库空露 ， 会刑忌夹 、 火铃夹 、 羊陀夹的天相 ， 
则离乡必致倾败 、 挫折 ， 或招灾病 。 
天府 、 昌曲同度 ； 文曲化忌 ， 或文昌化忌 ， 又见禄 存受两 重羊陀交叠 ， 须防在 
外经商为人倒账 。 
天储不喜会廉贞化忌 ， 无论保种破败挫折 ， 皆主感 情创伤 。 若会武曲化忌 ， 则 
为破财 ， 或财转困难 。 
天储喜廉贞化禄 ， 主谈笑用兵 ， 求财顺利 。 唯若躔 桃花 、 昌曲 ， 则为在外多诗 
酒应酬 ， 风月之乐 。 
天府与武曲化禄同会 ， 经商大利 ， 会辅佐吉曜者 ， 必主远涉重洋致富 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """天府在巳亥宫 ， 命宫必为 [ 紫微 七 杀 ] ， 若紫微化权 ， 最宜离乡背井创立事业 ， 
主远涉重洋兴创 。 若巳亥两宫更多辅佐吉曜 ， 必为外邦侨领 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴与太阳不同 。 阳光可畏 ， 且主妻散而不主收敛 ， 故易因锋芒而招背后是非 
尤怨 。 月光则多为人所喜 ， 而且光泽柔和 ， 因此居迁移宫时 ， 便亦主易为异邦人接 
受 。 若太阴入庙 ， 更主人缘广结 。 唯若落陷 ， 则亦招阴损 。 
太阴与昌曲同度 ， 再躔桃花诸曜 ， 在外主受异性垂 青 。 见煞忌则主因色致祸 。 
太阴躔昌曲 ， 化忌 ， 因色破财 。 昌曲化忌则为被盗 。 
太阴与辅弼同度 ， 不外得人助 。 与魁钺同度 ， 则机 会迭来 。 
太阴入庙躔火铃 ， 仅主奔波 ； 若落陷躔火铃 ， 则 主 是非横逆 。 羊陀同度 ， 奔忙 
无功 ， 或在外有人阴谋陷害 ； 空劫同度 ， 无端破耗 ， 太阴化为忌星时尤确 。 
太阴主静 、 主藏 ， 故守迁移宫时 ， 不宜与人竞争 、 争夺 。 
太阴在迁移宫 ， 身宫亦在迁移宫 ， 落陷 ， 日生人 ， 或下弦月生人 ， 见火铃在命 
宫 ， 父母宫又不吉者 ， 主随娘改嫁 。 
太阴化忌守迁移宫 ， 不宜在外乡异域投资 。 更不宜 见猎心喜 ， 主反招损失破败 。 
太阴与天同的组合 ， 见禄 ， 又见吉曜 ， 主因远涉重 洋而白手兴家 。 
若天同化忌 ， 则在外奔波而无结果 。 虽勉强成家 ， 但却老死异域 。 
太阴太阳的组合 ， 虽见吉亦主变动不居 ， 每多忙碌 。 见煞轻亦主进退失据 。 必 
须吉化 ， 然后始主在外事业有成 。 
 
 
太阴化忌 ， 受流年大运化忌冲起 ， 双陀罗或双擎革 同躔 ， 或两重羊陀夹 ， 更见 
虚耗诸曜 ， 决主在外横生是非 ， 祸患起于突然 。 
太阴会天同化禄 ， 白手成事业 ； 会天机化禄 ， 事业 更张后即见鼎盛 。 
太阴化权守迁移宫 ， 宜 任职企业 ， 职掌财经调度 ； 化科者 ， 主钱财上受人信任 。 
太阴与科文诸曜同度 ， 不见桃花 ， 古代认为主在外 乡占藉发甲 。 现代则为留学 
有成之兆 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阴太阳"):
            tmp = """ 太阴太阳的组合 ， 太阴化忌 ， 见煞曜及 虚耗刑曜 ， 在外口舌是非甚重 ， 且往往 
代人受过 。 若太阴化忌则主无端纷扰破财 ， 或受引诱破财 。"""
            print(tmp)
            print("\n")
        elif(star == "太阴天机"):
            tmp = """太阴天机的组合 ， 亦嫌浮动 ， 故虽见吉亦主劳心劳 力 ， 不专一业 ， 不守一地 。 
若天机化忌则主进退失据 ， 游移不定 ， 事业难成 。 
[ 太阴天机 ] 的组合 ， 在寅宫者 ， 因会午宫的天粱 ， 每 每主孤立 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守迁移宫 ， 在外多应酬 。 应酬性质 ， 兼视命宫 、 福德宫而定 。 此三宫见科 
文诸曜 ， 则多文酒之会 ； 见桃花诸曜 ， 则多酒色财气 ； 见华盖 、 空曜 ，， 则多佛道宗 
教的朋友 。 
贪狼化禄 、 化权 ， 则应酬快乐 ， 人缘广结 。 在子午 二宫者 ， 且多友人尊重 。 但 
若贪狼化忌 ， 则每因无谓应酬而招惹麻烦 、 争夺 。 纵有吉曜同时会合 ， 亦主多应酬 
而无收获 。 
贪狼与火星 、 铃星同度 ， 在外热闹 ， 唯仅多场面上 的应酬 ， 知交难得 。 何禄来 
会 · 则主因应酬而得财 。 
贪狼与火铃同度 ， 若见煞或化忌 ， ( 煞忌齐会更劣 ) ， 则主在外仪表面风光 ， 一 
有实际利益即为人夺去 。 
贪狼与羊陀同度 ， 主出门每多是非之挠 ， 且 往 往由 应酬 、 游宴而致 。 更见空劫 ， 
主遇窃盗 ； 若加会桃花诸曜 ， 则主因色致祸 。 见化忌 ， 尤其是廉贞化忌者 ， 情形 更 
为严 重 。 
贪狼独坐迁移宫 ， 化禄 、 化权 ， 或与廉贞化禄同会 ， 即使不与火铃同度 ； 亦主 
迁移在外精彩发达 。 见火铃尤主暴发 。 但若同时又见煞忌 ， 则暴发之后必暴败 。 
流年贪狼守迁移宫 ， 原局有煞 ， 被流煞冲起 ， 且见 太岁 、 岁破 、 官符 、 大耗等 
曜 ， 又逢习星会合 ， 主遭兵贼之灾 ， 或受贪官污吏诬枉 。
"""
        print(tmp)
        print("\n")
        if(star == "贪狼紫薇"):
            tmp = """ [ 紫微贪狼 ] 居迁移 ， 宜离出生地发展 ， 亦利经商 。 """
            print(tmp)
            print("\n")
        elif(star == "贪狼廉贞"):
            tmp = """[ 廉贞贪狼 ] 同守迁 
移 ， 主出外须历艰 辛 。 见桃花煞 忌 ， 则酒色招祸 。 """
            print(tmp)
            print("\n")
        elif(star == "贪狼武曲"):
            tmp = """[ 武曲贪狼 ] 坐迁移 ， 必为巨贾 。 若武曲化忌 ， 则财 色招非 。  """
            print(tmp)
            print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """ 贪狼在寅申二宫 ， 与廉贞 对拱 ， 主在外酒色应酬忙 碌 ， 见吉电信局化吉者 ， 则 
因之发达 。 见昌曲则诗酒文采 ， 受异域人士欢迎 。 唯见桃花 ， 则主酒色徵逐 ， 桃花 
昌曲则为赌博 。 须详有无煞忌以定吉凶 。 
贪狼在寅申二宫 ， 化忌 ， 主为人夺爱 。 故不宜酒色 徵逐 。 即处理商务 ， 亦有事 
夺之象 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """贪狼在辰与二宫 ， 主贪恋酒色 ， 不必更见桃花 。 见 吉化吉曜 ， 则经商可发 。 
贪狼辰戌与同度 ， 视为桃花 ， 不主文采 ， 不主文采 。 唯喜见魁钺 ， 则主受人提 
携 ， 或主有现成机会 。 
辰戌贪狼 ， 火铃同度 ， 迁移可以致富 ， 见煞则防横 发横破 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守迁移宫 ， 须视太阳 ， 会太阳光辉者利迁移 ， 主在外地多人缘 ， 若太阳失 
辉 ， 则主在外招是非口舌万怨 。 唯太阳在巳午二宫 ， 光辉太盛 ， 亦有所不宜 ， 出外 
不宜锋芒太露 。 
若太阳守命在亥宫落陷 ， 巨门守迁移 ， 更 不利迁移 ， 否则徒惹纷扰 ， 且易失去 
机会 。 太阳会吉曜及吉化者尤确 。 
巨门在迁移宫 ， 基本性质与在命宫相同 ， 亦主 [ 口 舌以求财 ] 。 以化禄或禄存同 
度者 ， 见辅佐吉曜者为佳 。 若吉煞混杂 ， 则不宜从政 ， 仅利从商 。 
巨门化杈者 ， 在外能以言词舌辩取信于人 ， 凡太阳 天梁昌曲吉会 ， 则利讲学 。 
巨门化禄 ， 则太是必同时化杈 ， 倘太阳庙旺 ， 则主 迁移后受外国人或异乡有提 
拔 、 常识 。 唯若煞曜同时会照或同度者 ， 则亦有是非困扰 。 或因事务需要 ， 劳心费 
神 。 
巨门化忌 ， 主进退不安 ， 劳碌奔波 。 更见煞刑虚耗 诸曜 ， 则是非困扰 ， 口舌纠 
纷相继 而来 。 倘巨门化忌见空劫 ， 则主在外处事 ， 常多内心犹豫 ， 进退失据 。 
巨门会巳午二宫太阳 ， 倘太阳化禄 、 化权 ， 则在外 能以声势凌人 。 唯稍见煞曜 ， 
则当流年大运不吉时即易招非 。 若巳午二宫太阳化忌 ， 更主是非口舌频仍 ， 以不强 
出头及不露锋芒为宜 ， 否则易招招败 。 不见煞 ， 则从事 [ 口舌 求财 ] 的行业 ， 可免是 
非 。 

流年巨门守迁移 ， 见禄始可赴外乡异域 ， 见煞则 主枉费精神 ， 若煞忌刑耗诸曜 
凑会 ， 则主有无妄之灾 。 
凡巨门与禄存同度者 ， 若更无吉化吉曜 ， 则出门 主受小人掣肘 。 流禄同度者亦 
是 。 
"""
        print(tmp)
        print("\n")
        if(star == "巨门天同"):
            tmp = """ 巨门天同的组合 ， 若天同化忌 ， 则主耽心奔波 ， 倘 天同化禄 ， 又主易受感情困 
扰 。 唯天同吉化 ， 会吉曜 ， 仍主迁移异地可以白手兴家 。  """
            print(tmp)
            print("\n")
        elif(star == "巨门天机"):
            tmp = """巨门天机的组合 ， 若天机化忌 ， 则主少人缘及失意 。 更见煞 ， 则主遭遇恶性竞 
争 ， 受人谣谤 。 
巨门天机 ， 若天机化禄 、 权者 ， 亦主可出外创业 。 唯不及巨门化禄之佳 。 若煞 
曜同度 ， 则虽巨门化禄亦成败局面 ， 主表面风光 ， 内心不足 ， 由是劳费心神 ， 枉抛 
心力 。  """
            print(tmp)
            print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """ 卯酉二宫立命 ， 无正曜 ， 对宫为 [ 天机巨门 ] 主移 根换叶以成家 。 见煞 ， 则主耗 
费精神 。 见吉 ， 则主能安守 。 但一般情形下 ， 均以离乡背井发展为宜 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守迁移宫 ， 一般情形下吉利 ， 主近贵得利 。 见 魁钺夹或同度相会者 ， 更主 
受人提拔 ， 唯仅利与人合作 ， 或退居副贰 ， 以不出锋头为宜 ， 否则即受排挤 。 
天相见吉化 ， 及禄存 、 魁钺 、 辅弼 ， 皆主在外能创 兴事业 。 亦宜从政 ， 或带政 
治色彩的营谋 。 在现代 ， 大企业机构的行政管理亦可视为带政治色彩 。 
天相在迁移宫 ， 若为刑忌所夹 ， 绝不利迁移 ， 倘更 见羊陀夹 、 火铃夹或空劫夹 ， 
或煞曜刑耗诸星同会 ， 轻则主在外受人排挤 ， 重则迁移异地惹牢狱之灾 。 
天相惹为财荫夹 ， 或为 [ 六吉夹 ] 一一即魁钺夹 、 辅 弼夹 、 昌曲夹 、 禄权科夹 、 
紫府夹 、 日月 夹 ， 皆主在外得利 。 唯具体情形则不一 。 财荫夹主有现成机会 ； 魁钺 
夹主有人提携 ； 辅弼夹主有人扶佐 ； 昌曲夹主事情顺利 ， 禄极 
科夹主得财禄 、 权力 、 声望 ； 紫府夹主受人赏识 ； 日月夹主变动得利 。 以上仅一般 
原则 ， 实际情况须视具体星曜分布而定 。 
大致而言 ， 天相遇吉夹则多人缘 ， 遇凶夹则主孤立 。 唯昌曲夹而天相又躔桃花 ， 
则主在外多交酒色徵逐之友 ； 羊陀夹而禄存叠化禄 ， 仅主人小妒忌 ， 或小人包围 。 
天相与廉贞同度 ， 基本结构不利迁移 ， 见煞忌空劫 刑耗即主招非 ， 重且牵涉词 
讼 。 
天相与 [ 武曲破军 ] 对拱者 ， 迁移较为不利 ， 不见吉 化 ， 只见吉曜 ， 亦主在外浮 
沉 。 必须吉化吉曜齐见 ， 然后始主在外发达 。 
天相与 [ 紫微破军 ] 相对 ， 若原局贪狼化禄者 ， 主动 静皆利 ； 原局紫微化权 ， 则 
以离开出生地发展为宜 。 
天相与 [ 廉贞破军 ] 相对 ， 夹天相的正曜已有睽离的 性质 ， 故一般主在外地孤立 ， 
除非天相所会的天府有禄马 ， 否则不利迁移 。 
流年天相守迁移宫 ， 火铃照射 ， 流羊 、 白虎 、 官符 入度 ， 主在外惹刑事官非 。
"""
        print(tmp)
        print("\n")
        if(star == "天相廉贞"):
            tmp = """ [ 廉相 ] 守迁移 ， 若命宫破军化权 ， 而廉 贞却又化禄者 ， 在现代 ， 往往可兼跨两 
地建立事业 。 若廉贞化忌 ， 则稳居出生地为佳 。  """
            print(tmp)
            print("\n")
        elif(star == "天相武曲"):
            tmp = """[ 武曲天相 ] 在迁移宫 ， 见吉即利迁移外地经商 。 常 主可得意料不及的机会 。 见 
魁钺 ， 或为财荫夹者尤利 。 
[ 武相 ] 而武曲化忌 ， 或会廉贞化忌 ， 或会府库空露 ， 或为刑忌夹者 ， 主在外有 
灾祸 ， 重者且主客死异乡 。  """
            print(tmp)
            print("\n")
        elif(star == "天相紫薇"):
            tmp = """[ 紫徽天相 ] 守迁移宫 ， 不见煞忌 ， 则大利迁移 ， 在 外受人尊崇 ， 易于建立事业 。 
若见煞忌则招嫉妒是非 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守迁移宫 ， 一般主出外得人荫庇 ， 此乃天梁为 [ 荫星 ] 的基本意义 。 
天梁与魁钺 、 辅弼同会于迁移宫 ， 主在外多机会 ， 且主受人敬畏 ， 因而自多助 
力 。 
天梁若与禄存同度 ， 则主受排挤 ， 更躔火铃 、 空劫 ， 则变生肘后 。 若又同会忌 
星及天刑 。 大耗 ， 决主官非 。 尤其是太阳化忌来会 ， 更可成冤狱 ， 虽终能化解 ， 但 
已历尽辛酸 。  
天梁与火铃同度者 ， 飘流的意味较大 。 故迁移在外 ， 仍主一迁再迁 ， 客中作客 。 
天梁与昌曲同度 ， 太阳在庙旺宫垣来照 ， 则 一般利迁移外地作学术研究 。 昌 曲 
二曜 ， 一化科 ， 一化忌 ， 则宜从事理工研究为宜 。 
天梁化禄守迁移宫 ， 以居巳 、 午二垣最招人指责 。 见煞 ， 可惹风波甚大 。 子宫 
次之 。 
天梁与空劫同度 ， 在外每经灾厄 。 见吉 ， 则主因祸 得福 。 
流年天 梁遇吉 ， 主在外经商可发 ， 若会太阳化忌 、 天刑 ， 流年官符 、 白虎入度 ， 
主招词讼 。
"""
        print(tmp)
        print("\n")
        if(star == "天梁天机"):
            tmp = """ [ 天梁天机 』 的结构 。 在古代仅优伶或卖艺的人 ， 惯 于空州过省 ， 故称之为 『 艺中州派
术途中走 』 。 这亦由于天梁 ， 颇 有倾向于技艺 、 艺术的意味 ， 而天机则加强奔走的意 
味 。 在现代 ， 此 项性质仍可保持 ， 不过现实生活已较为安定 。 
其实 『 同梁 』 逢天马 ， 亦主艺术飘流 。 更与昌曲单星 同会 ， 则为落拓文人 ， 四 
海流荡 。 若文曲化忌 ， 则主 江湖 巧骗谋生 。 一一巳亥天梁独坐者亦然 。 
天梁 、 天机的组合 ， 若逢吉化 、 吉曜 ， 则多机遇而 不安定 ， 唯若同时见煞 ， 则 
终难把握机会 。 天机化忌 ， 则主在外乡受恶性竞争 。   """
            print(tmp)
            print("\n")
        elif(star == "天梁太阳"):
            tmp = """太阳天梁的组合 ， 基本意义已主离散 ， 所以当其守 迁移宫之时 ， 一般主利迁移 。 
唯以太阳在庙旺之地为宜 ， 主受人尊敬 。 若太阳落陷 ， 则在外仍主孤立 。 太阳陷地 
化忌 。 则受人尤犯 ， 更见天刑 ， 主词讼官非 。 
命宫卯 酉 ， 『 太阳天梁 』 躔度 ， 迁移宫无正曜 ， 但命 富会禄马者 ， 亦主离乡发福 。 
在现代 ， 命宫成 『 阳梁昌禄 』 格者 ， 即使不会禄马 ， 亦每多出国求学的机会 。 """
            print(tmp)
            print("\n")
        if(dizhi == "寅"):
            if(star == "天梁天同"):
                tmp = """  天梁天同 』 在寅宫 ， 由于天梁入庙 ， 故不主飘流 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天梁"):
                tmp = """ 天梁在巳 、 亥两宫 ， 与天同对拱 ； 在申宫 ， 与天同 同度 ， 古人认为主飘荡 。 但 
若遇吉曜 ， 而不见煞忌 ， 在现代则仅主不守一地 。 唯若火铃同度 ， 则主四海奔波 ， 
而事业 无成 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守迁移宫 ， 前人云 ： [ 主在外曰多 ， 在家日少 。 ] 此论未必是 ， 必须见火铃 
同度 ( 或 火铃与命宫同度 ) ， 或禄 马交驰 ， 然后始主出外 。 
除 卯 酉二宫 ， 七 杀守迁移一般利外出 ， 主在外有权 ， 令人敬畏 。 尤以 [ 紫微七杀 ] 
守迁移时 ， 权威最大 。 
七杀与昌曲同度 ， 气质不相投 ， 并不主利益 。 仅 『 紫 杀 』 星系喜之 。 其馀宫度 
的 七 杀星系 ， 喜魁钺 ， 亦喜辅弼 ， 主在外有地位 ， 且多发展的机会 。 
七 杀与羊陀同度 ， 利武职 ， 否 则少人缘 。 在现代 ， 可从事工艺 。 
七 杀与火星同度 ， 在命宫主孤克 ， 在迁移宫的驻突 发 ， 见禄且主得意外财 ， 唯易 
得易失 ， 横发横破 ， 必须见好收篷 ， 然后始可持盈保泰 。 
七 杀与铃星同度于迁移宫 ， 前人认为主武职峥嵘 。 现代亦可从事工艺 、 工业 。 
七 杀与空劫同度守迁移宫 ， 主进退失据 ， 理想常超 过现实 ， 以致不守一业 ， 不 
守一地 ， 时生改变之心 。 趋吉避凶道 ， 唯宜从事工艺 、 工业 ， 则当有新意念可助兴 
创 。 
七 杀与禄存同度守迁移宫 ， 若火铃 、 空劫同度 ， 则 主在外受压力 。 或主飘荡无 
依 。 
命宫天府会吉化 ( 尤其是化禄 ) ， 则 一般不利迁移 ， 除非七 杀亦会权禄之星 ， 然 
后始可移根换 叶 ， 若天储为府 库空露 ， 则以迁移为是 。 
武曲与 七 杀同拱 ， 化禄 ， 则迁移异地后 ， 活动能力 甚强 ， 因此获利 。 武曲化忌 ， 
主灾病词讼 。 亦主资金周转 不足 。 
廉贞与七杀同拱 ， 主迁移异地能建立声誉 。 廉贞化禄者 ， 顺利得财 ， 且多助力 ； 
若廉贞化忌 ， 则亦主挫败及意外 。 更天月同度 ， 主在异乡染病 ； 更天 刑 同度 ， 则主 
祸生不测 。  
流年七杀见吉化吉曜守迁移宫 ， 一般主事业更新 ， 或转换新职 。 廉贞化忌 、 武 
曲化忌来会 ， 见煞 ， 主出门有意外 。 
"""
        print(tmp)
        print("\n")
        if(star == "七杀紫薇"):
            tmp = """ 紫微与七杀同拱 ， 主出外为人敬畏 ， 亦多人禄 。 落 [ 紫杀 ] 同度而百官朝拱者 ， 
更主振臂一呼 ， 则群相响应 。 故 在外亦能建立事功 。  """
            print(tmp)
            print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            if(star == "七杀廉贞"):
                tmp = """  『 廉贞 七 杀 』 同度者 ， 在丑宫主惹是非 ， 见吉亦然 。 此乃由于廉贞 七 杀居未宫 ， 
为 [ 雄宿乾元格 ] ， 而丑宫不 是 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "七杀武曲"):
                tmp = """  卯酉二宫 [ 武曲七杀 ] ， 结构最为不良 ( 其中酉宫 又优于卯宫 ) ， 主出外受压力 ， 
若见煞忌刑耗 ， 更主遭人陷害 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军在迁移宫 ， 一般情形下不利迁移出外 。 除非命 宫天相为刑忌夹 、 火铃夹 、 
羊陀夹 ， 然后始主不得不离乡发展 。 一一其中尤以羊陀夹为然 。 盖天相若为羊陀所 
夹 ， 必有禄存同度 ， 此禄存与破军对拱 ， 大利 迁移 。 
凡破军在迁移宫 ， 必须靠专门技能起家 。 古人谓此 为 [ 巧 艺走 途中 ] 。 其中一个 
特例是 ： [ 加文昌 ， 文曲武曲相 会 ， 优伶之人 ] 。 优伶自然可算具有专门技能 。 
若破军 、 文曲同度 ， 化忌 ， 则或为落拓书生流落江 湖 ， 或为江湖浪子 ， 擅诸般 
巧术 ， 包括戏法 、 卖药等在内 。 
破军见魁钺最吉 ， 主自己的技能有发挥的机会 ， 且 受赏识 。 
破军在迁移宫亦得禄为佳 ， 则可藉专门技能在异乡 立足 。 
破军化权 ， 宜在异乡凭技艺为人服务 。 见煞者 ， 主 工艺或手艺 。 
破军与四煞同度守迁移宫 ， 火铃主流离 ， 羊陀主破 败 ； 煞重则主人缘 不足 ， 灾 
祸频仍 。 
 
故破军守迁移 ， 亦喜龙池凤阁 、 天才 、 昌曲同会 ， 可增加其专门技艺的优秀 。 
当空劫同躔相会之时 ， 亦可视为技艺的巧思 。 
破国见煞轻不忌 ， 最不喜煞忌齐会 。 尤不喜子午宫 见廉贞化忌 ， 则主伤心落泪 ， 
或自身灾病 。   
凡破军守迁移宫 ， 若不见化禄 ， 则不利迁居异地生 根 ， 但却利流动各地以生财 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            if(star == "破军"):
                tmp = """  寅申宫破军 ， 与武曲化忌冲拱 ， 又与火铃 、 空 劫 、 天刑 、 天虚 、 大耗 、 阴煞等 
曜同会 ， 主迁居异地至少 。 必有一次重大灾祸 。 或甚至死于异乡 。"""
                print(tmp)
                print("\n")
        if(star == "七杀紫薇"):
            tmp = """ 紫微与七杀同拱 ， 主出外为人敬畏 ， 亦多人禄 。 落 [ 紫杀 ] 同度而百官朝拱者 ， 
更主振臂一呼 ， 则群相响应 。 故 在外亦能建立事功 。  """
            print(tmp)
            print("\n")
        
        if(dizhi == "寅" or dizhi == "申" or dizhi == "酉"):
            if(star == "破军"):
                tmp = """  破军在寅 、 申 、 酉三宫落陷 ， 不利迁移 ， 若离乡 ， 同主飘流无成 。 以羊陀交会 
者为然 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            if(star == "破军"):
                tmp = """  破军在子午二宫 ， 见吉化 、 吉曜 ， 则亦可经商 ， 但 所经营者仍须带有专门的性 
质 。 如在异邦开家乡菜馆 ， 即是一例 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "破军紫薇"):
                tmp = """  丑未宫 『 紫微破军 ] 守迁移宫 ， 出外得人敬畏 。 尤以 百官朝拱的情况下为然 。 若 
只见朝拱 而少主要辅佐 ， 但又见煞 ， 则在异邦当为一行一业的领袖人才 。 
紫微化权 ， 必同时见武曲化忌 ， 则主在外不宜经商 。 亦主权威虽重 ， 而挫折频仍 。"""
                print(tmp)
                print("\n")
        if(star == "破军廉贞"):
            tmp = """  [ 廉贞破军 ] 不宜经商 ， 主客缘不广 。 若廉贞化忌者 ， 煞重 ， 亦主客中发生意外 。 """
            print(tmp)
            print("\n")
        elif(star == "破军武曲"):
            tmp = """  [ 武曲破军 ] 见煞尚无妨 ， 若武曲化忌则主手头困 乏 ； 会廉贞化忌 ， 亦主灾病 。"""
            print(tmp)
            print("\n")
def GongXia8th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守交友宫 ， 不喜见煞忌刑耗 ， 主下属强顽而且 不得力 ， 甚至以怨报德 ； 但 
若见 [ 百官朝拱 ] 过分完美者 ， 则 又主下属权威太甚 ， 容易将自己架空 。 此为论紫微 
守交友宫的大纲 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 紫微独坐子午宫 ， 若为在野孤君者 ， 下属强顽而且 无义 。 尤以见空劫者为然 。 
紫微独坐子午 ， 会对宫贪狼化忌者 ， 倘更见刑忌煞 曜 ， 则主为下属夺权 。 若见 
桃花诸曜 ， 更主不可与异性下属发生感情 。 
紫微独坐子午 ， 有辅佐吉曜同会 ， 下属虽忠诚可靠 ， 唯亦防权力转移 。 命宫有 
辅弼 ， 紫微会昌曲则彼此关系良好 。 一一若以言结交 ， 则可得忠厚之友 。"""
            print(tmp)
            print("\n")
        if(star == "紫薇破军"):
            tmp = """『 紫微破军 』 见辅佐诸吉 ， 主得力下属易另谋发展 ， 故自己反而时时感到助力 
不足 。 
『 紫微破军 』 有 煞 ， 主受友人或下属拖累 。 更见空劫 ， 主因下属亲信而招致事 
业破败 、 损失 。 
『 紫微破军 』 会武曲化忌者 ， 见煞 ， 须防下属于独立 发展时 ， 损及自身利益 ； 
若廉贞化忌 ， 则防受下属威胁 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇天府"):
            tmp = """『 紫微天府 』 在交友宫 ， 得友诚朴 ， 亦能直谏 。 唯见 辅佐吉曜 ， 除非将事业全 
心交与亲信 ， 否则 终难顾全双方 关系 。 
[ 紫微天府 ] 而府库空露 ， 或煞忌刑同会 ， 则亦须防 下属侵吞 。 见武曲化忌 ， 或 
躔陀罗 、 铃星 ， 则主受拖累 。 见廉贞化忌 ， 或躔擎羊 、 火星 ， 则主下属反叛 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇贪狼"):
            tmp = """[ 紫微贪狼 ] 躔桃花 、 昌曲 ， 亦主不宜与异性下属发 生情愫 。 贪狼化忌者尤确 。 
否则主大权旁落 。 
[ 紫微贪狼 ] 躔火 、 铃 ， 雇佣关系或合作关系不能持 久 。 
『 紫贪 』 在交友宫 ， 最喜命宫天同化禄 ， 则自能得下 属扶助 ， 自身虽劳 ， 亦关 
系良好 。 """
            print(tmp)
            print("\n")
        elif(star == "紫薇天相"):
            tmp = """『 紫相 』 在交友宫为不吉结构 ， 除非夫妻合作发展共 同事业 ， 否则下属终难依 
靠 。 唯夫妻宫秘无正曜 ， 借 『 天 相巨门 』 安星 ， 故婚姻须迟 ， 然后始可得匡助事业 
的伴侣 。 
[ 紫相 ] 见府库空露者 ， 又见煞 ， 主为友破财 ， 或 主受下属牵累而致损失 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇七杀"):
            tmp = """ [ 紫杀 ] 在交友宫 ， 权力太重 。 见吉 ， 主可结交畏友 、 诤友 。 唯防下属权重而招 
致自身不利 。 
[ 紫杀 ] 最嫌 见紫微化权 ， 会武曲化忌 ， 则主下属弄 权而致自己事业倾败 。 与陀 
罗同度者 ， 则不宜为友人或下属强出头 ， 否则招挫折倾败 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机在交友宫 ， 下属时时转换 。 
一机在交友宫 ， 主结识各方面的朋 友 ， 但亦时时更换 。 见辅佐吉曜 ， 同时又见 
煞曜者 ， 上述情形更为显著 。 
天机入庙者 ， 则友人或下属皆有助力 。 见辅佐吉曜 者尤佳 。
天机见火铃 ， 则关系变化尤速 ， 虽见辅佐吉曜 ， 亦 只主一时助力 。 
天机与羊陀同度 ， 主与朋友 、 下属间多纠纷 、 或主 受拖累 。 更见空劫 ， 损失尤 
大 。 
天机化忌 ， 主彼此各怀机一己 。 更见煞 ， 则更主受友 人或下属造谣诽谤 、 背面 
是非 。 
天机化禄 ， 不逢化忌 ， 虽主交友不常 ． 但却时时能 得助力 。 天机化权者 ， 关系 
较稳定 。 与下属关系亦如是 。 
天机与天梁同度或对拱 ． 辰戌优于丑未 。 在丑未二 宫不见煞 ， 仅主关系易疏离 。 
天机同会桃花 ， 不主女色 ， 主亲近小人 。 
天机化科 ， 主友人下属诚信 ， 但不增加稳定 。 
天机见左辅右弼 ， 主友人及下属众多 ， 亦不主增加 稳定 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 天机入庙者 ， 则友人或下属皆有助力 。 见辅佐吉曜 者尤佳 。 故以子午宫天机独 
坐 """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未天机落陷 ， 故见煞即易招非惹怨 。 或遭下属背 弃 。 见空劫者 ， 损失更大 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "亥"):
            tmp = """ 巳亥天机为太阴对拱 ， 均主关系 不稳定。天机化禄于亥宫 ， 会太阴化忌于巳宫 ， 主误信小人 ， 误交匪人 。 见煞曜者 ， 受 
累不浅 。 若更见桃花诸曜同会 ， 则因而须防色祸 。 若有辅佐吉曜同会 ， 则 受累程度 
减轻 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳"):
            tmp = """ 巳亥天机为太阴对拱 ， 均主关系 不稳定 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """ 天机入庙者 ， 则友人或下属皆有助力 。 见辅佐吉曜 者尤佳 。 在辰戌宫 『 天机天梁 』 同 度者最 为得宜 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机天梁"):
                tmp = """ 天机入庙者 ， 则友人或下属皆有助力 。 见辅佐吉曜 者尤佳 。 在辰戌宫 『 天机天梁 』 同 度者最 为得宜 。 """
                print(tmp)
                print("\n")
        if(star == "天机太阴"):
            tmp = """寅申 [ 天机太阴 ] 及巳亥天机为太阴对拱 ， 均主关系 不稳定 。 见火铃尤甚 。 天机 
化忌或太阴化忌 ， 更见煞曜刑耗 、 阴煞 、 天姚等 ， 均主阴谋陷害 。 """
            print(tmp)
            print("\n")
        elif(star == "天机巨门"):
            tmp = """天机与巨门的组合 ， 即使不见煞忌 ， 亦主易跟下属 或友人发生误会 。 所谓 [ 天机巨门 ] 交人 ， 始善终恶 。 若 更 化忌 ， 则纠纷更大 。 事端须视煞忌刑耗会合程度而定 。 
故 凡天机同拱巨门 ， 须保持 『 君子之交淡如水 』。 亦不宜亲下属 ， 以免反目 。 
[ 机巨 ] 见昌曲 、 桃花 ， 防交口甜舌滑之辈 。 见煞则 受损失 。 """
            print(tmp)
            print("\n")
        elif(star == "天机天梁"):
            tmp = """天机天梁见吉曜 ， 亦主得年长可靠之友 ， 或年长得 力的亲信 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳虽主动 ， 但唯入庙然后始主交游广阔 ； 若落陷 地 ， 则相识者固不多 ， 亦谈 
不上交情 ( 唯在丑宫 ， [ 太阴太 阳 ] 同度 ， 仍主交游广阔 。 这是由于太阴的缘故 。 ) 
太阳居交友宫 ， 落陷 ， 即使不见煞忌 ， 亦主施恩无 功 ， 若见煞忌 ， 更主恩反成 
仇 。 
凡太阳居交友富 ， 命宫必有廉贞坐守 。 廉贞坐命的 人多喜从政 ， 而宦途亦往往 
多乏知交 。 故遇太阳落陷见煞 ， 仍以不走仕宦之途为宜 ， 否则恩反成仇的后果亦最 
恶劣 。 
太阳守交友宫 ， 见辅佐诸曜 ， 及百官朝拱 ， 命宫星曜有力者 ， 主得交贵友 。  
太阳化禄 ， 交游尤广 。 但不如太阴化禄 、 权 、 科 ， 更得实际助益 。 
若太阳化忌 ， 主如怨招非 ； 太阴化忌 ， 则防受友人 引诱投资以致损失 。 
太阴太阳居交友宫 、， 见左辅右弼 、 文昌文曲同度 ， 或相夹 ， 不特交游广阔 ， 且 
主下属众多 。 但若同时见煞 ， 则不主得益 。 
太阳与空曜同度 ， 见吉 ， 泛泛之交多 ， 但亦有二 三知己 。 更见昌曲 ， 则彼此不 
但莫逆 ， 而且皆违世独立 。 从政从商的人见此 ， 亦不相宜 ， 仅利艺术工作人士 。 
太阳与擎羊同度 ， 增加是非 ； 与陀罗同度 ， 主受累 ； 与火铃同度 ， 主多争 。 化 
禄 ， 主 交游广 ； 化权 ， 主关系易稳定 ； 化科 ， 主多泛泛之交 。 百官朝拱而见煞 ， 亦主多泛泛之交 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阳天梁"):
            tmp = """太阳天梁的组合 ， 若太阳入庙 ， 或天梁化权 ， 化科 ， 不见煞 ， 则主得交畏友 ， 
或诤谏之友 ， 或正直敢言下属 。 
唯太阳天梁较孤立 ， 故宜注意及人际关系 ， 务求藉 人事补救 。 
太阳天梁的组合 ， 见火铃同度 ， 主知交易暌离 。 倘 更见刑耗 ， 则主受友人或下 
属的挑剔 、 打击 ， 以致受损失 。 
太阳 、 天梁 、 天刑 、 大耗 ， 见四煞空劫 ， 主友人或 下属以怨报德 ， 不但口舌 ， 
且有谣谤 。 又因此财帛破耗 ， 事业损失 。"""
            print(tmp)
            print("\n")
        elif(star == "太阳巨门"):
            tmp = """太阳巨门的组合 ， 即不见煞忌 ， 已主口舌 。 苦见煞 忌 ， 则主官非词讼 。 太阳化忌 
者 ， 主代人受过 。 
太阳巨门化权禄 ， 则主得交异族友人 ， 且可受益 。 若更见吉曜拱合 ， 主受扶持 。 
太阳巨门的组合 ， 以亥宫太阳为最劣 ， 其时命 宫 为 『 廉贞天相 』 ， 有与人合作 ， 
依赖别人的特性 ， 但兄弟 宫 与 交友宫俱劣 ， 故只宜夫妻合作 。"""
            print(tmp)
            print("\n")
        elif(star == "太阳太阴"):
            tmp = """太阳太阴的组合 ， 须见辅佐诸曜然后始主得友人及 下属助 力 。 否则徒然交游广 
阔 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲在子午 、 辰戌 、 丑未六宫垣 ， 守交友宫 ， 主交 游广阔 。 即 [ 武府 ] 、 [ 武贪 ] 、 
武曲对拱贪狼三系 。  故仅馀 [ 武府 ] 在子 
午两 垣 ， 始主多交益友 。 
武曲化禄于交友宫 ， 须见左辅 、 右弼 ， 然后始主下 属得力 ， 若无辅弼 ， 则主为 
友人或下属奔波伤神 。 
若武曲化忌 ， 则主受下属侵吞 ， 友人剥削 ， 或因友 人下属拖累而招致损失 。 
武曲化忌与火铃同度者 ， 主受友人或下属出卖 。 与 羊陀同度 ， 主横逆相加 ， 竞 
争背叛 。 更见空劫者 ， 损耗甚重 。  
凡武曲坐交友宫 ， 基本性质不利 。 主 交游不广 ， 下属无力 。 唯与天府同度或对 
拱者多交游 ，， 但亦不主得力 。 见吉曜 ， 则能得二三助力或知交 。 若见煞忌 ， 则决主 
受累 ， 或受侵吞 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """武曲在子午 、 辰戌 、 丑未六宫垣 ， 守交友宫 ， 主交 游广阔 。 即 [ 武府 ] 、 [ 武贪 ] 、 
武曲对拱贪狼三系 。  故仅馀 [ 武府 ] 在子 
午两 垣 ， 始主多交益友 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """武曲在子午 、 辰戌 、 丑未六宫垣 ， 守交友宫 ， 主交 游广阔 。"""
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """武曲在子午 、 辰戌 、 丑未六宫垣 ， 守交友宫 ， 主交 游广阔 。 """
            print(tmp)
            print("\n")
        
        if(star == "武曲天府"):
            tmp = """仅于 [ 武曲天府 ] 同度 ， 见禄 ( 亦不宜禄存同度 ) ， 又 见吉曜的情形下 ， 始主交游 
广阔 ， 且多助力 。 
[ 武曲天府 ] 而府库空露者 ， 主因友人或下属破财 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲贪狼"):
            tmp = """然而武曲 贪狼的组合 ， 却又主多酒肉朋友 ，[ 武曲贪狼 ] ， 多饮食徵逐之友 。 躔桃花诸曜者尤甚 。 倘更见煞忌刑耗空劫 ， 则 
因之招祸 ， 或且由是惹词讼官非 。 
[ 武曲贪狼 ] 与火铃同度 ， 主交游始热终冷 ， 甚且凶 终隙末 。 见煞者尤甚 。 
『 武曲 贪狼 』 而贪狼化忌 ， 亦主受侵夺 。 若贪狼化禄 ， 则不腚见昌曲桃花 ， 否 
则多酒肉朋友 。 但见吉 ， 则亦主于饮食徵逐中得助力与机 会 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲天相"):
            tmp = """[ 武曲天相 ] 而刑忌夹 ， 则主被友人或下属出卖 ， 且 受威胁 。 
[ 武曲天相 ] 而财荫夹 ， 主友人能提助机会 ， 下属中 有诚笃之人 ， 能匡助事业 。 
[ 武曲天相 ] 不喜武曲化忌 ， 主受累 ； 亦不喜会廉贞 化忌 ， 主争财 ， 亦主下属侵 
吞 。 
『 武曲三相 』 会天府而府库空露者 ， 主因友破财 ， 或 为友人及下属强出头而致 
招非 。 若库廪充盈 ， 则不但交游广阔 ， 而且可得助力 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲七杀"):
            tmp = """[ 武曲七杀 ] 不宜与煞星同度 ， 主为友人或下属出卖 。 
[ 武曲 七 杀 ] 见廉贞化禄 ， 主得助力 ， 唯不持久 。 贪 狼化禄 ， 则主感情始热终冷 ； 
见破军化禄 ， 则 助力时有时无 ； 若化忌 ， 决主凶终隙末 。 
『 武曲七杀 』 ， 武曲化忌而火铃夹者 ， 主为友人或下 属倾家 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲破军"):
            tmp = """[ 武曲破军 ] 若不化禄 ， 主友人或下属口是心非 。 见 煞忌刑耗空劫者 ， 受牵连破 
耗 ， 重者可致倾家 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同在交友宫 ， 主交游广阔 ， 盖天同带感情而且随 和 ， 故易结交朋友 ， 与下属 
关系亦佳 。 见吉曜 ， 助力 增加 。 
天同化禄 ， 交游得益友 _a‘ 若化忌 ，． 则主助力不足 。 化忌而见煞 ， 主凶终隙末 。 
天同与羊陀同度 ， 中年以后得益友 ， 助力不少 。 火 铃同度则助力不持久 。 
 

天同主感情 ， 与巨门同玉 戒 拱照 ， 则感情易受 巨门的影响而产生阴暗面 ， 故易 
滋生误会 。 若 旧煞空劫同会 ， 又 见阴煞 ， 则主误交匪人而受拖累 。 
 
凡天同坐交友宫 ， 见 羊陀 ， 主惹是非 ； 见火铃 ， 主招怨 ， 或关系疏离 ； 见空劫 ， 
主因友人或下属受损失 ， 亦主受背弃 。 
天同与禄存同度 ， 主自己热情待友 ， 常为友人或下 属奔走斡旋 。 若见禄存天马 ， 
则友人或下属不居一地 ， 幸自身常离乡背井 ， 四海为家 。 命宫星吉 ， 则主事业广大 。 
 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """ 午宫 [ 天同太阴 ] 落于陷地 ， 为 较差宫垣 。故凡以上五宫垣 
为交友宫者 ， 虽交游广阔 ， 亦防生不良效 果 。 尤以巨门之克应 ， 常主误会突然而来 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """丑未宫 [ 天同巨门 ]， 为 较差宫垣 。故凡以上五宫垣 
为交友宫者 ， 虽交游广阔 ， 亦防生不良效 果 。 尤以巨门之克应 ， 常主误会突然而来 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天同"):
                tmp = """ 辰宫天同对戌宫 
巨门 ， 戌宫天同对辰宫巨门 ， 巨门于辰戌二宫落陷 ， 主是非甚大 。故凡以上五宫垣 
为交友宫者 ， 虽交游广阔 ， 亦防生不良效 果 。 尤以巨门之克应 ， 常主误会突然而来 。"""
                print(tmp)
                print("\n")
        if(star == "天同太阴"):
            tmp = """天同太阴的组合 ， 一般主得益友 。 化禄者 ， 能 交 多 方面的朋友 ， 但若不见吉曜则 
不能持久 。 见煞 ， 主受友人或下属拖累 。 太阴化忌则主破财 ， 尤不宜与友人合作投 
资 。 
[ 天同太阴 ] 与火铃同度 ， 主不受友人或下属尊重 。"""
            print(tmp)
            print("\n")
        elif(star == "天同巨门"):
            tmp = """天同巨门的组合 ， 即不见煞 ， 亦主易 生 误会 ； 若更 见煞 ， 则主感情破裂 ， 招是 
非尤怨 。 若 『 天同巨门 』 在交 友宫 ， 则命宫必为破军 ， 常有与人合作共事的 倾向 ， 
唯往往必中道分手 ， 且误会甚深 。 见煞忌则 蒙受损失 。 """
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """天同与天梁的组合 ， 主得诤友 。 天梁化科者尤佳 。 唯一般情况下 ， 主其人年长 。 
亦主得可靠之下属 ， 或主年长 。 若天寿同度 ， 则更主年龄有差距甚大 。 
『 天同天梁 』 ， 不宜化禄 ， 即使天同化禄亦不宜 。 否 则主因财而起误会 。 若见煞 
忌刑曜 ， 则主损失 。 
『 天同天梁 』 亦主知 ： 交或得力之下属易分离 。 见火铃 同度 ， 往往因受环境所 
逼而 然 。 见禄存天马 ， 则主自己常为友人或下属奔忙 。"""
            print(tmp)
            print("\n")
        elif(star == ""):
            tmp = """"""
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守交友宫 ， 亦主交游广阔 ， 唯与天同不同 。 天 同主结交面广 ， 且重交情 ， 
而不倾向于酒内之交 ； 亦跟天机不同 ， 天机多泛泛之交 ， 但未必时时应酬交际 ； 与 
贪狼的分别 ， 则为贪狼的酒色财气意味更重 ， 廉贞尚带感情成份 。 尤须注意者 ， 为 
廉贞所带的感情 ， 往往较表面 ， 故不多深交 。 
廉贞与火铃同度 ， 主感情冲动 ， 故宜冷静克制 ， 对 待友人及下属的关系 。 不宜 
因冲动而过份热情 ， 亦不宜因冲动而感情破裂 。 
廉贞与羊陀同度 ， 主因感情而起是非 。 如更见刑耗 诸曜 ， 则主破耗 损失 。 
廉贞与空劫同度 ， 主感情易决裂 。 亦主下属背弃叛 离 。 
廉贞与吉曜同会 ， 则交游广阔 ， 下属众多 ， 且有助 力 。 若廉贞化禄 ， 更主得益 。 
廉贞与昌曲同度 ， 多诗酒风流之交 ； 与下属的关系 亦不即不离 ， 相处融洽 。 
凡廉贞与文曲化忌同度 ， 主结交小人以致受累 。 不 宜乐受阿谀 。 以致蒙欺诳诳 。
"""
        print(tmp)
        print("\n")
        if(star == "廉贞天相"):
            tmp = """[ 廉贞天相 ] 不宜见煞忌刑耗诸曜 ， 主来友破财 ， 或 下属反叛以致破耗 。 
『 廉贞天相 』 为刑忌夹 ， 又见煞 ， 亦主友人拖累 、 下 属招怨 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞贪狼"):
            tmp = """[ 廉贞贪狼 ] 见昌曲 、 桃花 ， 主多酒肉朋友 。 廉贞化 忌者 ， 主因此破耗 ； 若贪狼 
化忌 ， 则主多交损友 。 
[ 廉贞贪狼 ] 而廉贞化禄 ， 更会吉曜 ， 则主因交际应 酬而得 财 ； 亦主与下属交好 ， 
能得其助力 。 贪狼化禄 ， 则助力不持久 。 
[ 廉贞贪狼 ] 若与煞忌刑耗空动交会 ， 主困友人或下 属而招灾祸 ， 或为下属出卖 
陷害 ， 以致招官非词讼 ， 破财陨失 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞天府"):
            tmp = """『 廉贞天府 』 主得益友 ， 下属亦有助力 。 唯府库空露 ， 则 主损耗 。 
[ 廉贞天府 ] 亦主交游广阔 。 唯以天府化科 ， 廉贞 化禄者 ， 始主有助力 ， 且可得 
财口有辅佐吉曜同会 ， 更有利 事业 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """『 廉贞破军 』 见煞忌刑耗 ， 与友人感情易生裂痕 ， 下 属亦多叛离 。 
若 [ 廉贞破军 ] 而破军化禄 ， 则主因友人而得结识有 助力人士 ， 亦主下属能为自 
己解决重大困难 。、 
【 廉贞破军 】 而廉贞化禄 ， 主时时更换朋友及下属 ， 但相矛或共事之时 ， 则有交 
情 。 
[ 廉贞破军 ] 而廉贞化忌 ， 或与擎羊同度 ， 皆易误 交小人 。 火铃同度则易暌离 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞七杀"):
            tmp = """[ 廉贞七杀 ] 见煞忌刑耀 ， 主为友人下属牵连拖累 。 唯见禄存 、 化禄 ， 又见吉曜 ， 
则 可得财 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守交友宫 ， 主择交谨慎 ，。 故多交益友 。 然必须 见魁钺 、 然必须见魁钺 、 辅 
弼 ， 然后邕主可得知交 ， 且主下属得力 。 
天府化科 ， 则 友人及 下属 皆忠厚诚 信 。 
天府与煞忌 刑 耗同会 ， 或所会的天 相又 为 刑 忌 所 夹 ， 则主友人或下属恩将仇报 。 
见天姚 、 阴 煞 ， 则 主手 下 人阴谋 ； 财荫夹 者 ， 则主得助力 。 
天府与空劫 刑 耗同会 ， 则主交损友以致破耗 ， 及主 手下人偷盗侵吞 。 
天府在 交友富与禄存同度 ， 迁移宫必为太阴与擎羊 同度 ， 若太阴落陷 ， 则主人 
奔波而且招是非 。 又主利益泰半归于友人及下属 。 自身任劳任怨 ， 然后始可维持人 
情 。 
天府在交友 宫 者 ， 亦须兼视天相 ， 天相之吉凶 ， 影 响天府之性质甚大 。 若天相 
落陷见煞忌 ， 亦主受友人或下属损害 ， 以致陷害 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "酉"):
            tmp = """天府在 酉宫 落陷 ， 对拱的 『 武 曲七 杀 』 亦同时落陷 ， 故性质最为不佳 。 除非得 
会吉化 ， 或天府化科 ， 否则不主能得助力 ， 交游面亦较为狭窄 。 
天府在酉 ， 会武曲化忌 ， 更见煞刑诸曜 。 须防友人不义 ， 及下 属陷害 。见文曲与武曲同度 ， 无论为文曲化忌 ， 或武曲化忌 ， 均主下属盗窃 、 侵吞 ， 亦主为友人破 
耗 。   """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴入庙 ， 夜生人 ， 主游广阔 ， 且得益友 。 若落陷 ， 日 生人 ， 则主多泛泛之交 ， 且多损友 。 
太阴化禄 ， 主因友人助力 ， 或下属匡扶而进财 ； 化 权 ， 则主在财权方面得益 ； 
化科 ， 主得忠诚可靠之友人贫下属 。 若化忌星 ， 则主受牵连而破财 ， 亦主受友人影 
响而 投资损失 ， 或主下属破耗 。 
太阴会天机化忌 ， 主受谣谤 。 见天姚 、 阴煞 、 指背 、 劫煞 ， 则主遭受权术阴谋 。 
太阴落陷 ， 天刑 、 阴煞同度 ， 又会羊陀 ， 主受威胁 。 更见忌星煞曜 ， 主因此招 
灾 。 
太阴与火铃同度 ， 或与禄存同度 ， 皆主为友人或下 属之事而奔忙 。 
太阴空劫天刑 ， 又落陷地 ， 主因友人及下属而破财 损失 。 文曲化忌同躔 ， 则为 
侵吞 、 盗窃 。 
太阴入庙 ， 见辅佐诸曜同会 ， 夜生人 ， 主下属 众多 而且得力 。 但自身仍不免奔 
忙 。 
太阴见吉化 、 吉曜 ， 但又同时见煞 ， 则主时时更换 得力下属 ， 与友人之友谊亦 
难耐久 。 太阳同度或拱照者 ， 更主时冷时热 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阴太阳"):
            tmp = """太阴与太阳同度 ， 见昌曲 ， 主下属成群 ， 亦多门下士 。 同时见煞忌刑耗 ， 则主 
因之破耗损失 ， 或主招怨 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼主应酬 ， 居交友宫 ， 基本性质已多场面上的朋 友 ， 必须见吉化吉曜 ， 然后 
始主有益 ， 及主得下属众多 。 否则仅为泛泛之交 。 
若贪狼与桃花诸曜同度 ， 又见天虚 、 大耗 、 天姚 、 阴煞 ， 则主交酒肉朋友 ， 徵 
歌逐色 ， 遇事则无助力 。 
贪狼会辅佐吉曜 ， 又见天巫 、 恩光 、 天福 ， 然后始 主友人及下属得力 。 见辅佐 
诸曜皆为对星者 ， 主友人及下属众多 。 
贪狼与煞曜同度 ， 见桃花 ， 则主因酒色财气而惹灾 非 。 更会化忌 ， 主受友人或下 
属陷害 、 拖累 。 见空劫者 ， 更主因此破财 。 
贪狼与吉化同会 ， 尤其是贪狼化禄 ， 则主受友人欢迎 ， 下属拥戴 。 然而仅限于交 
情 ， 不主权威 。 
贪狼化忌于交友宫 ， 主受友人及下属侵夺 。 更见桃 花 、 昌曲 ， 则主因酒色起祸 。 
  
[ 火贪 ] 、 『 铃贪 』 ， 主下属突然增加 。 
流年贪狼在交友 宫 ， 化忌 ， 天见煞耗 ， 防友人或下 属拖累 ； 见白虎 、 官符 、 贯 
索 ， 则固此牵连词讼 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 贪狼在子午宫 ， 可交年长之益友 。 若成 『 泛水桃花 』 ， 或会桃花诸曜 ， 主与下 
属发生情愫 。"""
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """贪狼在寅申二宫 ， 易交损友 ， 必须见辅佐吉曜然后 可免 。 见煞及化忌 ， 主下属 
夺权 。  """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 贪狼在辰戌二宫 ， 无吉曜 ， 下属不可靠 ， 易生侵吞 之心 ； 见吉 ， 下属得力 。"""
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """凡巨门坐交友宫 ， 吉则主舌辩 、 口才 ； 凶则主口舌 、 争吵 。 
故巨门化禄 ， 或禄存同度 ， 或化权星 ， 又会辅佐吉 曜 ， 则主得能言善辩之友 ， 
可助自己创业 ； 或得下属亦如是 。 又或与友人下属多辩论 、 讨论 ， 由是创兴事业 。 
若巨门无吉化 ， 见煞曜 ， 则主友人或手下皆不得力 ， 彼此间多口舌争吵 。 宜从 
事 【 口舌以求财 】 韵事业 ， 则性质可得改良 。 如法律二公 关 、 学校之类 。 
若巨门化忌 ， 则主友人及下属均稀少 。 更见煞 ， 则 主受拖累 ， 以致是非口舌 ； 
或遭下属背弃 。 更见空劫 、 大 耗 、 阴煞 、 劫煞 ， 则因友人拖累而破耗 ； 因下属背弃 
而损 失 ， 甚或遭侵占盗窃 。 
若巨门与文曲化忌同躔或对拱 ， 则主受友人或下属 失言而致拖累 。 见四煞空劫 
刑耗 ， 阴煞 、 劫煞等曜 ， 主遭侵吞盗窃 。 
"""
        print(tmp)
        print("\n")
        if(star == "巨门太阳"):
            tmp = """太阳巨门的组合 ， 若太阳入庙 ， 主得诤 谏 之友 ， 或仗义能言之友 ； 太阳化忌 。 
则是非招怨 。 若太阳巨门化权禄 ， 主可结交异族受扶持 。 """
            print(tmp)
            print("\n")
        elif(star == "巨门天机"):
            tmp = """天机 巨 门的组合 ， 主友人或下属心口不一 。 化忌则 主凶终隙末 。 见煞耗则主破 
耗 。 
天机巨门的组合 ， 主友人或下属多浮滑之辈 ， 表面 奔忙 ， 实无助力"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守交友宫 ， 一般情形下 ， 主下属及友人对自己 忠诚 。 但必须见辅弼 ， 然后 
始主得力 。 辅弼夹天相亦然 。 
天相遇化禄 、 化权 、 化科者 ， 或与禄存同会 ， 主交 游多助力 ， 并呆藉此创业兴家 。 
下属亦能忠心襄助 。 
天相遇四煞 、 化忌 、 天刑 、 大耗等曜 ， 主结交多非 善类 ， 能助恶而不助善 ， 下 
属亦如是 。 若见空劫 、 阴煞 、 天巫 、 劫煞等曜 ， 则主代人受过 ， 且因之而破败损耗 。  
凡天相坐交友宫 ， 必与破军相对 ， 故本质上已有反 覆的性质 ， 必须见左辅 、 右 
弼 ， 或见禄 ， 然辱始可调和 。 稍见煞忌 ， 即必生不利 ， 其不利程度视实际星曜组合 
而定 。 
除非 [ 紫相 ] 坐交友宫 ， 否则无论下属如何忠诚得 力 ， 终非大将之材 ， 故自身心 
须辛劳 ， 主持大局 。 命宫必为巨门躔度 ， 此即自身须劳心费神的表征 。 
天相会府库空露的天府 ， 亦主为人破耗 ； 会库廪充 盈的天府 ， 然后始忠诚可靠 。
"""
        print(tmp)
        print("\n")
        if(star == "天相紫薇"):
            tmp = """[ 紫微天相 ] 的组合 ， 吉 则 可 得正义之友及下属 ； 凶则为恶 奴欺主 。 """
            print(tmp)
            print("\n")
        elif(star == "天相武曲"):
            tmp = """[ 武曲天相 ] 的组合 ， 吉则可助生财 ， 凶则遭人以怨 报德 ， 煞重者更主受威胁 。 """
            print(tmp)
            print("\n")
        elif(star == "天相廉贞"):
            tmp = """[ 廉贞天相 ] 的组合 ， 吉则主感情深厚 ； 凶则主感情 中有阴暗面 。 见煞则而生灾 
祸 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁 为孤克之星 ， 除非见辅佐吉曜 ， 否则不主交游广阔 ， 下属众多 。 除非化权 、 
化科 ， 或与吉化会合 ， 否则不主有助力 ， 及招正直无私有义的友人及下属 。 
天梁天马同度 ， 知交易散 ， 亦主时时更换手下 。 故 自身亦多奔忙 。 禄马同度者 
尤甚 ， 且主友人或下属怀自肥之心 。 
天梁化禄 ， 或禄存同度 ， 则主友人 、 下属有利私之 心 。 见煞曜空劫者 ， 则受牵 
连而招损失 。 更见阴煞 、 天姚 ， 主受出卖 。 
天梁与四煞会照 ， 因友人或下属而起是非纠纷 ； 更 见空劫则主破耗损失 。 见昌 
曲化忌 ， 则是非起于末微 ， 寻且弄成大事 ； 又主友人或下属弃信背诺 。  

天梁守交友宫 ， 见吉 ， 成 [ 机月同梁 ] 格 ， 主下属众 多 ， 且能司服务之 职 。 唯少 
创造力 ， 仅利在现在局面下发展 。 
"""
        print(tmp)
        print("\n")
        if(star == "天梁太阳"):
            tmp = """太阳天梁的组合 ， 太阳吉化 ， 主结交非富则贵 。 但 仍须见左辅右弼 ， 然后始主 
有助力 ， 否则不过泛泛之交 。 若太阳化忌 ， 则主代人受过 ， 招怨招非 。 """
            print(tmp)
            print("\n")
        elif(star == "天梁天机"):
            tmp = """天机天梁的组合 ， 友人及下属众多而易分离 。 见煞 忌刑耗空劫则主背弃 ， 招致 
损失 。 凶曜重者 ， 更主阴谋陷害 。 见阴煞 ， 文曲化忌则侵吞 。 """
            print(tmp)
            print("\n")
        elif(star == "天梁天同"):
            tmp = """『 天同天梁 ] 的组合 ， 寅宫最佳 。 一般主得益友 ， 及 能顾存大局的手下 。 若见煞 ， 
则知交或得力下属易离散 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀守交友宫 ， 主交游不广 ， 下属稀少 。 若辅佐吉 曜同会 ， 然后数目始可增多 ， 
唯助力则不增 。 
七 杀必须见化禄 ， 或会禄存 ， 然后始可调和 ， 则主 得助力 ， 藉以生财 。 
唯 七 杀与禄存同度 ， 则因羊陀夹的关系 ， 又主易交 小人 ， 对自身排挤倾轧 ， 或 
主受下属威胁 。 更与火铃 、 空劫 、 刑耗同会 ， 则因而损失破耗 。 
七杀与煞曜同躔 ， 则 不宜同会化权 ， 否则主恶奴欺 主 。 见空劫 ， 大耗 、 天虚 、 
阴煞 、 劫煞 者 主事业受挟持 、 侵吞 。 
七 杀与火星同度 ， 见吉曜 ， 主友人或下属能生极大 助力 ， 唯迟 得 。 
七杀会 [ 火贪 ] 、 [ 铃贪 ] ， 主友人或下属突增 ， 但亦 易突然离散 ， 须详所会星曜 
吉凶而定 。  
凡 七 杀在交友宫 ， 多落落寡合 ， 故不宜与人合作事 业 。 亦不宜听信谗言 。 
七杀与廉贞化忌同会 ， 然重者 ， 主重大感情破裂 ， 可因此招惹极大是非 ， 若更 
见桃花昌曲 ， 则牵涉男女私情
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            if(star == "七杀武曲"):
                tmp = """ 七 杀在卯酉二宫 ， 武曲同度 ， 若武曲化忌 ， 更见煞曜 ， 主为友人破产 ， 或因下 
属而倾家 ， 亦主受入威胁 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军入交友宫 ， 基本性质不利 ，．． 盖化气曰耗 ， 主耗 损 、 怨谤二背逃毒唯破军 
入庙 ， 且化禄或与禄存同度 ， 然 后始主得力 。 
破军独坐交友宫者 ， 主孤立 。 见辅佐吉曜同度 ， 然 后始得友人或下属之助力 。 
若见辅弼 ， 但又见煞 ， 则终生是非口舌 ， 且因之破耗 。 见空劫 ， 虚耗者 ， 破耗更大 。 
破军为火铃夹 ， 或火铃同度 ， 更见空劫 、 天刑 、 天 虚 、 大耗 、 阴煞 、 天月 、 劫 
煞等曜 ， 主因友人而起官非 ， 或遭下属盗窃 、 侵吞 ． 或因之惹祸而致败耗 。 
凡破军坐交友富 ， 最不宜见武曲化忌同度或拱照 ， 主受拖累 、 牵连以致损失 。 
亦不宜会贪狼化忌 ， 见煞忌刑耗 ， 则须防侵吞争夺 。 刑忌夹的天相同度或对拱 ， 亦 
主受拖累或受威胁 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫破军入庙 ， 又得对宫 『 廉相 ] 调和 ， 较易招益 友 。 若廉贞化忌 ， 则不宜与 
友人合作 ， 否则损失 。 更见煞刑诸曜 ， 损耗甚大 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫破军 ， 对 [ 武曲天相 ] ， 若有羊陀同会 ， 则主 交损友 ， 且受拖累 。 若武曲 
化禄 ， 或破军化禄 ， 然后始主得助力生财 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌宫破军 ， 对 [ 紫微天相 ] ， 主得交畏友及益友 ， 亦主得老成持重之下属 。 然 
见煞亦主助力知交易散离 。 """
            print(tmp)
            print("\n")
def GongXia9th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微在事业宫 ， 主独当一面 。 但却并不意味其 人可 以宁行经营 ， 亦不主其人可 
为领袖 。 一般情况下仅主 独立工作 ， 或负责部门工作 。 
紫微见煞 ， 古人认为可经经商 。 此乃经历竞争而后有成 ， 由于成功以致其社会 
地位亦因而提 高之意 。 现代人地位已提高 ， 故虽无煞 ； 或且百官朝拱者 ， 亦未尝不 
可经商 ， 由经商而致富贵 。 古今社会不同 ， 不可一概而论 。 
紫微化权在事业宫 ， 仅主独当一面 ， 或所从事工作 独立性强 。 未必定主富贵 。 
紫微化科在事业宫 ， 主名大于 利 ， 故以自由职业 ， 或专业人士为宜 。 亦可从政 ， 
但恐贵而不富 。 
紫微得百官朝拱 ， 又无煞曜 ， 可以从政 ， 必能发展 至部门首脑 。 若命宫吉者 ， 
更主为方面大员 ， 司部长官 。 
若紫徽无煞曜同度 ， 却有辅佐吉曜同会 ， 又见禄马 交驰 ， 或会廉贞化禄 、 贪狼 
化禄 、 武曲化禄者 ， 主职掌财权 ， 从政亦为财赋税之 官 。 
紫微化科而禄存同度或拱照者 ， 名利双收 ， 以从政 或主持大企业机构为宜 ， 尤 
利上市 、 公众事业 ( 如电话 、 快 餐 、 航空 、 旅游业之类 ， 现代社会类此行业甚多 ) 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "紫薇"):
                tmp = """子午紫微守事业宫 。 以命宫或财帛宫得禄为贵 。 老 命宫见 [ 禄马交驰 ] 者 ， 无论 
经商或任职财经机构 ， 皆可 出人头地 。 若财帛宫廉贞化禄者 ， 宜与人合作创业 ， 但自已需用负责业务管理 。 
子午紫微 ， 喜辅弼一居事业宫 、 一居夫妻宫 ， ( 昌 曲亦然 ) ， 则主夫妻彼此有助 
力 ， 虽非事业合作 ， 亦主可互 相匡助 。 
子午紫微化权 ， 则利事业而不利婚姻 ， 女命尤然 。 故绝不宜夫妻合 作事业 。 一 
一凡女命权星在事业宫者 ， 皆须注意婚姻 ， 紫微尤然耳 。 
子午紫微得 『 火贪 』 、 『 铃贪 』 对拱 ， 亦主突发 。 其突 发与配偶无关 ， 但发后恐 
因贪图享受淫乐而致暴败 。 
子午紫微化科 ， 又见空劫 ， 一生事业中树敌 ， 故不 宜从政 ， 以自由职业为宜 。 
子午紫微化科 ， 无论有煞无煞 ， 皆主名大于利 。 若 百官朝拱 ， 则主在行业中有 
地位 。 不见刑耗空劫 ， 可以从政 ， 以行政管理为宜 。 
子午紫微与桃花诸曜同度 ， 须视有无昌曲 。 有昌曲 则职业儒雅 ， 无则职业庸俗 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """丑未宫 【 紫微破军 】 在事业宫 ， 以能发挥开创力者为 佳 。 故无论从商从政 ， 皆 
主开 创而不主守成 ， 因而便有劳累之感 。 
[ 紫破 ] 与煞曜同宫 ， 主劳身 ； 与昌曲同宫 ， 主劳小 若破军化禄 ， 则一生事业多 
变 ， 且常负担额外工作 。 破军化权 ， 则事业多波折 ， 且于开创局面之后不能坐享其 
成 。 
[ 紫破 ] 会武曲化禄 、 廉贞化禄或贪狼化禄 ， 皆主因 能开创而致富 。 若不能开创 
局面 ， 则仅主事业有大幅度波动 。 唯无论如何 ， 均主手面阔绰 ， 而实际收成不大 。 
[ 紫破 ] 之开创 ， 乃指凭空打开局面 ， 或以崭新手法 营运而言 。 故喜左辅右弼同 
度 ， 则自多助力 。 
[ 紫破 ] 为火铃夹 ， 席不暇暖 。 与空劫同度而无刑煞 者 ， 则其开创 乃由空中楼阁 
而来 ； 唯若见煞刑耗曜 ， 则一生事业往往功败垂成 ， 且屡伤元气 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """寅申宫 [ 紫微天府 ] 同度 ， 必须见百官司朝拱然后施 主有成 ， 若无吉曜 ， 则往往 
进退失据 ， 或志大才疏 。 
[ 紫府 ] 与禄马同度 ， 或见禄马交驰 ， 现代则宜经商 ， 为政亦宜经营财政金融 。 
[ 紫府 ] 而紫微化科 ， 主白手与创事业 ； 若天府化科 ， 则主在现成局面下兴创 。 
若紫微化权 ， 则往往理想过高 ， 财力不足以支持其 营运 。 从政从商皆然 。 若见 
刑曜 ， 则以从事武职为佳 ， 权力甚重 。 
现代 『 紫府 』 守事业宫者 ， 亦可从事工业 。 唯紫微化 权时 ， 则不宜 理想过高脱 
离实际 。 紫微化科 ， 则一生多竞争 ， 例如甫从事 ， 一种产品的制造 ， 立即为人所模 
仿 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "紫薇贪狼"):
                tmp = """卯酉宫 [ 紫微贪狼 ] 以从事消费性待业为宜 。 见桃花 昌曲 ， 尤主所营事业带享受 
性质 。 
紫贪而贪狼化忌 ， 常主与人合作不能长久 。 若贪 狼化禄 ， 则防大运行至天相宫 
垣 ， 或 [ 武破 ] 宫垣生变化 。 
[ 紫贪 ] 与火铃同度 ， 事业主突破 ， 唯若同时见空劫 刑耗 ， 则暴起暴败 。 
『 紫贪 』 会廉贞化忌 ， 宜从事见随的行业 。 会廉贞化 禄 ， 亦可从事政治 。
【 紫贪 】 与空劫同度 ， 事业空头 。 唯波折甚大 。 年运 三方见刑忌虚耗 ， 即生破 
败 。 
【 紫贪 】 不宜紫微化科 ， 否则虽有号召力唯缺乏组织 力 。 除非得百官朝拱 ， 然 
后可以弥补缺点 。 
『 紫贪 』 躔左辅或右弼 ， 对寓为右弼或左辅 ， 则构成 良好格局 ， 主下属众多 。 
唯必须分润下属 。 然后事业始能持久 。 
『 紫贪 』 为火铃夹 ， 亦主突破 。 夹贪狼化忌者 ， 一生 暴起暴跌 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "紫薇天相"):
                tmp = """辰成宫 『 紫微天相 』 ， 基本亦主起跌 。 唯与 『 紫破 』 之 起跌不同 。 [ 紫破 ] 者 ， 
其起跌乃出于主观改变 ； [ 紫相 ] 音 ， 往往受客观环境影响 ， 常有英雄无用武之地的 
感受 。 
[ 紫相 ] 守事业宫 ， 常居副贰 ， 虽实际工作独当 ～ 面 ， 而名义则不如实际 。 
[ 紫相 ] 守事业 宫 ， 见吉化 ， 宜从事财经工作 。 若从 商 ， 以资金营运数额巨大者 
为宜 。 最喜巨门化禄来夹 ， 主得道多助 ， 故亦可从政 。 
[ 紫相 ] 守事业宫 ， 亦宜与人合作 ， 唯必须实际参加 领导核心工作 。 
[ 紫相 ] 为刑忌夹 ， 无煞 ， 主事业受掣肘 ； 有煞 ， 则 仅宜工艺以谋生 。 
[ 紫相 ] 与科文诸曜同度 ， 又见煞耗 ， 则宜从事文艺 、 自由职业为宜 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """巳亥 [ 紫微七杀 ] 在事业宫 ， 其特长在于管理 ， 故宜 以人力资源为主 。 唯若更见紫 
微化权 ， 则独断独行 ， 影铜管理效果 。 
[ 紫杀 ] 不宜见廉贞化忌 ， 否则易生破败 ， 见常因感 情用事而 来 。 
[ 紫杀 ] 守事业宫亦主身心劳累 。 见煞者且常受同行 或同事挑战 ， 应付为劳 。 
[ 紫杀 ] 见禄马交驰 ， 一生三度转业然后始安定 。 会 箍军化禄者 ， 身兼三职或常 
负担额外任务 。 
『 紫杀 』 最喜紫微化科 ， 可加强管理领导之力 。 更百 官朝拱 ， 亦可从政 ! 在商则 
为行业领袖 。 
『 紫杀 』 见煞忌 ， 一生必有破败 ， 煞忌重者 ， 且虽东 山复起 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守事业宫 ， 主一生事业多变 ， 而且不稳定 。 倘 火铃同度 ， 则更增加其波动 
性质 。 
天机化禄 ， 不能改变其不稳定的性质 。 若吉星祥曜 会合 ， 则可能转变到从事有 
前途的工 作 。 或仅多兼职 ， 或同时从事两三种事业 。 
天机化权 ， 性质变为稳定 。 但亦必先发生一次改变 ， 然后才能从事较为稳定的 
事业 。 若左辅右弼同度 ， 则身兼数职 ， 或有多种事业发展 ， 唯所兼职务均为较长期 
工作 。 
天机化科 ， 则宜计划 、 管理 、 设计等工作 ， 在行业 中有声誉 。 若从商 ， 以零售 
业为宜 ， 唯必须注意 ， 生意与知名度有密切关系 。 
若天机化忌 ， 则主不守一业 ， 甫安定便告更张 。 所 更张皆源于计划错误 。 见空 
劫 、 煞耗诸曜者 ， 更属动辄得咎 。 趋吉避凶之道 ， 在于寻求保守 ， 不可为似乎有利 
的假象所吸引 ， 以致反为失机 。 
天机化忌与吉曜同会者 ， 则以从事经纪业为宜 。 亦 可成为代理商 。 若命富有太 
阳化科 ， 则宜代理名牌商品 ， 嚣为著名字号经纪 。 唯一生必多竞争 ， 且主受对手中 
伤 。 
凡事业宫天机坐守 ， 从事行业以带不稳定性质音为 宜 。 零售业无固定客户 ， 为 
其一例 。 此外如运输 、 交通 、 旅游 、 传播等行业 ， 亦带不稳定色彩 。 学者可由上例 
意会所谓不稳定之性质 。 
天机化权 、 化禄 、 化忌者 ， 均有投机 、 冒险的倾向 。 其中以化忌者最为不宜 见 
煞刑 、 虚耗 、 空劫等凶曜者亦 不宜 。 
天机禄忌相冲者 ， 一生事业必有倾覆之虞 。 见煞者 倾覆 ， 见吉曜则 终可无恙 。 
若吉煞交集 ； 则视大运 、 流年吉凶以定其安危 。 
天机与昌曲 、 天才同度 ， 宜计划 - 设计 ； 与龙池凤 阁同度 ， 则主有技艺 ； 与火铃 
同度 ， 事业以不稳定者为宜 。 
天机化忌 ， 则宜从事保险 。 若天机与天刑天月同度 ， 则可从事外科手术 ， 或用凶器的行业 ， 或带危险性质的工作 。 
天机化科 ， 事业亦主变动 。 由于命宫 [ 天同巨门 ] 之 巨门必同时化忌 ， 因此常劳 
心费神 ， 兼顾额外工作 ， 有能者多劳之叹 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天机"):
                tmp = """ 子午宫天机独坐 ， 对宫巨门 ， 即使会吉星祥曜 ， 其 事业亦必费心机 。 倘有煞忌 
刑耗诸曜 ， 则往往受客观环境影响 ， 为事业奔波劳累 。 
唯天机在子午宫守事业 ， 必成 。 [ 机月同梁 ] 格 ， 亦主 创业之力薄弱 。 当局者亦 
必自有一套人生哲学来解释自己艄性 。 见煞者虽何惰性 ， 但仍须不断为事业操心 ， 
然 不易有建树 。 
若天机在于午富化禄 ， 则财帛宫太阴必同时 化忌 ， 增加其事业上投机的倾向 。 
子宫天移不如午宫 。 在午宫者 ， 宜承继父业发展 ， 亦宜入大机构 ， 在现成局面 
下发展 。 倘经商 ， 则宜注意商标声誉 。 在子宫 ． 其辛苦劳累往往倍之 。 且易招是非 
怨忌 。 
子午天机化忌 ， 必因事业而招人身攻击 。 
在现代 ， 予午天机守事业宫者 ， 亦可从事传播 、 广告行业 。 此与商标声誉同义 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天机"):
                tmp = """丑未天机在事业寓 ， 天机落陷 ， 故宜在公司机构任 职 。 若见辅佐舂曜 。 则服务 
机构局面较大 。 见煞忌刑耗者 ， 则常转换事业 ， 或转换服务机构 ， 且局面不大 。 
丑未天机亦主事业带任务任怨性质 。 
若天机化禄 j 则以从事零售业为宜 ， 若以零售业为 佳 。 
天机在丑未富守事业 ， 由于与天梁相对 ， 有计划 、 监察 、 管理的意味 。 故亦可 
服务大机构任财经部门 、 会计部门 、 计划部门之职 。 如行业带流动 、 服务色彩 ： 营 
尤直 。 
见煞忌 ， 宜在工业界服务 。 
见巨门化权 ， 宜口舌生财 ， 故最宜从事销售部门 之监管计划工作 ： 有时亦可从 
事自由职业 ， 如传播 、 广告 、 计划 、 推广等 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天机太阴"):
                tmp = """寅申宫 [ 天机太队 ] 守事业宫 ， 若天机化禄则太阴 ， 认 同时化忌 ， 若从事投机 ， 
必然失败 。 且一生多是非刑忌 。 认须心胸广阔 ， 不志在求财 ， 随遇而安 ， 反而可获良好 际遇 。 
[ 天机太阴 ] 守事业宫 ， 亦主由现成事业发展 。 若太 阴化禄 、 天机化科 ， 又会天 
同化权者 ， 主有祖上产业 ， 鼓主有长辈荫庇 ， 由是得克享富贵 。 克享之道 。 在于守 
成 ， 而不在于开创 。 
若 [ 天机太阴 ] 守事业宫而无禄 、 权 、 科会者 ， 则宜 在政府或大机构发展 。 一般 
宜任职而不宜经商 。 
有煞忌 、 空劫 ， 则绝不宜经商 ， 否则必有一次重大 破败 ， 以大运 、 流年复见空 
劫刑忌 ， 又有流煞冲会之年为克应 。 
若 [ 天机太阴 ] 为紫微化权 、 天府化科所夹 ， 则 [ 机 阴 ] 由动荡变为稳定 ， 若任公 
职 ， 必有权力 ， 唯亦易招惹烦 恼是非 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯酉宫 [ 天机巨门 ] 守事业宫 ， 必须有化禄或禄存同 度 ， 始有事业发展 。 唯巨门 
化禄则较优 。 盖天机化禄 ， 则易因事业失机而生破耗 。 尤忌投机 。 
[ 天机巨门 ] 守事业宫者 ， 纵有祖业亦必破败 ， 然后 自兴 。 若见煞忌刑耗 ， 则事 
业动荡 。 
天机巨门化忌者 ， 若天机化忌 ， 则仅主事业多变 迁 ； 巨门化忌 ， 则事业宜注意 
口舌生财的性质 。 
『 天机巨门 ] 不喜火铃同度 ， 纵有化禄或禄存 ， 亦为 破格 。 盖为破格 。 盖火铃二 
曜 ， 均足以增加天机之浮荡 ， 巨门之是非 。 
[ 天机巨门 ] 守事业宫 ， 亦不喜借会太阳化忌 ， 主是 非尤怨 ， 故必须 从事 [ 口舌生 
财 J 的行业 ， 如传播 、 法律之 类 。 倘见吉曜 ， 亦仅宜零售业 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """辰戌宫 『 天机天梁 』 ， 最易兼行兼职 ， 见吉化 、 吉曜 ， 以从事顾问工作为适宜 。 
若 [ 天机天梁 ] 见禄 、 权 、 科会 ， 及辅佐吉曜 ， 则亦 可从政 ， 但较难独当一面 ， 
且职位调动频仍 。 由于借会 【 太阳巨门 】 ， 故宜外交工作 。 若服务于企业 ， 则以公关 
之类宜 。 
[ 天机天梁 ] 见煞 ， 以专业技能为佳 。 
天机天梁喜会太阳化禄 ， 则须先建立地位而后寻 求较高收入 ； 亦喜会太阴化禄 ， 
则可从事财务专业 ， 以带监督 、 管理性质者为宜 。 
[ 天机天梁 ] 主变动 ， 在现代 ， 亦可从事电子 、 电脑 等行业 。 
[ 天机天梁 ] 与空劫同度 ． 能突破传统概念 ， 于行业 中有所建树者 ， 则亦能富贵 。 
若不在乎事业 ， 但求随遇而安 ， 则事业变动频仍 ， 终至一事无成 。 
[ 天机天梁 ] 见吉化 、 吉曜 ， 及天巫 ， 亦主有祖上遗 业承继 ， 或由现成事业发展 ，。 
但若吉煞交集 ， 则必破尽祖业而后兴家 。 或不守现成事业 ， 经挫折后另创新业 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天机"):
                tmp = """巳亥宫天机 ， 见吉化 、 吉曜 ， 亦主有遗产 、 遗业承 继 。 或主现成局面下发展 。 
巳亥天机守事业宫者 ， 无论见吉曜或煞曜 ， 均主有 重大行业变动 。 唯无论如何 
改变 ， 均不离服务性质 。 
巳 亥天机与火铃 、 空劫同度者 ， 事业变动频仍 ， 或 时时转换工作岗位 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳守事业宫 ， 吉则事业广大 ， 声名鼎盛 ； 凶则事 业空虚 ， 浮夸不实 。 
太阳主贵 ， 故守事业宫颇为适合 。 吉则在行业中必 有声名 ， 纵凶亦主有号召力 。 
太阳守事业宫 、 入庙 ， 又见魁钺 、 辅弼 、 昌曲者 ， 不但事业广大 ， 而亦 主下属 
众多 。 但若不见禄存 、 化禄者 ， 则仅得声名而无实利 。 倘稍见煞 ， 更主虚名虚利 。 
[ 阳梁昌禄 ] 守事业宫 ， 主宜从事学术研究 。 但小心 此格有许多变格 ， 例如文昌 
化忌 ， 即其 研究 一 生质便宜带 有较低层次色彩 。 在古代 ， 重士子 ， 轻商人 ， 故亦可 
视为商业研究的星曜组合 ； 又如带有刑煞 ， 则往往为工业的研究 。 
[ 阳梁昌禄 ] 又主竞争 ， 所以宜从事竞争 性大的行业 。 在此各种不同的社会环境 ， 
有不同的行业 ， 须加注意 。 
太阳常动 ， 因此守事业宫时 ， 亦主其一生必不守一 业 ， 除非所业系带极专门性 
质 ， 或职业之涵盖面广 ， 接触面广 ( 如社会工 作者 ， 保险经纪等 。 ) 
太阳与火铃羊陀同度 ， 其动更甚 ， 故宜从事本质奔 忙变动的行业 。 但此种动象 
又与天机不同 ， 天机之动 ， 缺少气派 ， 所以可能为运输 、 航海之类 ， 而太阳之动 ， 
则始终有一种气势 ， 故如外交之类 ， 或主持一机构之公关 ， 或为传播事业 ， 学者对 
其 [ 动 ] 的性质须多加体会 。 
太阳主散 ， 故容易流为空虚不实 ， 加空 劫者尤然 。 但亦可利用此种性质 ， 于空 
中楼阁创造事业 ， 此即为发明创造 ， 或仅凭一个特殊意念即可兴家的星系 。 
太阳与魁钺同会 ， 古人认为乃 [ 近贵 ] 之兆 ， 所谓 [ 近贵 ] ， 即是能获人提拔扶持 。 
在现代则为机会的 提供 。 但亦可以看作是在政府部门工作 ， 或半官方机构 、， 大企业 
财团服务 ， 较容易受上司常识提拔 。 
昌曲入事业宫 ， 为文学 、 艺术 ， 但宜与太阴同度 。 若太阳昌曲同躔 ， 其贵反而 
较轻 ， 仅主其事业与文艺有关 ， 或与传播 、 公关 、 演艺等有关 。 
太阳喜左辅 、 右弼同会事业宫 ， 则可减少其发射力 ， 亦即较少奔劳 。 
太阳化禄 ，、 事业以声名为主 ， 若经商 ， 尤须注意商 标 、 商誉 。 若从事学术 、 传 
播 、 演艺 ， 则须注意发挥一己之特长 。 
太阳化权 ， 则巨门必同时化禄 。 在事业宫 ， 此为受 异族提拔 、 赏识之星系 ， 或 
一生事业与异族有 莫大关系 ， 因此须提高外语知识 ， 俾便适应 。 倘当局者的地理环 
境 ， 无法接触外语及异族 ， 则不妨将范围缩小为异乡 ， 学习异乡方言 ， 常亦有裨益 
于事业 。 
太阳化科 ， 宜事业有荣誉感 。 例如名医 、 名律师 ， 或有声誉的社会工作者之类 ， 
皆不出专业人士范围 。 有时亦表徵为一种必须有声誉 ， 或必须受人信赖的行业 ， 前青如经纪行 ， 后者如公证行 。 
太阳化忌 ， 所从事行业必须有排难解纷 ， 或是非 口舌的色彩 。 但所谓 口舌 是非 
却未必指纷争 ， 如教学 、 演唱 等 ， 皆为 [ 口舌以求财 。 
太阳入庙 ， 然后事业始主广大 ， 兼且亦易声名显赫 。 若落陷 ， 则纵有声名亦不 
出乡里 ， 或仅在行业中有声誉 ， 不为社会人士所知 。 
太阳亦喜三台八座 ， 恩光天贵等杂曜朝拱 ， 皆有助 于事业 。 古人视为门生弟子 
众多之兆 。 
唯太阳与华盖同度 ， 又同会空劫 ， 则 往往为哲学 、 宗教的表徵 。 与天德同度 ， 
则宜与人排难解纷 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "太阳"):
                tmp = """子午宫太阳 ， 与天梁对拱 ， 名重于利 ， 最宜专业工 作 ， 或建立商标商誉 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "太阳太阴"):
                tmp = """ 
丑未宫 [ 太阴太阳 ] 同度 ， 吉则名利双收 ， 凶则仅虚 名虚利 。 
辰戌宫太阳与太阴相对 ， 落于罗网 ， 因此与丑未宫 比较 ， 反而较踏实沉潜 ， 专 
业色彩亦较浓厚 。 
太阳太阴的星系 ， 在事业宫 ， 比较倾向于内务 。 故 以行政管理 财务计划等为宜 。 
太阳太阴守事业宫 ， 入庙则事业广大 ， 落陷则事业 空虚 。 但皆主变动 ， 仅程 度 
上有所差异耳 。 所谓变动 ， 有时又主带动态的行业而言 。 
一般而言 ， 太阴吉化主富 ， 或所业与财政金融有关 ； 太阳吉化主贵 ， 所业以服 
务性者为佳 。 
太阳太阴与空劫同度 ， 其由空中楼阁创造事业的能 机一般较太阳天梁星系为弱 。 
因易改变主意 ， 反成进退失据 。 
太阳太阴的组合 ， 若太阴化忌 ， 反宜从事参与灾难 与困扰的行业 ； 若太阴化忌 ， 
则仅宜内务工作 ， 以不出锋头为宜 。 
太阳太阴守事业宫 ， 若见煞刑诸曜 ， 则事业上必有 一段时期受到同业或同事的 
排挤 。 同时见忌星者 ， 不宜同流合污 ， 否则反受拖累牵连 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "太阳巨门"):
                tmp = """寅申宫 『 太 阳 巨门 』 同度 ， 基本性质为口舌 、 为异族 、 为外务一一这三种性质 ， 
均与太阳太阴的组合性质相反 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "太阳天梁"):
                tmp = """卯酉太阳天梁同度 ， 亦为名重于利 ， 亦宜专业 工作 ， 但事业却较子午宫者不 
稳定 ， 尤以酉宫者为然 ， 必须日夜奔忙 ， 或不居一地 ， 或时时更换工作环境 。 
太阳天梁的星系 ， 最宜从事医药 、 保险等 服务性行 业 。 但若见煞 、 天姚 、 天刑 、 
大耗 、 劫煞等杂曜 ， 则易由偏门或半偏行业起家 。 
凡太阳天梁星系守事业宫 ， 本身即带刑忌孤克色 彩 。 医药用以治病 ， 不病则不 
必求医 ； 保险用以救济 ， 开灾难则不必救济 ， 则此意义 ， 即可解释行业性质 。 
然而太阳天梁又可引伸为监察 、 管理 ， 紫系由刑法 引申而来 ， 成为纪律 、 条例 
的意义 。 即使学术研究 ， 亦须遵守原则 。 
但无论如何 ， 太阳天梁必带社会服务的色彩 ， 故即 使成 [ 阳梁昌禄 ] 格者 ， 其研 
究性质亦必须直接服务于社会 ， 不能单纯局限于理论 。 除非空劫同度 ， 始作别论 。 
太阳天梁不见 科文诸曜 ， 又落陷 ， 见煞忌 ， 杂曜 ， 又吉凶交集者 ， 则多主半偏 
或偏门 ， 但仍带服务色彩 。 极端而言 ， 例如贩毒 ， 亦可视之为药物的服务 。 
太阳天梁有时又为宗教 ， 或神秘事物 。 此以见化盖 、 空劫为然 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "太阳巨门"):
                tmp = """ 巳亥宫太阳守事业宫 ， 对宫必为巨门 ， 本质亦与寅 申宫者相近 ， 但外务性质则 
更重 ， 巳宫者又重于亥宫 。 ( 以 寅申二宫言 ， 寅宫又重于申宫 。 ) 
太阳巨门见吉化 ， 均主传播 、 广告等业成名 。 巨门 化禄者尤长于口才 。 若同时 
见辅弼 、 昌曲 、 三台八座 、 恩光天贵等曜 ， 则宜从政 ， 且宜外交 。 
太阳巨门而巨门化忌 ， 格局高者宜公关 、 法律 、 传 播 、 演艺 ； 格局稍弱者则为 
教学 、 推销之类 。 倘更见煞诸曜 ， 则古人认为所业与酒色财气有关 。 
若太 阳化忌 ， 所业非带排难解纷色彩不可 ， 否则反 易招压力 。 
太阳化禄 、 化权 ， 均主因异族关系而得财 。 或凭口 才 、 语言 、 歌唱等才艺以得 
财 。 此种性质 ， 寅申宫重于巳亥宫 。 
太阳巨门的星曜组合 ， 如太阳落陷 ， 则不宜 。 意求 名 ， 故凡带出锋头性质的行 
业均有所不宜 。 此非指个人而言 ， 例如广告行为 ， 本身即带出锋头的性质 。 
但太阳落陷且化 为忌星者 ， 若有吉星同会 ， 无四煞刑耗诸曜 ， 则又以出锋头为 
宜 ， 虽招指责 ， 反而成名 。 如影视界的歹角 、 走偏锋的律师之类 。 格低者则为贩夫 
走卒 。 
太阳巨门见化忌不宜从政 ； 巨门化忌固招是非 ， 若 太阳化忌则易招怨 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为财星 ， 守事业宫时 ， 利于从事财经工作 ， 或 为赋税官吏 。 此以得化禄 、 
化权 、 化科者为宜 。 且宜见辅佐吉曜 。 
武曲又为金星 ， 故主事业性质带有金属 。 倘与煞嚯 同躔 ， 主 艺占代订定为金匠 
银匠 、 铜 匠 ， 即称 『 三匠 』。 现代工艺行业为多 ， 凡工 程技艺皆属此类 。 
倘武曲不与煞星同度 ， 但却在三方会合 ， 叉见破军 、 七杀者 ， 则金属性质转为 
利器 ， 宜从事 利器以求财的行 业 。 如军旅 、 警察 、 外科医生及牙医等 。 
凡武曲居事业富 ， 均与金属有关 ( 古代的钱银亦为 金属 ) ， 且主行动 。 例如从事 
借贷即为 ， 一种行动 ， 与负责财 务计划不同 ) 。 所以喜见左辅右弼 ， 主行动有助力 。 
昌曲未 必皆喜 ， 因为有时昌曲反而成为行动的障碍 ， 令人犹豫不决 。 故武曲与昌曲 
同会 ， 必须兼见辅弼 ， 或兼见魁钺 ， 然后始为将才或财赋官吏 。 
武曲居寅申 、 卯酉 、 巳亥六个宫垣 ， 为武曲坐闲宫 ， 古人说 ：【 武曲闲宫多手艺 】 ， 
此以与煞曜同躔为确 。 这种 格局却喜见昌曲 ， 主手艺或技艺不俗 。 唯产科 、 外科 、 
牙科医生等亦属 『 手艺 ] ， 未必指工匠而言 。 
武曲与火铃同度 ， 则不喜更落于巳午二宫 ， 亦不喜 多见属火的星曜 ， 否则一生 
至少有一次卸职或 失业 。 以重见武曲 ， 又逢煞忌冲起的大限或流年为克应之期 。 
武曲化科 ， 主声誉 ， 故无论从事何种行业 ， 均以建 立声誉为要务 。 如首饰设计 
之款式 、 银行投资之行动 ， 皆为建立声誉之目标 。
武曲化忌 ， 经商者每感资金不足 ， 不能依理想发展 。 故宜从事技艺为宜 。 一一 
逢武曲化忌的大运流年 ， 亦应小心财力不足以发展事业的现象 。 
武曲最不喜与陀罗同度 ， 因陀罗亦为忌星 。 
但武曲化忌 ， 或陀罗同度 ， 却又宜从事带凶险 、 冒 险性质的行业 。 如蛙人 、 殡 
仪之类 。 只须见吉曜同时会合 ， 亦可发迹变泰 。 
大抵厘定武曲居事业宫的格 局高低 ， 以入庙与否为 主 。 有无吉化及辅佐诸曜 ， 
则可作为参考 。 唯武曲最喜会廉贞化禄 ， 即武曲亦同时化为科星 ， 这种吉化则有助 
于订为高格 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "武曲天府"):
                tmp = """子午宫 [ 武曲 天府 ] 对宫为七杀 ， 无煞忌刑而有禄 ， 则主为财赋之官 ， 倘更见辅 
佐诸曜 ， 其人地位必相当 。 唯若三方见煞 ， 则主为武职 ， 同时见辅佐诸曜者 ， 以军 
功起家 。 
[ 武曲天府 ] 与煞曜同度 ， 则宜工程技艺 。 亦以有禄 为佳 。 
[ 武曲天府 ] 而天府化科 ， 虽无禄 ， 亦以财经事业为 宜 。 
[ 武曲天府 ] ， 子宫优于午宫 ， 盖子宫者 ， 对宫七杀 在午 ， 有火炼阴金之象 ， 可 
影响 [ 武府 ] 之性质 ， 经磨练而 成大器 ， 倘见辅佐诸曜同拱 ， 更宜行伍出身 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "武曲贪狼"):
                tmp = """丑未 [ 武曲贪狼 ] ， 见贪狼化忌者 ， 终生不得闲暇 ， 奔波劳碌 ， 事业多端 ， 甚或 
半官半商 ， 为财是务 。 
[ 武曲贪狼 ] 而贪狼化禄者 ， 无煞曜而有辅佐吉曜 ， 可成巨富 。 唯经商者难免暴 
利 。 故稍有煞刑 ， 即易暴起暴败 ， 不独 [ 火贪 ] ， [ 铃贪 ] 格为然 。 
[ 武曲贪狼 ] 亦可会财赋之职 ， 或任财经企业 ， 但 [ 火 贪 ] 、 [ 铃贪 ] 皆主贪墨 ， 唯 
武曲化为科星者 ， 可免因贪致祸 。 
[ 武曲贪狼 ] 而武曲化禄 、 贪狼化权者 ， 其事业亦必 与财经有关 ， 但同时亦必经 
营潮流所趋之行业 。 
[ 武曲贪狼 ] 守事业宫 ， 喜与人合作 ， 故所业亦不只 一端 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "武曲天相"):
                tmp = """寅申宫 [ 武曲天相 ] ， 主文职武做 ， 或武职文做 。 一 － 在现代 ， 文武区分不易 ， 
大致而言 ， 内务属文 ， 外务属武 ； 财经等事业属文 ， 工程等事业属武 。 
【 武曲天相 】 与桃花诸电信局同度 ， 又与文曲同躔 ， 则为伶人 。 唯以不见吉化 
吉曜者始确 。 倘煞曜重重 ， 则主辛霜露酸 ， 江湖流浪 。 
[ 武曲天相 ] 为财荫夹者 ， 甚宜任职财经部门 ； 若为 刑忌所夹 ， 则经商亦有所不 
宜 。 
【 武曲天相 】 守事业宫 ， 有吉化 ， 亦主与人合作 ， 且 须负实际责任 。 
[ 武曲天相 ] 与煞曜同会 者 ， 宜由工程技艺发展 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "武曲七杀"):
                tmp = """卯酉宫 [ 武曲 七 杀 ] 有煞曜在三方者 ， 宜军旅出身 。 见辅佐吉曜 ， 必可劳身 。 若 
煞在本宫 ， 则仅主工程技艺 。 亦以带金属性质者为宜占 
[ 武曲七杀 ] 与四煞空劫同度者 ， 一主颠沛流离 ， 无论 从军从工 ， 均主事业饱经 
挫折 。 
酉宫 [ 武曲七杀 ] 喜火星同度 ， 卯宫则不喜 。 盖酉宫 【 武杀 】 得火星为锻炼 ， 主 
经挫折而得成就 。 卯宫属木 ， 得 火星嫌火过旺 ， 纳音属火者尤忌 。 主辛劳而无结果 。 
[ 武曲七杀 ] 得禄者 ， 亦宜财经工作 ， 且擅长营运 。 以 见吉化吉曜为佳 ， 煞重则 
须防挫折 。 
[ 武杀 ] 见 煞刑诸曜 ， 亦主外科手术 ， 跌打疮科之类 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "武曲"):
                tmp = """辰戌宫武曲独坐 ， ‘ 与贪狼相对 ， 其性质与 [ 武贪 ] 大 致相同 ， 唯武曲落罗网 ， 
故贪得之性稍减 。 
若成 [ 火贪 ] 、 ( 铃贪 】 格者 ， 其事业亦带暴利或贪污 色彩 ， 故主暴起暴跌 。 
最不腚与空劫同度 ， 主一生至少经一次挫折 ， 或主 不良不莠 ， 难以成器 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "武曲破军"):
                tmp = """巳亥宫 [ 武曲破军 】， 常主喜插手任何事业 ， 不考虑 自己的特长 。 故吉则事业众 
多 ， 凶则事业多变 。 
与天刑同度蕾 ， 宜军旅或纪律部队出身 ， 或负情报 治安之责 。 以见辅佐吉曜为 
宜 ， 若煞忌重重 ， 则须防凶危 。 
『 武破 』 在事业宫 ， 与铃星 、 陀罗 、 阴煞 、 华盖 、 天 刑同度者 ， 为偏门或半偏 
行业 。 
[ 武破 ] 煞轻 ， 亦宜工程技术起家 ， 若 【 武破 】 吉化 ， 同时又见廉贞化禄或贪狼 
化橡者 ， 亦可经商 ， 则 虽时生计较之心 ， 但手面则异常阔绰 。 
『 武破 』 见 军化禄 ， 擅开剑而不擅守 城 ， 主意多 而不喜务实 。 故必须与魁钺同 
会 ， 然后始得机会 ； 与辅弼同会 ， 然后始主多得助力 。 
[ 武破 ] 见廉贞化忌 ， 常主血光之灾 ， 从事军旅者有 所不宜 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守事业宫 ， 主事业必由白手创兴 。 自另一个意 义而言 ， 则是纵有父业亦难 
承继 ， 有须经历困难然后始事业有成 。 
天同化禄 ， 或与禄存同度 ． 白手创业的意味尤其明 显 。 且有时主至中年以后始 
能立足脚跟 ， 中年以前 ， 事业反复多变 。 
天同化忌 ， 往往早年即须工作 ， 但事业之创兴却可 能比化禄者为早 ， 中年以后 
若能稳守 ， 即可踌躇志满 。 存辰戌丑未四宫者尤确 ， 又以在戌宫者最为上格 ， 未宫 
次之 。 
天同在事业宫 ， 往往不必见禄马 ， 亦主宜离乡背井 发展 。 ( 在命宫者有时亦然 。 ) 
天同对四煞异常敏感 。 擎羊同度 ， 主事业发生争夺 、 竞争 ， 陀罗同度 ， 主事业 
发展至一阶段 ， 好发生无形变动 ： 火铃同度 ， 主多焦虑 ， 主多焦虑 ， 须呕尽心血后 
始能有成 。 故当四煞 同度之时 ， 天同若化为忌星者 ， 则一生事业必波折重重 ， 与天 
同化忌不与煞星同度者 ， 性质截然不同 。 
天同又为艺术之星 ， 且倾向于音乐 ， 居事业宫 ， 有桃花诸曜同会者 ， 可向艺术 
发展 ； 唯 [ 天同天梁 ] 的星系 ， 必 须不见火铃始是 ， 否则定主半途而废 。 
天同与空劫同度 ， 亦加强其艺术气质 ， 唯必须建立 个人独特风格 ， 且亦有此潜 
质 。
天同在命宫或事业宫 ， 火铃同度或对拱 ， 声线带沙 ， 若从事音乐 、 歌唱 ， 必须 
注意风格之配合 。 
天同与昌曲 、 天才同度 ， 亦宜文艺事业 。 龙池 、 凤 阁同度 ， 财为器乐 ， 或为文 
化事业中的技术工作者 。 
天同与左辅右弼同会 ， 须天同不化忌星始主得助 力 ， 否则纵有下属 ， 却有帮不 
上忙之感 ， 仍须亲力亲为 。 
天同又 主享受 ， 故居事业宫 ， 每主适宜经营美观或带享受色彩之行业 。 
天同不宜入墓 ( 即与长生十二神的墓星同度 ) ， 主 事业与个性不相投 。 或觉得有 
[ 不逢明主 ] 的感觉 。 
六宫天同独坐 ， 详细推断可参考前段所述天同 的特质 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天同太阴"):
                tmp = """子午宫 [ 天同太阴 ] ， 若见禄存 ， 或见化禄 ， 则主有 父业承继 ， 且可守成 。 或主 
在现成局面下发展 ， 不宜创新 。 
[ 天同太阴 ] 守事业宫 ， 亦主事业多变 ， 且主有多方 面的事业 。 即使在政府机关 
或企业机构任职 ， 其责任亦多 
变动 ， 或不只一端 。 
[ 天同太阴 ] 而太阴化忌 ， 则不守祖业 ， 亦不能守成 ， 必须经变动而后事业财源 
始告稳定 。 
[ 天同太阴 ] 而天同化忌 ， 主动荡不安 ， 每 须背井离乡而后始能白手创业 。 同时 
见火铃者尤确 。 
[ 天同太阴 ] 在事业宫 ， 每为内务外务兼顾人材 ， 且 有责任感 。 唯独当一面之机 
会则较小 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天同巨门"):
                tmp = """丑未宫 [ 天同巨门 ] ， 即使吉辅诸曜毕集 ， 亦主事业 每半途而废 。 
[ 天同巨门 ] 可从事饮食业 ， 见天厨 、 火星同度者尤 然 。 
引申而言 ， [ 天同巨门 ] 守事业宫 ， 亦主口舌 ， 故亦 可成为广告 、 传播等业的表 
徵 。 唯仍须注意及消闲 、 享受的性质 。 故此有时又为 潜水业及水管修理业 。 
[ 天同巨门 ] 又主医药 ， 此系因所会 [ 太阳天梁 ] 有陕 疗意味之故 。 唯多从事外科 
及危症之治疗护理 。 
[ 天同巨门 ] 见煞忌 ， 反主历艰危而成大业 。 天同 忌又优于巨门化忌 ， 艰辛较小 ， 
劳心费神较少 。 
若天同化禄 ， 事业虽较优悠 ， 但成就之期亦晚 ； 巨 门化禄 ， 只宜 【 口舌生财 】 
的行业 。 唯以整体成就而言 ， 反而不及有忌星刺激者之佳 。 
唯 【 天同巨门 】 而煞忌刑耗重重者 ， 则反可能一事无 成 ， 蹉跎至老 。 - 一必须劳 
心费神 ， 或从事本质即属劳心费神 的事业 ， 然后始主成就 。 后天努力可以扭转命运 ， 
此即为一例 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "天同天梁"):
                tmp = """寅申宫 【 天同天梁 】 同度 ， 仅宜出任公职 。 若自己经 营 ， 亦仅宜组织有限公司 ， 
任监察 、 管理之责 。 或所经营行业 ， 本身即有监察 、 管理之性质 。 
【 天同天梁 】 所从事者必以内务为宜 。 如计划 、 管理 之类 。 
[ 天同天梁 ] 有吉化 ， 又见是曲同度 ， 则可从事艺术 工作 ， 但仍须处理内务 ， 即绝非表演行业 ， 以见天梁化科者最为高格 。 
【 天同天梁 】 守事业宫 ， 亦主一生职务多变 ， 或时时 变换工作环境 ，， 或因工作 
须跋涉为劳 ， 或时时须出差工作 。 见禄马交驰者更甚 ， 火铃照会者亦甚 。 唯禄马交 
驰则财刍较旺耳 。 
敞引申而 言 ， 『 天同天梁 』 坐事业宫者 ， 亦可服务于 交通 、 运输等带 变动 性 质的 
行业 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天同"):
                tmp = """卯酉宫天同 ， 与太阴相对 ， 不主有父业承继 。 唯此 星系却带艺术色彩 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天同"):
                tmp = """ 辰戌宫天同落罗网 ， 所从事行业每主志趣不投 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天同"):
                tmp = """巳亥宫天同 ， 若见煞忌 ， 事业带半偏性质 ， 而变动 迁移的情形亦同 [ 同梁 ] """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守事业宫 ， 古人认为属于武职 ， 此乃由于古代 社会仅重视仕途之故 。 在现 
代社会 ， 廉贞其实亦带有浓重的商业色彩 。 
古人论廉贞守事业宫 ， 人庙者 ， 武职显赫 ， 此乃以 不与煞忌同度 者而言 。 若有 
煞 ， 不宜武职 ， 可从事工程工艺 。 
廉贞亦为艺术之星 ， 但倾向于土木工艺 、 竹木雕刻 之类 。 在现代 ， 则常为建筑 
业 ( 不是地产业 ) 。 
廉贞会文昌 、 文曲 ， 主文艺 ， 但不倾向于工艺 。 主 对色彩有特殊敏感 ， 故倾向 
于绘画 、 图案设计之类 。 
廉贞守事业宫 ， 无论何等行业 ， 皆表现得有气派 ， 亦可谓重外表多于实际 。 见 
煞者尤然 。 故最不喜空劫同会 。 
廉贞守事业宫 ， 武曲必在财帛宫 ， 若昌曲入此两宫 度 ( 尤其是文曲与武曲同躔 ) ， 
则主武职文做 ， 或文职武做 。 在现代 ， 此两种性质相当复杂 ， 只能由行业分文武 ， 
再由职责任务分 文武 。 
廉贞亦主精神享受 。 故亦可从事关于此方面的事 业 。 
若廉贞化忌 ， 则宜从事与血液有关 的事业 。 一一此项性质须灵活运用 。 例如 [ 血 
腥导演 ] 亦属此类 ， 由引一例 ， 可知其性质之广泛也 。 
以从政而言 ， 廉贞所会的紫微有吉曜 ， 若百官朝拱 之类 ， 则宜文职 ， 且能独当 
一面 ； 若会 【 紫微七杀 】、 [ 武曲 七 杀 ] ， 或本身即为 [ 廉贞七杀 ] ， 则宜武职荣身 。 亦 
以煞曜 不居本宫为贵 。 
上述性质 ， 可引申入工商两业 。 一般而言 ， 工属武 ， 商属文 。 此为现代社会之 
特徵 ， 不可拘泥于古代社会的观点 。 
廉贞化禄于事业宫 ， 论富裕的 程度 ， 不及廉贞化禄 守命或财帛宫 。 因守事业宫 
时 ， 有可能仅为从事外表奢华的行业 。 如夜总会 、 歌楼舞榭之类 ， 故必须更详财帛 
宫的星曜以定其有财无财 。 
凡廉贞必带出锋头 、 自我表现 、 外表浮夸的性质 ， 或所从事的行业带此类性质 ，
故在斗数中 ， 廉贞不必化科而 [ 化科 ] 在其中矣 。 善于体会此意 ， 对 界 定事业性质甚 
有 帮助 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "廉贞天相"):
                tmp = """子午宫 [ 廉贞天相 ] ， 常主与人合作事业 ， 故须注意 兄弟宫的星曜组是否吉利 ， 
藉此即可推断其事业之成败 。 
[ 廉贞天相 ] ， 亦为从政之星 ， 或至少对政治有兴趣 ， 则必须见天魁天钺 ， 仕途 
始觉亨通 。 若见煞曜 ， 则一波 三折 ， 起跌无常 。 
[ 廉相 ] 会禄 ( 武曲化禄为上 ， 禄存次之 ) ， 或会天府 化科 ， 宜握财权 。 若禄煞交 
躔 ， 则最宜任军需之职 。 此即为武职文做一例 。 
若廉贞化忌 ， 或为刑忌所夹 ， 则以从事血光或凶险 之行业为宜 。 如管理监房 ， 
即为凶险行业之一例 。 若不从事此等行业 ， 则主终身受人压力 。 或遭排挤 ， 或为人 
陷害 。 
无论从商从政 ， 均所不宜 。 
[ 廉相 ] 为财荫所夹 ， 其吉比同会魁钺为更大 。 主一 生受人提携 ， 且多助力 。 或 
主承继现成事业加以开展 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "廉贞七杀"):
                tmp = """丑未宫 [ 廉贞七杀 ] ． 宜武职 。 军警界出身 ， 或在刑 法纪律组织工作 ， 皆为适宜 。 
三 方有煞而本宫无煞者尤确 。 若本宫有煞 ， 则不如从事工业 。 
[ 廉贞 七 杀 ] 而廉贞化忌 ， 更见煞曜同度 ( 空劫不 是 ) ， 则主马革裹尸 ， 故从事军 
警两途皆主殉职 ， 或惹重大 刑法官司 。 故不如从事带血光之行业 ， 如饮食业 、 化验 
所等 ， 反可趋吉避凶 。 
[ 廉贞 七 杀 ] 坐事业宫 ， 一生必至少有一次重大挫折 ， 以见财星化忌二煞刑耗空 
劫凑会之大运及流年为克应之期 。 
[ 廉贞七杀 ] 而廉贞化忌者 ， 以三合宫见忌冲会之流年大运 ， 为见血光克应之期 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "廉贞"):
                tmp = """寅申宫廉贞守事业宫 ， 与贪狼相对 ， 以从商为宜 。 若从政 ， 则易流为各党派集 
团的调和折 衷人物 ， 且易成为傀儡 。 
寅申宫廉贞 ， 亦带投机性质 ， 故若从商 ， 最宜投身 财经金融行业 ， 负买卖之责 。 
亦宜从事基金投资 。 廉贞化安者尤为吉利 ，． 可以白手成富 。 
若廉贞有刑煞曜同会 ， 则可为在会人物 ， 或事业带 半偏色彩 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "廉贞破军"):
                tmp = """卯酉宫 [ 廉贞破军 ] 必须见禄然后始主事业有成 。 以廉贞化禄事业较为顺遂 。 若 
破军化禄 ， 则不但多劳 ， 而 且事业必有挫折 。 
卯西 『 廉破 』 ， 见煞轻者 ． 亦带偏门或半偏门色彩 ， 所从事行业 ， 多外表浮华 ? 
或与酒色财气有关 。 倘吉煞交 集 ， 则不过中下级行政人员 。 
廉破守事业寓 见吉 ， 多因事业而应酗 ， 又由应酬 发展事业 ， 故其所经营 ， 不只 
一端 。 故须注意其兄弟之优劣 ， 而定其事业之成败吉凶 。 
【 廉破 】 而廉贞化忌者 ， 不见天刑 、 四煞 、 空劫 ， 则 虽事业偏门 ， 亦不致惹官 
非刑法 ， 否则必有牢狱之灾 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "廉贞天府"):
                tmp = """辰戌宫廉贞天府同度 ， 事业倾向于财经 。 亦宜经 营与金属有关的行业 。 
廉府守 事业宫 ． 最喜廉贞化禄 ， 则可成富格 。 天府化科 ， 则事业与声誉有密切关系 。 
古人以 [ 廉府 ] 守事业宫 ， 见昌曲 、 辅弼 、 魁钺 ， 为 文武兼资 ， 大富大贵 。 此意 
在现代可以参考 ， 或可引申为工商兼业 ， 或半政半商 ， 噍必以与财经金融有 关者为 
宜 。 
若廉贞化忌 ， 则不宜从事金融更见煞 ， 必因此而 兴讼 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "廉贞贪狼"):
                tmp = """巳亥宫 [ 廉贞贪狼 l 同度 ， 空劫又同瞍耆 ， 最宜艺术 ， 尤以表演行业为宜 。 
若从商 ， 场面必大 。 有禄则可 ， 无禄者易流为外表 豪华 ， 内在空虚 。 
[ 廉贪 ] 守事业宫 ， 往往事业亦不只一端 ， 亦主常易 与人合作 。 
当 [ 廉贪 ] 与煞曜同度 ， 则以从事工业设计 、 工艺美 术为宜 。 
[ 廉贪 ] 而贪狼化忌 ， 一生必有一次重大的转业 。 若 廉贞化忌 ， 则以半偏行业为 
佳 。 或从事饮食业亦可 ， 则必以新潮作为号召 ， 不能守旧有原则 。 
[ 廉贪 ] 守事 业宫者 ， 亦多事业上的应酬 ， 又由应酬 而扩展事业 ， 其性质与 [ 廉破 ] 
略同 ， 唯权力欲则稍逊 。 
[ 廉贪 ] 必须得禄始主发越 ， 倘无禄见煞 ， 只宜工艺 途中走 。 
若 [ 廉贪 ] 有文曲化忌对拱 ， 又见煞忌刑耗诸曜者 ， 主其人童小 ， 其事业亦如之 。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守事业宫 ， 以在现成局面下发展为宜 。 此并不 是说一定有父祖之业可继 ， 
例如参加一已有规模的企业 ， 成为领导阶层人物 ， 即属此种性质 。 
天府入庙 ， 可守现成事业 。 若落陷 ， 则当局者可能 过分谨慎 ， 以致无法在现成 
基础下发展 。 若煞曜同躔者尤甚 。 
凡主星在午宫守 事业宫者 ， 皆主事业广大 ， 天府亦 然 ( 太阴则宜在子 ) 。 以得禄 
为贵 。 此即所谓安命寅宫 ， 府 午宫 、 相戌宫来朝 ， 甲生人一品之荣 ] 。 此乃 [ 武曲天 
府 ] 守 事业宫的上格 。 此格之特点 ， 在于 [ 府相朝垣 ] ， 且天府得 命宫之双禄 。 若无禄 
者 ， 则不入此格 。 
天府必须得禄 ， 然后事业始主亨通 。 否则事业虽佳 ， 亦不过外强中干而已 。 
天府无禄 ， 亦无煞忌刑会照 ， 而有吉星祥曜扶持 ， 则守成亦可 ， 不致殒越 。 若 
既无吉曜 ， 却有煞曜凑会者 ， 则事业易为小人所算 ， 甚至受拖累而致失败 。 
最坏的 结构是 ， 天府落陷 ， 天姚及文曲化忌同度 ， 则主受骗 。 大运及 流年见此 
亦然 。 唯原局见此星系结构时 ， 有时又主此人以巧骗营生 ， 否则亦斯文败类 。 
天府在事业宫 ， 宜兼视财帛宫之天相 ， 以得财荫夹 者为上格 。 若刑忌夹 ， 则事 
业亦受到限制 ， 以任职为宜 ， 不宜自行经商 。 
天府不喜火铃照射 ， 主事业波动 。 以工业 、 工程发 
展者为宜 。 
天府有空劫同度者 ， 事业多进退失据 ， 既思改革 ， 又保守 ， 以致事业发展受到 
障碍 。 故以从事实业为宜 。 切忌投机 。 
天府会羊陀 ， 则主事业有波折 ， 仍以从事工业或工 程为佳 。
仅于得会武曲 ， 又见禄存或化科的场合 ? 所会的夭 相亦无煞曜 ， 然后始主可经 营 
财经金融事业 。 仍以统筹大局为宜 ， 不宜负责实际工作 。 
天府入庙 ，． 化科 ， 则以从事信贷等事业为佳 ， 若有 煞 ， 则仍宜工程或工业 。 
天府不主浮华 ， 凡有经营 ， 皆以脚踏实地为佳 ， 否 则徒自寻烦恼 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫的天府 ， 一般情形下宜任武职 ， 或经营工 业工程 ， 仅在 【 叠禄 】 的情形 
下 ， 始主财经界可以得巨大发展 。 若从政 ， 亦宜为财赋之官 。 
丑未天府守事业宫 ， 巳亥天相无刑忌夹 ， 命宫无正 曜 ， 禄存入度 ， 或仓移富贪 
狼化忌 ， 且禄存在财帛宫者 ， 皆为巨富之格 。 从商从政 ， 皆主名利兼收 。 唯必以无 
火铃 、 空劫 、 刑耗同 度者始合 。 
若丑未宫天相为财阴所夹 ， 但天府却见文昌化忌来 会 ， 则其人必以带投机色彩 
之事业起家 。 因此须祥推流年大运 ， 以定其进退之机 ， 倘时机失误 ，． 则成就受影响 
甚大 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """ """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫天府 ， 若所会之天相为刑忌夹者 ， 不宜投机 ， 亦不宜从事金融行业 。 以 
任职公司机构为宜 ， 更不宜从政 。 
卯酉宫天府 ， 得武曲化禄来会 ， 亦主任财赋之职 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥宫天府守事业宫 ， 对宫为紫微七杀 ， 天府受 此权力之星影响 ， 常有独立自 
主之心 ， 是否适宜 ， 应配合命宫及财帛宫推断 。 
天府对拱紫化权者 ， 权力之星太重 ， 有辅弼扶持尚 可 ， 否则 恐反主孤立 。 
巳亥宫天府 ， 仅慎之心较小 ， 故事业往往带浮夸性 质 。 有煞者更甚 。 若天桃 、 
阴煞同度 ， 文曲化忌来会 ， 则易发展为空头 ， 并因此事业失败 。 
凡天府在巳亥守事业宫 ， 皆以脚踏实地 ， 在 现成局面下稳步发展为宜 。 
若吉星祥曜会合 ， 命宫成火贪格者 ， 则主事业突 然发展 ， 在流年大运良好时 ， 
亦可投机致富 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴主富不主贵 ， 故守事业宫时 ， 必以见文昌文曲 同会 ， 然后始主其人有社会 
地位 。 
太阴会科文诸曜 ， 宜文艺 、 传播事业 ． 亦可从政 ， 
政务亦必与文化有关 。 一一所谓科文诸曜 ， 乃指昌曲 、 龙凤 、 天才 、 化科而言 。 
若见科文诸曜 ， 又见桃花诸曜来会 ， 则主艺术成衾 、 更宜表演艺术 。 
太阴与魁铖或辅弼同会者 ， 可从政 ， 但必须有相当 学历配合 ， 然后始主得所擢 
升而任而任高位 ， 否则徒有虚声 ， 而升仓至一限度即便因循不进 ，． 以致有怀才不遇 
之感 。 
太阴入庙 ， 或 [ 机月同梁 ] 格 ， 得太阴化禄 ， 天同 化权 ， 天机化科 ， 而不见巨门 
化忌 ， 又不见煞曜者 ， 则反宜任职军警界 ， 或刑法纪律部队 ， 可得掌大权 ， 此尤经 
夜生人为贵 ， 曰生人次之 。 
太阴落陷守事 业宫 ， 终生事业变动多端 ， 则帛更难积聚 。 
若太阴落陷 ， 文曲化 忌同度 ， 则为江湖落拓文士 。 
太阴与空劫同会 ， 有科文诸曜合 ， 可突破行业成规 ， 有发明创造 ， 或为工艺发 
明家 ， 无科文诸者 ， 则理想太于现实 ， 无论从事何种行业 ， 均易流为空虚不实 。 
成 [ 机月同梁 ] 格者 ， 如无禄权科会 ， 则必先祥太阴 为入庙抑为落陷 ， 入庙者尚 
可在大机构企业独当面 ， 落陷者只宜因应时势 ， 随遇而安 。 
太阴为财星 ， 主计划而不主行动 ， 故守事业时 ， 即 使所任职务与财政有关 ， 亦 
仅宜计划策划 ， 而不宜实际行动 。 
太阴入庙 ， 得禄 ， 无煞或煞少 ， 与天机化忌同会合 ． 反宜从事投机事业 。 但必 
须大运或流年 配合 。 
太阴会巨门化忌者 ， 主事业伤尽脑筋 ， 或须费尽唇 舌 。 
太阴与天机同度或相对 ， 见吉化吉曜 ． 宜从事工程 工艺 ， 反不宜投机 ， 唯所从 
事工艺工程 ， 仍带流动色彩 ， 如航海工程 、 航空工程 、 运输工业等 。 
若天机化禄 ， 太阴化忌 ， 则绝不宜投机 。 盖太阴化 忌守事业宫 ， 有投资方向错 
误 ， 或受人引诱误导而致投资损耗 。 
太阴会天梁化科 ， 宜从事监督 、 管理工作 ， 或如公 证行之类 。 
太阴最喜欢天同化禄 ， 则亦主白手与家 。 唯若天同化忌者 ， 有煞 ， 主事业挫折 ， 
无煞 ， 则由低层发展 ， 终能成就 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉太阴 守事业宫 ， 天同对拱 。 一般情形下 酉 优于 卯 ， 在酉事业广大 ， 可以扩 
展至外国 ， 或一生事业与外国有关 ， 在卯者 ， 以任职为宜 。卯酉 、 巳亥宫太阴见科文诸曜亦宜从事广告或传 播 ， 此以见太阳及天梁吉化者 
始成大器 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 辰戌太阴守事业宫 ， 与太阳对拱 。 若太阳化忌 ， 则 宜任职内务 ， 若太阳化禄 ， 
则为外务人材 ， 无化曜 ， 则以戌宫优于辰宫 。 唯皆主从事带流动 ， 仓移色彩的行业 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """ 巳亥宫太阴 ， 亥富优于巳宫甚多 。 在巳宫者 ， 易疑沛流离 。 大亥宫 ， 有吉化吉 
曜 ， 亦能成富 。 
巳亥宫太阴守事业宫 ， 有煞 ， 以工程为宜 ， 尤且申 子 、 电脑工程 。卯酉 、 巳亥宫太阴见科文诸曜亦宜从事广告或传 播 ， 此以见太阳及天梁吉化者 
始成大器 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """一贪狼守事业宫 ， 主其事业倾向于消费 、 交际 ， 或由 社交而成事业 。 化禄 、 化 
权者 ， 此项性质尤重 ， 故绝对适宜于外务 。 
贪狼与昌曲同 度 ， 最宜公开事业 ， 或可从事带娱乐性之传播事业 。 
若与桃花同度 ， 则其事业以多与异性接触者为宜 。 否则宜从事消费 ， 装饰或娱 
乐事业 。 
贪狼如与空劫同度 ， 须视有无昌曲 ， 有则为艺术 ， 无则宜从事实业 。 
贪狼亦带艺术性质 ， 但廉贞静态 ， 贪狼却为动态 。 二者基本性质不同 。 
在现代 ， 贪狼亦主运动 ， 或带韵律性之运动 ( 如芭 蕾舞 ) 。 故若贪狼化权 ， 见煞 
曜而不多者 ， 往往主运动场上 竞争 。
贪狼与吉化 、 吉曜会合者 ， 又见三台八座 、 台辅封 诸 、 天官天福 、 恩光天贵等 
吉曜者 ， 亦可从政 ， 且主折衷调和 ． 或为各派系势力之缓冲人物 。 
火贪铃贪于辰戌丑未四宫 ， 乃主持掌兵权 ， 或 在警察纪律刑法部门任职 。 
贪狼与羊陀同茺 ， 则以从商为宜 。 亦须从事消费行 业 或行业性质与装饰 、 娱乐 、 
消费品有关 。 
贪狼与左辅右弼同度 ， 则主下属众多 ， 故所经营之 事业说必有相当气派 。 
贪狼亦为饮食之星 ( 廉贞主血 ， 贪狼主肉 ) ， 不化 忌 ， 便主有饮食品味 。 见火星 、 
天 府 。 可从事饮食业工作 。 
贪狼化忌在事业宫者 ， 主凡插手事业必引起竞争 。 有煞曜同度者更甚 ， 空劫同 
度则主因竞争而遭挫折 。 
若贪狼化忌有吉曜同会 ， 则理想之事业虽不能达到 目的 ． 但却别有天地 ， 可由 
此创建新猷 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午贪狼与紫微对拱 ， 主独当一面 ， 或主自由职业 。 以带艺术 、 美观 、 享受色 
彩者为宜 。 
若见桃花 、 昌曲 ， 则宜经营与异性有关之事业 。 
若见禄权科 ， 及辅佐吉曜 ， 则以政界为宜 。 唯若有 羊陀会照 ， 或擎羊同度者 ， 
为政多贪墨 。 
子午贪狼与天刑同度 ， 亦主刑法 ， 或主为艺术表演 之幕后策 划 、 编导人枕 。 盖 
台前表演须完全依照幕后之策划 ， 故亦有纪律 、 原则的意味也 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫贪狼与廉贞相对 ， 最不宜陀罗同度 。 见煞 ( 火 铃亦然 ) ， 主为政贪墨 ， 终 
因此致祸 。 唯为商暴利者 ， 虽有 挫跌之虞 ， 却无官非 。 
寅申宫贪狼 ， 以开创性行业为宜 。 或从事某一行业 ， 却能别开生面 ， 以特殊作 
风经营 ， “ 由此走向成功 。 
寅申贪狼守事业宫 ， 时倾向于与人合作 ， 唯多中道 更张 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫贪狼对拱武曲 ， ‘ 必须武曲化禄 、 贪狼化权 ， 三方四正无羊陀空劫 ( 有利 
刑不妨 ) ， 或有火铃会照 ， 然后 始主为军 ； 警 ， 刑三方面红人 ， 独当一面 ， 掌生杀之 
权 。 
若无吉化 ， 但有吉曜 ， 则亦可从政 ，。 为财赋之官 ( 尤 倾向于税务 ) 。 
若有煞同度 ， 则以从商为宜 。 亦必事业方向多方面 发展 ， 不只一端 。 
倘对宫武曲化忌 ， 从商有周转困难 ， 从军刑恐有伤 残意外 。  """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守事业宫 ， 须视太阳 。 太阳入庙会照则吉 ， 若 太阳落陷 ， 则格局较下 。 
凡巨门在事业宫 ， 基本性质 ， 为 [ 口舌生财故以 口才为主 ， 或须费唇舌以谋生 。 
格局有高下 ， 唯基本性质不变 。 
尤其当巨门化忌之时 ， 若不从事依赖口才 ， 或费劳 唇舌的行业 ， 则反招是非口 
舌 。 即使巨门为入庙的太阳会照 ，． 亦仅主是非较轻而已 。 若见四煞 、 空劫 、 刑耗 ，更多事业上的纷扰 。 或且牵涉讼事 。 
若从事口舌职业 ， 虽巨门化忌 ， 只要煞刑诸曜不 重 ， 亦仅主事业不稳定 ， 且劳 
心费神 ， 赞尽辰舌而已 ， 并不主官非诉讼 。 
属于是非口舌的行业 ， 为律师 、 外交家 、 政界 、 教 师 、 帮会 、 星相 、 推销之类 。 
以巨辩证化禄为贵 ， 化权亦可 ， 化忌带偏门 ， 或一半牵涉政治 。 
口舌引伸为饮食 ， 故亦可从事与饮食有关的行业 。 若从医 ， 则与口腔 ， 食道有 
关 ( 天同巨门则为脑科 、 神经 科 。 ) 
巨门喜化禄 ， 或与禄存同度 ， 则有时可 将口舌的性 质转化为声名 。 但以不主动 
出锋头为宜 。 一一所谓声名即口碑 ， 与特意寻求声名者截然不同 。 
巨门与火铃星度 ， 亦主横得横失 ， 暴起暴跌 。 故陔 收敛锋芒为宜 ， 且贵知机 。 

 

"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午巨门守事业宫 ， 会财帛宫太阳 ， 若有吉化 ， 则主得异族扶持事业 。 
子午巨门得禄 ， 经过一段时期 ， 必然事业猛进 。 但 仍不宜出锋头 ， 亦不宜坐第 
一把交椅 ， 否则事业又因竞争 、 排挤而致冷退 。 
子午巨门 ， 事业必不只一端 。 一般情形为藉一行一 业起家 ， 但起家后却兼营别种 
行业 。 若有吉星祥曜者 ， 则别业亦依然生发 。 倘有煞曜 ， 则主事业 多变动 。 
子午巨门躔擎羊者 ， 必先经重大挫折 ， 然后始有作 为 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫巨门 ， 对宫天同 ， 事业多带享受色彩 。 一般 以饮食 、 歌唱界等为宜 。 
巨门在天罗地网 ， 故亦主先经困滞 ， 然后始见生发 。 
若辰戌巨门 ， 又化为忌星 ， 更见煞耗诸曜 ， 则一生 至少有一次重大官百非 。 其 
事业多主足迹江湖 ， 风露辛酸 。 
辰戌巨门与火铃同度 ， 决主偶得意外之财 。 如何保 持 ， 则非韬光羊晦不可 。 
辰戌巨门亦宜自由职业 。 若带艺术气质者尤佳 。 否 则宜从事带名士气派的行业 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥宫巨门太阳相对 ， 亥宫优于巳宫 。 若见禄马 ， 决主事业扎根于异域 。 
巳亥宫巨门 ， 亦主先有社会地位 ．， 然后财富始随名 誉而来 。 故以同会文昌 、 文 
曲为贵 。 唯不喜昌曲化忌 ， 则其社会地位终有限度 。 
巳亥巨门见煞忌 ( 尤以巳宫者为甚 ) ， 则事业多虎 头蛇尾 ， 终无结局 。 
巳亥巨门化禄 、 化杈 ， 又见魁铖 ， 主受异族提拔而 发家 。 
巳亥巨门与火铃同度 ， 亦须防暴发暴败 。 持盈保泰 之道 ， 在于见好收蓬 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守事业宫 ， 无论处何地位 ， 均不宜在名义上占 取最高位置 ， 以副贰 为宜 ， 
否则必受人攻击 ， 排挤 。 
天相带服务性质 ， 然而其所谓服务 ， 绝不同于 『 太阳天梁 ] 的社会服务 ， 往往有 
政治色彩 。 或直接从政 ， 或所业有政治背景 ， 或虽非政界 ， 但却对政治有浓厚兴趣 。 
天相本身无吉化 ， 但却喜与吉化之星同度 ( 由此可 见其缺乏独立性 ) 。 或三方有 
吉化 ， 亦为天相所喜 。 
会廉贞化禄 ， 事业带开创性 ， 但所开创的事业却不 属于自己 ， 往往一业开创即成 ， 便须另调新职 ， 负担新的开创业务 。 只有当所会的天府有禄存同度 ， 或天相本 
身为财阴所夹之时 ， 然后才能享受开创的利益 。 
破军化禄另有一重性质 ， 即宜作为商品代表 ， 此即 [ 副贰 ] 之意 。 所谓开创性 ， 
此时便变为打开代理商品的市 场 。 如此则所 得利益便应较大 。 
天相亦可借会贪狼化禄 ， 则常主背井离乡发展 。 
天相与紫微化权相会一名大于利 ， 亦权大于利 。 倘 见煞曜 ， 则不宜弄权 ， 否则 
事业必多挫折 ， 或主倾覆 。 
天相与紫微化科相会 ， 亦名大于利 ， 虽独当一面 ， 但却往往易受架空 ， 必须同 
时见辅佐吉曜然后始有主有名可实 。 
天相与羊陀火铃同会 ， 或为羊陀夹 、 火铃夹者 ， 事 业多纠纷 ， 且易受人掣肘 。 
天相守事业宫而为刑忌来会 ， 更见煞曜同度 ， 斗生 牛马 。 有吉曜同会 ， 亦时受 
压力 。 。 
天相与空劫同度 ， 吉则可以凭意念打出天下 ， 唯仍 可 与人合作 。 若无吉曜 ， 或 
且见凶星恶曜者 ， 则或为志大 才疏 ， 或不守一业 ， 时生改变之心 ， 以致反流离不安 。 
天相有禄马冲拱 ， 亦主离乡 。 
天相守事业宫 ， 是否能成富 ， 须视天府所会合之星 曜而定 。『 逢府看相 ] ， 逢相 
亦须看府 。 盖天府为库廪 ， 天相 为锁镎 ， 有销镎而库廪空虚 ， 亦自徒然 。 
凡天相守事业宫 ， 其行业性质 ， 须由命宫入财帛宫 决定 ， 有时亦由夹宫决定 。
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天相与紫微破军相对 ， 若为刑忌夹 ， 则一 生事业反覆 ， 与人合作 。 每每 
凶终隙未 。 若为财阴夹 ， 则主承继现成事业 ， 并由此创开新局面 。 
丑未天相守事业宫 ， 若有桃花 ， 最宜从事酒色财气 事业 。 若见昌曲 ， 则为艺术 
中人 。 二者皆有娱乐事业 性质 ， 然本质却有绝大分别 ， 学者宜细心体会 。 此往往即 
为艺术与色情之区别也 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉天相与 [ 廉贞破军 ] 相对 ， 以卯宫较佳 ， 因为寅 宫的太阳所来 ， 较为光辉 。 
卯酉天相 ， 在一般情形下权重一时 ， 但究非事业主 脑 。 若从商 ， 最宜为商品代 
理 ， 若任职 ， 则宜为跨国机构一地之首脑 。 
卯酉天相而府库充盈者 ， 宜任财经方面工作 ， 若天 府化科 ， 则以工程技术为宜 。 
卯酉天相与廉贞化忌对拱者 ， 与人合作 ， 时生破裂 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天相与 [ 武曲破军 ] 相对 ， 一生事业多劳 ， 往往 须亲力亲为 。 
巳亥天相与武曲化忌对拱 ， 与人合 作时多损失 。 目 往往因财失义 。 
巳亥天相守事业宫 ， 不见禄 ， 亦宜工程技术 。 会天 府化科者 ， 可半工半商 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为清贵之星 ， 纵见禄 、 权 、。 科 ， 及辅佐吉曜 ， 亦不负行政之责 ， 仅宜居监 
察 、 申核 、 司法 、 刑政之职 。 亦宜为政府低言人 。 
若在商 ， 则为财务申核 、 人事管理之才 。 若为自由 职业 ， 则与医药 、 法律 、 广 
告 、 传播有关 。 
入庙 ， 在现代亦为社会工作者 ， 或为议员等 清贵 。 属于半官方人士 。 
天梁为孤克刑忌之星 ， 上述职务 ， 细心体会 ， 便知 其带孤克刑色彩 。 盖此等职 
务 ， 皆须遵循一定法则 ， 或须面对大众 ， 且向大从负责者也 。 
天梁说为科学研究之星 ， 因科学研究亦有一定法 则 ， 兼且面对大众 。 
上述职务看似纷纭 ， 如何定 ， 无非视所会之辅佐 杂曜而定 。 如天刑为刑法 。 天 
月为医药 ， 天巫利从政 禄 马宜从商 ， 昌曲宜广告及传播之类 ， 皆有迹象可寻 。 然而 
定基本性质 ， 却仍以正星组合为准 。 
大致而言 ， 同拱太阳者 ， 利传播 ， 司法 ， 医药 ， 同 拱天同者 ， 宜内务 ， 秘书 ， 
参赞同拱天机者 ， 宜计划 ， 设计 ， 申核 ， 或半 官方事业 。 
天梁落陷 ， 以自由职业为宜 。 亦以有年资可积者为 宜 。 
天梁化禄于事业宫 ， 若从事财务稽核之职者 ， 最为 适宜 。 若所业兴财务无关 ， 
则反因财而受困扰 。 从政者困扰尤大 。 
天梁化权 ， 利于权威性工作 ， 法律固有权威 ， 监察 及秘书亦未常示权 ， 于此可 
细作体会 。 
天梁化科 ， 以清贵为宜 ， 故须极力争取社会地位 ， 然后财富始随之而来 。 换言 
之 ， 名为主 ， 利从于名 ， 本示切不可倒置 。 
天梁化禄而成 [ 阳梁昌禄 ] 格者 ， 必须以专利发明 ， 专利事业为奋斗目标 。 若从 
商 ， 亦宜代理名牌 ， 或打开商誉 ， 然后始能有所成就 。 盖此组星曜与事业关系甚大 ， 
本质虽佳 ， 却必须努力奋斗然后有为 。  
天梁与空劫同度 ， 吉则为发明创造 ， 凶则流为空想 。 此亦可藉后天人事补求 。 
一一凡天梁在事业宫者 ， 必须努力 争取学历 ； 资历 ， 此盖属通则也 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫天梁 ， 最嫌太阳化忌 ， 除非从事刑法纪律 ， 或招人畏忌的行业 ， 甚至所 
谓 [ 厌恶性行业 ] 而带服务色彩 者 ， 否则反招是非尤怨 ， 或在职务上替人受过 。 
子午宫天梁 ， 以任公职或大机构职务者为宜 。 若太 阴化忌尤甚 ， 自行经营 ， 往 
往计划出错 ， 俏无足够资历 ， 学历 ， 则仅宜从事零售业 。 """
            print(tmp)
            print("\n")
            if(dizhi == "午"):
                tmp = """天梁巳 、 午 、 未三宫 ， 孤克刑忌的性质特别大 。在午宫者 ， 见吉则事业广大 。 见凶则为众失之的 ， 亦必须以不针对别人为宜 ， """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫天梁 ， 事业多变 。 会辅佐吉曜 ， 则主身兼数 职 。 
丑未天梁亦不喜欢太阳 、 太阴化忌 ， 前者主因名招 怨 ， 后者主因财招妒 。 
丑未天梁与天机化忌相对者 ， 一生招是非谣谤 ， 以 不 澄清为宜 。 若图澄清 ， 反 
而更滋困扰 。 """
            print(tmp)
            print("\n")
            if(dizhi == "未"):
                tmp = """天梁巳 、 午 、 未三宫 ， 孤克刑忌的性质特别大 。在未宫才 ， 一生事业变化多端 ， 其变化为吉为凶 ， 亦以所会辅偌诸曜为主 ， 后天人 
事 ， 亦宜从事行业本身亦具变动色彩者 ( 如 电子业 ) ， 是则为趋吉避凶之道 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥天梁 ， 最畏借会巨门化忌 ， 最喜借会巨门化禄 。 若会化忌 ， 非从事本身即 
带是非冒险之行业不可 ， 巳宫者往往因此九死一生 ， 若巨门化禄 ， 则主口舌生财 。 
巳亥天梁在事业宫 ， 以不现锋头为宜 ， 虽独当一面 工作 ， 亦以退居幕后为佳 。
巳亥天梁多秘密任务 。 若从商则凶险较少 ， 但一生 事业仍与商业秘密有关 。 """
            print(tmp)
            print("\n")
            if(dizhi == "巳"):
                tmp = """天梁巳 、 午 、 未三宫 ， 孤克刑忌的性质特别大 。尤以在巳宫者 ， 从政则有特殊任务 ， 从商亦别有目的手段 。 是则以同和大众为第一 
要务 。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀居事业宫 ， 主管理能力强 ， 尤以紫微 七 杀为 然 。 
古代无工业 ， 最能聚众 ， 且最能发挥管理能力者 ， 厥为兵戎 ， 故古人论七 杀守 
事业宫 ， 必许以武职荣身 。 现 代则可为 工厂管理 ， 亦可为大企业人事部门 。 
凡管理 ， 必须恩威并济 ， 七杀守事业宫者 ， 威有馀 而恩不足 ， [ 紫微七杀 ] 尤然 。 
故以得辅弼 、 魁铖 、 三台八座 朝拱同会者为贵 ， 得此则自能则柔相济 ， 虽千万人皆 
能号令 。 
七 杀不宜与煞曜同度 ， 火铃同会者更不宜 ， 从事武 职或人事管理 ， 皆主生枝节 ， 
甚且有意外 ， 或风波重重 。 
七杀有煞曜同度 ， 最宜一技傍身 ， 故必需学习专门 技术 ， 不宜管理 。 
故七杀守事业宫者 ， 以本宫无煞始宜武职 。 若有煞 而从事军警刑政 、 情报治安 
等业 ， 则应居安思危 。 煞忌刑重者 ， 且多意外 ， 若会廉贞化忌 ， 或武曲化忌 ， 或武 
曲化忌 ， 尤防有生命危险 。 
七 杀守业宫者 ， 亦主辛劳 ， 凡事必须亲力亲为 。 即 使下属从多 ， 仍难安逸 。 
七杀与昌曲同度 ， 以设计工作为宜 。 
七杀与空劫同度 ， 吉则有巧思 ， 出人意表 ， 凶则一 生多空想 ， 以致不良不莠 。 
七 杀与空劫同度 ， 不宜投机 ， 即使命宫见 [ 火贪 ] 、 [ 铃贪 ] 、 亦主暴发暴败耳 。 
七 杀守事业宫者 ( 命宫亦如之 ) ， 必须注意后天培 养 ， 尤以人和为第一 ， 技能训 
练次之 。 缺此二者 ， 则虽有作为 ， 但同一星系 ， 由于后天修养不同 ， 影响实际命运 
甚大 。 
七 杀守事业宫而有煞者 ， 见擎羊 、 天刑 ， 可习外科 手术 、 针 炙 、 妇产科 、 牙科 
等 。 廉贞化忌者尤宜 。 
若有煞而无化忌会合者 ， 则仍以应用利器为主的行 业为宜 。 如雕刻 、 理发及金 
属工程等 。 
七 杀与火铃同度 ， 则以见金火的行业为佳 ， 如冶练 、 烹饪 、 首饰之类 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫 七 杀 ， 与 『 武曲天府 』 相对 ， 有煞者最宜工艺 设计 ， 主有独特概念 ， 易 
为欣赏 。 
若辅佐诸曜同会者 ， 则亦可主持企业或工业管理 。 或为军警武职 。 
子午火杀得禄 ， 亦可任职财经机构 ， 唯若见 【 火贪 】、 [ 铃贪 ] 则防暴得暴失 ， 横 
发横破 。 
子午 七 杀会武曲化禄 ， 则宜武职 ， 或财经事业 ， 会 贪狼化禄 ， 则宜从商 ， 唯不 
利投机 ， 会破军化禄 ， 则事业不只一端 ， 有多方面的财源 。 见禄存 ， 以任职为宜 ， 
不宜自行创业 。 若贪狼化忌 ， 则一生至少有一次挫折 ， 若武曲化忌 ， 则唯宜任职工 
业 ； 或以专门技能 ， 计划管理等起家 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申二宫 ， 七 杀与 [ 紫微天府 ] 相对 ， 主工作独当一 面 。 
会破军化禄者 ， 一生至少有一次重要行业变动 ， 会 贪狼化禄者 ， 从商为宜 ， 仍 
不宜投机 ， 会紫微化科 ， 天府化科者 ， 名大于利 ， 以争取学历 ， 资历为生 ， 财帛多 
寡 ， 视此而定 。 
若与煞曜同躔 ， 则为工艺 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌两宫 七 杀落罗网 ， 即使投身军警两途 ， 亦宜武 职文做 。 
辰戌 七 杀守事业宫者 ， 若经商 ， 以周转数目巨大者为宜 。 若从事工业 ， 亦必须 
自行销售 。 无论工商 ， 皆不宜投机 。 
辰 戌七杀守事业宫 ， 亦一定生名大于利 。 
最喜见廉贞化禄 、 破军化权 ， 则权利皆重 。 有煞亦 为富局 。 无煞而见辅佐吉曜 
者 ， 经历一段时期困滞而终成大器 ， 是则可入武行 ， 必能以武职荣身 。 
若见廉贞化忌者 ， 以带血光事业为宜 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守事业宫 ， 大致略向七杀 ， 其主要分别为 七 杀 之开创力不如破军 ， 然而风 
险亦较破军为小一一七杀守事业宫 ， 虽必有一段时期困境 ， 只需不投机 ， 纵有挫折 ， 
终能 东山复起 ， 而破军则可能一蹶不振 ， 且于顺境之时 ， 亦必见风波 ， 仅能安然渡 
过而己 。 
以事业性质言 ， 破军不与煞忌同躔 ， 三方亦煞轻者 ， 可以武职荣身 。 化禄 、 化 
权尤佳 ， 更见辅佐吉曜同会 ， 则富贵不力 。 
若破军与煞曜同度 ， 贝 IJ 宜以工程技术起家 。 从商者 必多挫折 ， 纵能化险为夷 ， 
亦劳心伤神 。 
破军入庙而吉煞交集者 ， 可以经商 ， 是则成败无常 ， 进退之机异常重要 。 往往 
成败仅博于一线 。 
以毅力言 ， 破军优于七杀 。 故当破军守事她富时 ， 只须连续有三四年良好的流 
年 ． 即能创出事业基础 。 
若破军化禄 ， 则主兼行漆业 ， 兼职兼差且往往由 不以为重点的行业或职务起家 。 
破军守事业宫 ， 会火贪 、 铃贫 往 往于困苦 艰难中突发 。 突发之后 ， 若不视力亲 
为 ， 或贪心无厌 ， 则又易归于失败 。 
破军宜于工业 ， 其性质亦同 七 杀 。 但 - 七杀之特长在 于管理 ， 而破军之特长却在 
创新 。 故宜注意新产品 ， 新技术 ， 或从事冒险性行业 。 
廉贞与七 杀同度 ， 宜从事工程 ， 与破军同度 ， 却反 主处行政机构之下僚 。 此乃 
由于廉贞火可炼七 杀之金 ， 耐 却与破军水火相克之故 。 不成格局 ， 是故境况亦大不 
相同 。 
破军喜见辅弼 ， 则能减少辛劳 。 见魁铖不过 多机会 而已 ， 见昌曲亦不能扭转劣 
境 。 若昌曲化习 ， 则更易不安所业 ， 不良不莠 。 
破军与桃花诸曜同度 ， 倾向于半偏行业 ， 若更见文 曲化忌者 ， 则带巧诈性质 。 
破军与羊陀同度 ， 若无一技防身 ， 则必终生不能有 为 ， 以致晚年困苦 。
破军亦不喜与火铃同度 ， 主风波叠起 。 
与空劫同度 ， 见吉辅者 ， 创新之能力极强 ， 此时却 又喜昌曲相济 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫破军守事业宫 ： 见吉曜亦可从政 ， 唯若命宫 有煞而无禄 ， 则从政不免有 
派幂争端 ， 而当局者却易生反覆 ， 于年限不佳时 ， 由此即引起极大风波 。 
若从工从商 ， 则倾向于 与人合作创业 ， 且合作事业 不只一端 。 化禄 、 权时尤甚 。 
然而行业虽多 ， 若不专 ， 则徒然表面风光 。 
子午破军守事业宫 ， 无论从事何等行业 ， 均喜玩弄 政治手腕 。 故必须见辅弼同 
会 ， 然后始可占优势 ， 否则每每枉作小人 。 
女命破军于子午守事业宫 ， 主夫唱妇随 ， 最宜与丈 夫合作创业 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申宫破军守事业宫 ， 亦倾向于合作创业 ， 唯若武曲化禄 、 贪狼化权来会 ， 只 
需不会文曲化忌 ， 则仍以独力创业为宜 。 
若武曲化忌 ， 只利从工 ， 亦有风波意外 ， 唯风险毕竟较小 。 亦可从事外科 、 牙 
科等持利器以求助的行业 。 最不宜从商 ， 主财不 足以济其用 ， 往往因此损失 ， 挫败 。 
寅申破军主事业场而相当大 ， 若无禄 ， 又无吉曜 ， 往往 为外强中 干 。 空劫同度 
者更甚 。 
亦主忌出锋头 ， 若小有成就即胆大妄为 ， 必为神人 共弃 。 """
            print(tmp)
            print("\n")    
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌宫破军落罗网 ， 一生必至少有一次重大挫折 ， 然后改行改业 。 
辰戌破军亦主为 [ 副贰 ] 必须藉别人财力或势力兴 家 。 故最喜见魁铖 。 
若无吉曜 ， 又无煞曜 ( 或二者均见 ， 但力量微薄者 ) 则必须一技傍身始能生发 。 
有吉化吉曜 ， 可任职财经机构 。 
煞重者 ， 宜技术谋生 ， 不宜自行经营 。 
辰戌破军守事业宫 ， 不宜过份计较 钱财 ， 否则因小失大 。  """
            print(tmp)
            print("\n")
        
def GongXia10th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微独坐守田宅宫 ， 一般均有自置物业。 在午富者 ， 以高楼高地为宜 。 若禄存 
同度或化禄对拱 ， 宜置可 以生财之地 ， 姐石场 、 矿声之类 ， 亦宜买卖物业 。 
紫微与破军同度或对拱 ， 主有祖业或现成家业 ， 但 因各种原因退败 。 若为 百官 
朝拱者 ， 则可保留 。 倘 [ 在 野 ] ， 或羊陀 ， 空劫同会 ， 则主因之而起是非纠纷 。 更见 
刑 耗 ， 主牵连诉讼 ， 有大巫则为争产 。 见禄， 或破军化禄则有自置物业 ， 惟置旧宅 
为宜 。 
紫微与七 杀同度或对拱 ， 须视天府吉凶。 若库扩充盈则有自置物业 ， 若府库空 
露 ， 则产业动摇 。 见化忌 ， 空动 、 刑耗 、 天虚等曜 ， 则产业消磨破耗 。 
紫徽与贪狼同度 ， 见辅佐吉曜 ， 住宅必美丽 。 若见 煞 ， 则仅为外表豪华 。 火铃 
同度而见吉化吉曜 ， 产 业突然增加 ， 唯若同时见空劫刑耗 ， 则暴得暴失 ! 贪狼化渌 ， 
见 
吉而不见煞 ， 可以买卖物业 。 
凡紫微守田宅宫 ， 除紫贪外 ( 贪狼化忌则仍是 ) ， 均不宜见火星 ， 再会羊陀 ， 空 
劫 ， 虚耗 ： 主名下物业有火灾 。 于羊陀失并之年克应 。 
紫微守田宅宫虽见辅佐吉曜 ， 亦不宜昌曲化忌 ， 主 买卖物业因文书契约而受损 
失 。
紫微星系在田宅宫 ， 若辅佐吉曜同会者 ， 主聚族而 居 ， 又主所服务机构员工众 
多 。 若为 [ 紫破 ] 见吉 ， 则为新 兴机构 ， 若 [ 紫相 ] 见煞 ， 则为老旧机构 ， 而基础动摇 ， 
宜 注意转职或改革之机会 。 
紫微星系在田宅宫 ， 以大限流年 见 [ 紫破 ] 、 [ 紫相 ] 始表徵有迁动 ， 唯煞重者不 
迁 ， 仅主装修或内部迁动 ( 如 换房 ， 办公室换位之类 ) 。 [ 紫贪 ] 见禄主动建 ， 或迁华宅 。 
凡紫微星系守田宅宫而见吉 ， 均主置业 ， 在现代往往为股份公司开创之期 。 
紫微星系守田宅宫 ， 有忌星 、 流煞入度 ， 冲会大限 流煞 。 又见阴煞 ， 丧门 、 白 
虎 ， 则主有老亲孝服 。 唯必须父母宫见昌曲 ， 或命宫见昌曲 ， 又或田宅宫见昌曲始是 。 
紫微星系守田宅宫 ， 有吉曜 、 吉化 ， 见天喜或 红惊 ， 有流昌流曲入度 ， 则主 
是年增添人口 。 若不见吉曜 ， 仅主亲戚朋友来投 ， 暂住一个时期 ， 在服务机构 ， 则 
主有人来见习 ， 实习 ， 或有临时职员 。 
紫微星系守田宅宫 ， 一般主居屋及公司不受风水影 响 ， 唯若见火铃 ， 空劫 ， 阴 
煞者 ， 则仍应注意风水 。 
[ 紫破 ] 及 [ 紫相 ] 见煞忌刑耗空劫 ， 主住旧宅 ， 必须 参祥风水 。 
"""
        print(tmp)
        print("\n")
        
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机在田宅宫 ， 一般主产业变动 ， 故前人认为主退 去祖业 ， 自己创置 。 在现代 ， 
亦主时时迁动 ， 或时买时卖 ， 甚或主时时变换工作环境 ， 不一定主退祖自兴 。 
天机之迁动是否吉利 ， 须视所会合的星曜而定 ， 会 吉曜吉化 ， 有时反而不主迁 
动 ， 最喜见禄马 ， 魁钺及恩光天贵 、 三台八座诸曜 ， 则主迁动吉利 。 反之 ， 若见火 
铃 、 空劫 、 化忌 ， 则动辄得咎 。 
流年天机化忌亦主迁动 ， 不见煞 ， 则亦不主凶 。 
天机与禄存同度 ， 有煞同会 ， 主与邻舍不和 ， 化忌 更主受威胁或压力 ， 见天刑 、 
官符 、 白虎 ， 则主发生诉讼 ， 以忍让搬迁为宜 ， 否则愈僵持愈多生是非 ， 或主在工 
作机构内享受压力困扰 ， 亦以转换工作环境为宜 。 
天机化禄见禄马 ， 始主迁动 ， 而且迁动吉利 ， 只见 化禄 ， 则为动而不动之兆 。 
即如有迁动计划而未付诸实行 。 
一般情况下 ， 天机守田宅宫者 ， 受风水影响较大 。 仅与天梁同度 ， 见吉化吉曜 ， 
然后下受影响 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """天机居丑未 ， 巳亥宫垣 ， 主居住环境复杂 ， 或近市场 ， 或近工厂 ， 绝非清静 。 
若火铃同度则更时关噪音 。  """
            print(tmp)
            print("\n")
        if(star == "天机巨门"):
            tmp = """天机巨门的星曜组合 ， 常易引起产业 纠纷 。 亦主较 难置业 。 或主应动不动 ， 以 
致后悔 。 惟见禄者始主产业创新 。 若巨门化忌 ， 则动辄得昝 ， 见刑煞空劫 ， 更主因 
产业或迁动 ， 而致是非口舌连连 ， 甚至发生官非诉讼 。 
天机巨门有煞同度 ， 纵见吉化亦不吉 ， 仍主产业难 守 。 在卯宫者较为吉利 。 """
            print(tmp)
            print("\n")
        elif(star == "天机太阴"):
            tmp = """天机太阴的星曜组合 ， 主时时迁动 ， 尤以寅申二宫 为然 ， 见煞则不守祖业 ， 亦 
不享现成的事业 ， 亦主时时变换工作环境 。 若太阴化禄 ， 然后主易自置产业 ， 居住环境亦较安静 。 
天机太阴见吉化 ( 最喜天机化禄 ) ， 又见吉曜 ， 则 买卖田宅可以获利 。 亦宜迁换 
工作环境 。 """
            print(tmp)
            print("\n")
        elif(star == "天机天梁"):
            tmp = """天机天梁的组合 ， 基本性质主难自置产业 ， 必四十 岁以后始能置业 。 六十岁后 
产业始增加 。 
天机天梁而天梁化禄 ， 多住旧宅华夏 。 或在有年资 之机构服务 。 
天机天梁火星同度 ， 会铃星 ， 又见煞耗 ， 流煞冲会 ， 则其年主火独虚惊 。 
天机天梁在田宅 ， 命宫 【 武贪 】 与火星同度者 ， 亦主 时时更换住宅及办公地点 ， 
[ 武贪 ] 见禄马 ， 亦主时时迁移 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳入庙守田宅宫 ， 主有祖业 ， 但难守 。 唯日生人 ， 又见辅佐诸曜同会 ， 然后 
主可自置 - 但仍时时变换 。 亦主 容易变更 作机构 。 
太阳落陷守田宅宫 ， 无祖业 ， 或破收难享 ， 夜生人 ， 主更难自置产业 。 常易迁 
动 ， 亦易更换工作环境 ， 且有浮动不安之感 。 
太阳化忌在田宅 ， 不主不利父亲 ， 主祖业倾败 ， 或 平生事业难有根基 。 倘更见 
煞刑虚耗诸曜者 ， 则以从事无根之职业 。 女 经纪 、 教学等业为宜 ， 否则容易时时因 
受压 力而迁动工作环境 。 
太阳与太阴会合 ， 由田宅宫中为最佳结构 ， 唯若太 阳或太阴险化忌 ， 而见煞刑 
空耗诸曜 ， 流煞同会或冲会 ， 且见太岁 ， 白虎 ， 丧门 ， 则主有尊亲逝世 。 亦主在服 
务机构内受尤怨 ， 以致引起重大是 非 。  
"""
        print(tmp)
        print("\n")
        if(star == "太阳天梁"):
            tmp = """太阳天梁的组合 ， 主住公屋 ( 在古代 ， 为住祖产蒸 当 ) 。 
太阳天梁见煞忌刑耗空劫诸曜 ， 主因公产而与大 讼 ， 以不沾手公产 ， 不作地产 
投资为宜 。 
太阳天梁见吉化 、 吉曜 ， 可以管理公产 ， 亦宜从事 地产投资 ， 但必须带公共股 
份性质 。 
太阳天梁有吉星始可置业 ， 且以旧宅为宜 。 见煞忌 刑耗 ， 则恐因置业而发生麻 
烦 。 太阳天梁喜见辅弼 ，
太阳天梁怕见空劫，太阳天梁与太阳巨门比较 ， 前者之吉 ， 系主宅第声 名 ， 后者之吉 ， 系主直接受阴 
于异地 ， 前者之凶 ， 带来者为压力 ， 后者之凶 ， 带来是非口舌 。 此为推断之大纲 。 """
            print(tmp)
            print("\n")
        elif(star == "太阳太阴"):
            tmp = """太阳与太阴的组合 ， 以 [ 阴阳 ] 同度者为佳 ， 不见煞 忌空劫者 ， 主产业陆续增置 。 
太阳太阴的组合 ， 以太阴化禄为佳 。 若会巨门 ， 不 同化禄 ， 亦能增置产业 。 唯 
天梁化禄者 ， 产业流动性增加 。 
太阳入庙 ， 不必重视风水 ， 落陷 ， 非注意风水之影 响不可 。 
若太阳化忌 ， 主因置业而惹是非 ， 太阴化忌 ， 则 因 置产而受损失 ， 天同化忌 ， 
主产业动摇 ， 巨门化忌 ， 则主纠纷及破败 。太阳太阴 喜见昌曲 。 
太阳太阴怕见火铃 。 """
            print(tmp)
            print("\n")
        elif(star == "太阳巨门"):
            tmp = """太阳巨门的组合 ， 以同度为佳 ， 对拱则相差甚远 。 
【 太阳巨门 】 见吉化 ， 吉曜 ， 不见煞忌刑曜 ， 主产业 增置 ， 且宜外国或外地置 
业 ， 但仍不免有明争暗斗 ， 故不宜从事地产投资 。 
太阳与巨门相对 ， 即使见吉曜 ， 亦主争夺 。 见天巫 则主争夺遗产 。
太阳巨门而太阳化忌守田宅宫 ， 见煞 ， 主与主管机 构或机构内之领导层有误会 ， 
致招尤怨 。太阳巨门喜见魁然 ，太阳巨门怕见羊陀。太阳天梁与太阳巨门比较 ， 前者之吉 ， 系主宅第声 名 ， 后者之吉 ， 系主直接受阴 
于异地 ， 前者之凶 ， 带来者为压力 ， 后者之凶 ， 带来是非口舌 。 此为推断之大纲 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为财星 ， 独居庙地 ， 古人谓主得祖 、 父大业 。 然此不专业产业 。 亦主事业 
上的承继 。 故田宅宫一般喜武曲坐守 。 
武曲化禄或与禄存同拱 ， 不见煞曜 ， 祖业丰厚易守 成 ， 见辅佐吉曜更主陆续添 
置 。 但 [ 田宅宫 ] 吉曜集中 ， 难 免 [ 命宫 ] 、 [ 事业宫 ] 、 [ 财帛宫 ] 星 曜相对消弱 ， 故须 
注意是否能将祖业发扬 ， 或仅能保守 ， 或甚至因不因进取而致破败 。 古今社会背景 
不同 ， 应特别注意 。 
武曲守田宅宫 ， 忌与破军同拱 。 故于寅申巳亥四宫 为弱地 。 若武曲化忌 ， 更见 
空劫 ， 大耗 ， 天刑 ， 必主倾家 。 即武曲不化忌 ， 亦主祖业动摇 。 
凡武曲守田宅宫 ， 吉者 ， 常主能在业务兴旺的机构 服务 。 凶者 ， 则主时生变动 。 
古人雇庸 ， 最得视人之田宅宫 ， 凡武曲坐田宅而吉 ， 认为旺主 ， 武曲坐田宅而凶 ， 
则视为不利主人 · 此意可以参 ： 学 。 又武曲守 宅 ， 直服务 财经机构 。 
武曲 守 田宅 ， 火星同鹱 ， 叉见虚耗删忌更有流煞 冲会 ， 是年主火灾 ， 武贪见星 
虽刁 、 主火灾 ? 但武曲化忌 或贪狼化忌之时 仍主火灾 
田宅富武曲化忌 ， 会廉贞化忌 ， 见煞 。 足见白 虎 ， 丧门等曜 ， 主宅中有丧服 。 
武曲守团宅 ． 一般一受风水影响 ， 化忌则须注意 。
"""
        print(tmp)
        print("\n")
        if(star == "武曲天相"):
            tmp = """[ 武曲天相 ] 为刑为夹 ， 火铃夹者 ， 亦主产业不守 ， 渐 渐落后 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲破军"):
            tmp = """[ 武曲破军 ] 会廉贞化忌 ， 仅宜守祖父之业 ， 命 宫以及事业宫弱者 ， 且恐大权旁 
落于兄弟之手 。 
武曲破军的星系 ， 若天相会吉曜 ， 或破军化禄 ， 则不主祖业丰厚 ， 却主祖业消 
磨而自 身兴创 ， 亦主宜买旧宅 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲贪狼"):
            tmp = """[ 武曲贪狼 ] 同度 ， 为 【 火贪 】、 [ 铃贪 ] 格者 ， 祖 、 父遗 业突然增值 。 唯武曲在辰 
戌二宫 ， 与贪狼火星 ， 或贪狼铃星相对者 ， 则主中年后产业增加 。 
武曲贪狼星系见羊陀空劫刑耗 ， 主有破败 ， “ 唯程度 不致过份严重 。 [ 火贪 ] 、 [ 铃 
贪 ] 格者 ， 主暴增暴破 。 
武曲贪狼星系 ， 若武曲化为 忌星 ， 又见煞 ， 主因产 业引致纠纷 。 煞重者则有损 
失 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲天府"):
            tmp = """[ 武曲天府 ] 亦利田宅 ， 最喜天府得禄 。 若府库空露 ， 则祖业破旧凋零 。。 若得禄 
者 ， 能守祖 、 父之业 ， 且能将之发扬光大 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲七杀"):
            tmp = """[ 武曲七杀 ] 与天府对拱 ， 亦 宜注意天府是否得禄 ， 抑或府库空露 ， 而定其吉凶 
克应的情况 ： 
[ 武曲 七 杀 ] ， 会贪狼化忌者 ， 见刑煞 ， 主田宅有争 夺 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守田宅宫 ， 一般主白手兴家 ， 可以 置 业 。 若 见禄者 ， 置业丰厚 。 
唯若天同化忌 ， 则虽能自置产业 ， 却为鼍业招致烦 恼 ， 或一生为产业而花费精 
神 。 所以天同化忌见言曜 ， 反宜经营地产建筑物业 。 化 ； 忌见煞者则不宜 ， 主因产 
业而起 
纠纷 。 
天同化忌而火铃同度 ， 主因产业而生困扰 。 更见空 劫 ， 则虽为产业费尽脑筋 ， 
始终发生破败 ， 敞擞小宜从事地产业 ， 又主一生居住闹市 。 
天同化忌 ， 羊陀同度 ， 则因置产而有是非 ， 唯若煞 忌空劫不重者 ， 是非不大 ， 
不过小麻烦耳 。 
天同化禄 ， 主中晚年以后置产业甚丰 ， 而且在上流 地区 。 若化禄同时见煞 ， 则 
主所置产业不在高尚地区而并不主产业少 。 
天同化权会巨门化忌于田宅 ， 天宜管理公司或家族 的物业 ， 主因此发生麻烦 ， 
更见煞忌重重 ， 必因此而兴讼 。 私人自置 ， 则不起纠纷 。 
天同守田宅宫与天梁对拱 ， 其性质较 [ 天同天梁 ] 同 度为佳 ， 主置业较为顺利 。 
天同守田宅宫 ， 由于天同的精神受比物质享受为 重 ， 所以一般情况下 ， 仅主居 
住环境的享受 ， 故不主牧业 
丰厚 。 
流年天同守田宅宫 ， 见煞忌 ， 主装修 。 见吉化吉曜 ， 主添置家司 。 
天同与火星同度 ， 见空劫刑耗 ， 流煞冲起 ， 主失火 ， 与天梁同度或对拱者仅主 
虚惊 。
天同守田宅宫 ， 所服务机构以带装璜 、 享受 、 商业 艺术性质者为宜 。
"""
        print(tmp)
        print("\n")
        if(star == "天同太阴"):
            tmp = """[ 天同太阴 ] 同度见吉化吉曜 ， 古人认为可藉鱼桑花 果而成巨富 ， 在现代 ， 亦宜 
购入农场 ， 或宁静之地段 。 借会的 [ 太阳巨门 ] 吉化 ， 则宜在外国置业 。 
[ 天同太阴 ] 而天同化忌 ， 住宅交通不方便 ， 若太阴 化忌 防置业破财 ， 更见阴煞 ， 
则宅基恐有前人 填墓 。 一一在现代虽少此种情形 ， 但亦值得参考 。． """
            print(tmp)
            print("\n")
        elif(star == "天同巨门"):
            tmp = """天同与巨门的星系结构 ， 不利田宅 ， 除非见吉化吉 曜而不见煞 ， 否则置产终招 
损失 。 若见煞忌刑耗诸曜 ， 则必因产业而致困扰 ， 甚至因此引起官非诉讼 。 
天同巨门在田宅宫 ， 亦主为偏房 ， 祀子置业 ， 唯必 须见禄始确 。"""
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """天同天梁的星系组合 ， 流动性增加 ， 故田宅宫见此 星系 ， 最宜从事物业买卖 。 
天同天梁见吉化 ， 则先卖产然后置产 。 若天梁化禄 ， 则无论买卖产业 ， 均带有 
小麻烦 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """由于廉贞守田宅宫 ， 有破组的性质 ， 故前人认为不 宜 ， 其实除破祖外 ， 还有自 
己创业时必带困扰 ， 纠纷以致破败的性质 。 只需稍见刑煞即主克应 。 
唯利用此项性质 ， 反而 可选择服务机构 。 廉贞守田 宅 ， 若羊陀交会 ， 煞忌刑并 
见 ， 只需服务于产科 ， 外科 ， 肉食 ， 刑法纪律部队 ， 即可有所发挥 。 一一由田宅宫 
以定职业 ， 系因为古代 [ 农之子互为农 ， 工之子互为工 J 的性质推 行 ， 而 [ 田宅 ] 又往 
往代表自己的服务机构 。 现代利用此项 徵验 ， 必须非常小心 ， 不可视为互古不变的 
教条 。 
廉贞又主血缘 ， 所以对田宅宫非常之重要 ， 田宅禽 廉贞化忌 ， 主血光 。 但若流 
年及小限吉 ， 又见红惊 ， 天喜与廉贞同度 ， 则主添人口之喜 。 唯若流年小限不吉 ， 
且见白虎 ， 丧门 ， 吊客等曜 ， 则主有孝服 。 

 
 
廉贞对拱 [ 火贪 ] 、 [ 铃贪 ] ， 较同度为佳 ， 同度者横 发横破 ， 对拱者 ， 只需本宫 
稍见吉曜 ， 即能骤增产业 。  
凡廉府在田宅宫 ， 命宫必无正曜 ， 借 [ 天同巨门 ] 安星 ， 兄弟宫为紫微与贪狼对 
拱 ， 若贪狼化忌 ， 则主田宅为兄弟剥削 。 
廉贞在田宅宫 ， 一般宜注意风水 ， 除非 『 廉府 』 、 [ 廉 贪 ] 见吉曜 ， 吉化 ， 则风水 
不甚重要 。 然而凡廉贞化为吉星 者 ， 则 不得谓风水无关 。 
"""
        print(tmp)
        print("\n")
        if(star == "廉贞天相"):
            tmp = """[ 廉贞天相 ] 与破对拱 ， 稍见煞即主祖业调零 。 唯财 阴夹者可以享有 。 若财阴夹 
者且见辅佐吉曜 ， 则不利但有祖业 ， 且自置甚丰 。 廉贞天相 或廉贞 七 杀化忌 ， 有火铃同度者 ， 更 有羊陀交会 ? 为流煞冲破 ， 更 
见大耗 ， 天虚 ， 主是年田宅 火灾 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """[ 廉贞破军 ] 对天相 ， 则天相之性质固须注意 ， 但祖 基动摇之性质则更甚 。 若见 
火铃 、 空劫 、 刑耗等曜 ， 则破后亦能自置 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞贪狼"):
            tmp = """廉贞贪狼的星曜组合 ， 见吉亦有祖业 ， 唯不易守 。 若见桃花诸曜及煞忌刑耗 ， 
则因酒色财气及不良嗜好致倾家 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞七杀"):
            tmp = """『 廉贞七杀 ] ， 主无祖业 ， 或祖业薄 ， 但却可自置 ， 唯 廉贞若化为忌星 ， 又见煞刑 
耗曜 ， 则主因置产而倾家 。廉贞天相 或廉贞 七 杀化忌 ， 有火铃同度者 ， 更 有羊陀交会 ? 为流煞冲破 ， 更 
见大耗 ， 天虚 ， 主是年田宅 火灾 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞天府"):
            tmp = """[ 廉贞天府 ] 与 七 杀对拱 ， 主有祖业 ，、 或宜守现成物 业 。 故亦宜经营祖 ， 父辈遗 
下之业务二唯若府库空露者 ， 则祖基动摇 ， 不耐久守 。 若库存充盈 ， 则虽守业亦能 
开创 ， 或有增益 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """田宅宫喜天府坐守 ， 主有祖 、 父物业 ， 或能在有基 础声誉之机构服务 。 
天府主守成 ， 但当与辅佐吉曜会合 ， 又与化禄或禄存相会之时 ， 则能在现成基 
础下发展 ， 物业增益 。 
天府若为府库空露 ， 则祖业必不守 。 
天府最喜与科文诸曜同度 ， 即昌曲 、 龙凤 、 天才 、 化科诸曜同度或会合 ， 是为 
文星入宅 ， 前人以为主发科 名 ， 家有读书之子 ， 若更遇禄 ， 则主置产得利 。 
天府若为关陀夹 ， 同时又见火铃夹 ， 则主受压力而 迁动田宅 ， 或被逼卖产 。 空 
劫夹亦主破败 。 所会之天相 ， 同时亦须注意此类性质 ， 故 天府与禄存同度时 ， 须祥 
有无其他煞曜交加 。 
天府守田宅 ， 本主人工作安定 ， 唯遇上述情形 ， 则主被逼变动 。 见煞忌刑耗同 
会 ， 则为所服务机构有人事纠纷 。 
天府火星同躔 ， 见耗劫 ， 有流煞冲会 ， 主是年有火 灾之优 。 
一般情况下 ， 天府 不受风水影响 。 唯当天姚 ， 阴煞同度之时 ， 则受影响 。 
"""
        print(tmp)
        print("\n")
        if(star == "天府紫薇"):
            tmp = """天府最喜紫微同度 ， 百官朝拱 ， 则田园丰茂 ， 祖业 及自置均佳 。 唯却主守现成 
事业 ， 缺乏开创力 ， 须祥命宫曜而定进退 ， 因现代社会环境不利守成 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴主富 ， 故入庙则利宅 ， 若日生人又见太阴落陷 ， 则主置业艰难 。 
太 阴与辅佐诸曜同度 ， 前人谓 [ 诸吉成集 ， 为得享 祖业之论 ， 又日 ： [ 与左右禄 
主阴福同居 ， 则承祖业而盛 。 故知太阴遇吉 ， 有祖业且可自置 。 
太阴亦喜与太阳同度或拱照 ， 古人说 ： [ 日月合壁 ] 田宅 ， 家道与兴隆 。 此意亦 
可用于服务机构 。 
若太阴落陷 ， 则 [ 虽吉亦有盈亏 。 若更暗曜来临 ， 刑 星交并 ， 产业恐伤 ， 母说离 
分 。 暗曜指化忌的巨门或文曲 而言 。 巨门化忌则产业有是非破耗 ， 文曲化忌则不利 
母 。 然若空劫同度时 ， 文曲化忌亦主买卖物业有损 。 
太阴入庙会吉 ， 主住宅宁静 ， 会煞落陷 ， 则住宅喧 闹 。 
太阴 禄存火星同度 ， 流煞冲破则 
主火灾 ， 见空劫者则主破败 。 太阴化忌见煞防有孝服 。 无煞则主家宅或服务机构有 
是非 。 
女命流年太阴化 忌 ， 冲会太阳化忌 ， 见煞 ， 又见桃花昌曲 ， 有感情困扰 。 
流年太阴落陷 ， 化忌于田宅 ， 见煞主产业损耗 ， 不 见煞亦不宜作物业投资 。
"""
        print(tmp)
        print("\n")
        if(star == "太阴天同"):
            tmp = """太阴天同主得花木之 利 """
            print(tmp)
            print("\n")
        elif(star == "太阴天机"):
            tmp = """太阴天机则主迁移"""
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼入庙主有祖业 ， 落陷则无 。 若入庙与火铃同度 ， 则自置丰厚 ， 但所住之房 
宅必有破损 。 即所谓 【 火贪宜住旧宅华厦 】。 
若 [ 火贪 J 、 [ 铃贪 ] 格而与关陀刑忌空劫同会者 ， 则 主田宅暴得暴失 。 或主兵灾 
火烧或主酒色财气破耗 。 倘同时 亦有吉曜同会 ， 而煞忌轻者 ， 则仅主虚惊 。 
贪狼入庙见吉 ， 又见火铃 ， 亦主时时搬迁移动 ， 以 人为的家宅不宁 ， 代替 [ 旧 宅 
华厦 ] 性质 。 若会禄马者尤确 。 
贪狼入庙 ， 无火铃 ， 但有吉星同度会照 ， 如吉化 、 禄存 、 昌曲 、 则产业耐久且
丰盛 。 若见桃花诸曜 ， 及龙池凤阁者 ， 则住宅美观 。 
故流年田宅宫见贪狼化禄 ， 多主买宅 、 装修 。 若贪 狼化忌则搬迁或大修 。 
流年田宅宫贪狼落陷 ， 火铃同度 ， 更见刑耗诸曜 ， 流煞冲会 ， 亦主火灾 ， 见吉 ， 
则主火灾后损耗不大之装修 。 
贪狼主 散不主聚 ， 故稍见刑忌即生事端 。 最嫌武曲化 忌 ， 主因灾祸倾家 。 廉贞 
化忌来会 ， 则防田宅有流血流泪之事 。． ( 若见惊喜则主添人口 。 ) 
贪狼大田宅 ， 受风水影响甚大 ， 买宅时宜小心 ， 所 服务机构亦慎防虚有其表 。

"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """
巨门不利田宅 ， 故纵遇吉星祥曜 ， 亦不主有祖 。 父 遗业可守 ， 仅能于中年 后自 
置 。 尤以巨门化禄者为然 。 

巨门与天同同拱 ， 见煞 ， 或化忌 ， 古代主争夺水利 ， 亦主易邻人起是非 。 
巨天太阳同拱者 ， 若有父业祖业 ， 则主起明争暗 斗 ， 在现代 ， 除非见吉曜齐集 ， 
否则亦易因经营地产物业而起竞争 ， 煞重 ， 则因田宅而受暗损 。 若吉化者 ， 亦宜为 
异族机构服务 。 
巨门化忌于田宅 ， 主家宅不安 ， 或主自身远离家室 。 见羊陀 ， 空劫 ， 刑耗 ， 主 
因产业而兴讼 。 见文曲化忌 ， 主因卖产业而受骗 。 
巨门吉化 ， 而大运流年却化为忌 星者 ， 有煞 ， 主因 田宅惹灾非 。 火星同度防火 
灾 。 
巨门对风水极为敏感 。 化忌者尤甚 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """巨门在辰戌两宫者 ， 主艰苦置业 。 若见煞忌 ， 则片 全无 。 
巨门在辰戌 ， 与火铃 ， 空劫 ， 天刑 ， 大耗 ， 阴煞 ， 天月 ， 劫煞等曜相会及同度 ， 
主公司倒闭 ， 家宅遭祸 ， 或为兵灾火独 ， 或遭抢盗劫掠 。 倘命宫不吉者 ， 则主本人 
四海飘流 。 无立脚根基 ，， 其他宫度 ， 以巨门化忌为确 。  """
            print(tmp)
            print("\n")
        if(star == "巨门天同"):
            tmp = """女命 『 天同巨门 』 守田宅 ， 化禄 ， 主丈夫或男友为之 卖宅 ， 同时见煞 ， 则不耐 
守 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相为财阴夹者 ， 主有祖阴 ， 为刑忌夹者则无 ， 或 难有但却破败 。 
天相与须见禄 ， 然后始主可以自置 。 更见辅佐诸曜 者 ， 则产业丰盈 。 
天相为火铃夹者 ， 主家宅不安 ， 住宅喧闹 ， 或有缺 陷 。 若更空劫耗同度 ， 则主 
火灾 。 
天相喜昌曲夹 ， 龙凤夹 ， 辅弼夹 ， 则住宅华丽 。 若 有煞同度 ， 则仅主外表美观 。 
天相为刑忌羊陀夹 ， 受四邻骚扰或威胁 。 
天相与煞忌刑同会 ， 主因产业惹是非纠纷 ， 煞重则 主破荡倾败 。 
天相为禄权科夹 ， 魁铖夹 ， 皆主住宅近贵 。 亦主田 宅发科名 。 
天相守田宅必须视天府 ， 库存充盈者吉 ， 府库空露 者凶 。 
天相喜会武曲化禄 ， 主产业丰厚 。 若武曲化忌则主 倾效 。 廉贞化禄者 ， 必因事 
事而置业 ， 或家宅有喜庆 ， 倘化忌 ， 主伤心流泪 ， 或有不虞之灾 。 
 
天相为凶曜夹 ， 或与凶煞同会 ， 亦主受主管机构掣 肘 ， 或服务机构不宁 ， 有压 
力 。 
天相对风水相当敏感 ， 见煞 ， 武曲破军对拱者尤甚 。 
亦主终身住 旧宅 。 
"""
        print(tmp)
        print("\n")
        if(star == "天相武曲"):
            tmp = """武曲化科与天相同度 ， 得廉贞化禄 ， 破军化权拱会 ， 自置产业必丰 。 最宜在服 
务机构掌财权 ， 亦宜经营物业 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为阴星 ， 故居田宅宫 ， 主必有祖业父业 ， 最宜 见天巫 ， 化禄或禄存 ， 则主 
丰厚 。 
天梁与天马同躔 ， 或火铃同度 ， 则主飘荡 ， 纵有祖 、 父遗业亦不能享 。 
天梁最不宜与天同度或对拱 ， 除非见吉化 ， 会吉曜 ， 否则主难以置业 ， 或置业 
后亦不得安享 。 稍见煞曜 ， 则为 [ 为人作嫁 ， 自身不居 。 故往往飘流异地 ， 或从事交 
通运输 等业为宜 。 唯若见吉化吉曜 ， 却又主卖别墅 。 或主在外地置业 。 

天梁在田宅宫化禄 ， 易致人缘不佳 。 对拱的太阳藩 陷 ， 又见煞 ， 主在机构内为 
人排挤 ， 太阳化忌者更惹是非尤怨 。 
天梁见四煞 ， 家宅不安 。 在机构内亦多是非 ， 必须 见辅佐诸曜 ， 化科化权 。 始 
主安宁 ， 及受人尊重 。 
天梁一般不受风水影响 。 唯若阴煞同度 ， 又见火铃 ， 则受影响 。 
"""
        print(tmp)
        print("\n")
        if(star == "天梁天机"):
            tmp = """天梁天机 ， 主多迂动 ， 流年 天机化忌者 ． 更主迁居 ， 或转变工作环境 。 唯天机 
化禄 ， 却亦主变动 。 二者之分别 ， 在于化禄者主 动 ， 化忌者被动 ， 化禄者置业 ， 化 
忌者凭宅 。 
有时天梁天机的组合 ， 亦主翻修旧宅，天梁天同 、 天梁天机均不宜与空劫同度及会合 。 否 则主一生居无定所 ， 亦难有 
财产 。 无煞曜 ， 见吉化吉曜 ， 然后始有家业根基 。"""
            print(tmp)
            print("\n")
        elif(star == "天梁天同"):
            tmp = """天梁天同的 组合 ， 则主更换家私 。 
天梁天同 、 天梁天机均不宜与空劫同度及会合 。 否 则主一生居无定所 ， 亦难有 
财产 。 无煞曜 ， 见吉化吉曜 ， 然后始有家业根基 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀入田宅宫 ， 若为独坐者 ， 除寅申两宫外 ， 均不 利于置业 ， 更不利从事物业 
买卖 。 
七杀最喜得禄 ， 虽无祖产父业 ， 却能自置 。 倘 七 杀 同躔禄存 ， 又叠化禄 ， 唯同 
时见煞曜空劫者 ， 则祖业先破 ， 至大运佳美时却能恢复旧观 。  
七 杀守田宅最不宜忌星同度 ， 武曲化忌主倾效 ， 亦 主被逼离开服务机构 。 若廉 
贞化忌者 ， 则防家宅有伤心流泪之事 。 唯若见空劫刑耗 ， 则亦主各种事端而致折卖产业 。 
七 杀与火羊同度者 ， 主中晚年始能置产 ， 若与陀罗 铃星度 ， 则家宅不安 ? 在服务 
机构权内亦多阴小暗算 。 
七 杀与空劫刑耗同度 ， 主家业破败 。  
七 杀与陀罗火星同度者 ， 流煞冲起 ， 主人独虚惊 。 
七 杀对风水不敏感 。 唯廉杀 、 武杀亦宜注意风 水 。 
"""
        print(tmp)
        print("\n")
        if(star == "七杀武曲"):
            tmp = """[ 武曲 七 杀 ] 的宫度 ， 因七杀落陷 ， 一般不利田宅 ， 稍 见煞 ， 或对宫天府不吉 。 
即易产业破败 。 必须武曲化禄 ， 然后始主自置产业丰盈 。七 杀与武曲化忌同度 ， 主降黩 ， 见煞忌 ， 主受掣肘 或处分 ， 与武曲化禄同度 ， 
见天巫 ， 主升迁 ， 见辅佐吉曜卿主有权 。 寅申宫 t 杀 ， 更主受人提拔而致任主管之 
职 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守田宅宫 ， 入庙则主旧业翻断 ， 故当见辅佐吉 曜时 ， 主既有祖业父产 ， 而 
又能在原有基础上 创置 。 
若破军落 陷 ， 则主住宅破旧 ， 亦主在无创建意味之机构服务 。 
破军化禄权者 ， 更见吉曜 ， 主旧宅拆建翻新 。 亦主 转换良好之工作环境 。 
破军与羊陀同会 ． 见大耗 ， 主田宅有水灾倘见羊 陀 ， 更见文曲化忌会照或同度 ， 
删主受拖累或欺骗而叛变卖产业 。 
破军与火铃 ， 空劫同度会照 ， 主产 、 也损失 。 更会武 曲化忌及阴煞 ， 大耗 ， 天 
晋 ， 则墙倾屋圮 。  
破军与廉贞同度及会照 ， 喜廉贞化禄 ， 则产业增加 ， 若化忌 ， 则主耗散 。 
流年田宅宫见破军入庙 ， 又有吉曜 ， 则主迁新宅 。 若落陷见煞 。 则家宅破败 。 
会武曲化忌者尤主降黩 ， 或服务机构停业 。 
破军在田宅 ， 不受风水影响 。 
"""
        print(tmp)
        print("\n")
        if(star == "破军紫薇"):
            tmp = """[ 紫微破军 ] 同度 ， 见禄存或化禄 ， 而无煞忌刑耗诸 曜 ， 则主有意外资产可得 ， 
尤喜见天魁天铖同度 ， 稍见煞者 ， 暴得暴失 。"""
            print(tmp)
            print("\n")
        elif(star == "破军天相"):
            tmp = """唯 [ 破军天相 ] ， 则不主得意外资业 。 仅于财阴夹 ， 又见破军化禄的情形下 ， 始 
主置业 。 亦主转换工作环境 。"""
            print(tmp)
            print("\n")
def GongXia11th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微为帝星 ， 入福德宫时 ， 可主福厚 ， 亦可为极度 主观 ， 并因而产生痛苦 。 此 
即 百官朝拱与大野及孤 君 之分别 。 
凡紫微在福德宫 ， 推断时须留意其是否孤立 ， 主 观程度如何 ， 领导能力又如何 ， 
然后始能推断其福泽 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "紫薇"):
                tmp = """子午宫紫微喜化科不喜化权 ， 二者虽皆主决断 ， 唯 化科较柔 ， 化权者较刚 ， 过 
刚则折 ， 亦容易产生挫折感 。 ( 所 以化权者在福德宫不喜更见魁铖 。 ) 
紫微独坐 ， 辅佐吉曜同会 ， 纵命宫不吉 ， 亦受人 尊崇 。 倘无吉曜 ， 而煞忌刑曜
同会 ， 则流为孤僻 ， 易自 寻烦恼 。 兼之受憎之心极浓厚 ， 由是产生困扰或纠纷 。 
紫微坐福 德宫者 ， 即使见煞 ， 一般气质较同侪为高 ， 
但却因此易感孤立 。 凡辅弼同拱 ， 然后多人缘助力 。 
子午紫徽为羊陀夹 ， 主观而且孤僻 ， 为火铃夹则主 思想时不集中 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "紫薇破军"):
                tmp = """丑未 [ 紫微破军 ] 守福德 ， 主其人好亲力亲为 ， 纵有 左辅右弼夹 ， 只主助力多 ， 
但仍不易放心 。 
[ 紫破 ] 若见吉化 ， 吉曜 ， 吉夹 ， 则创造力极强 ， 故 宜从事有开创性之思考 。 破 
军化为权禄之星 ， 则更能屡创新 ， 但却不擅长守成 ， 一陷于闷局反易进退失据 。 
[ 紫破 ] 见煞 ， 又见虚耗 ， 主凡事事倍功半 ， 见刑忌 ， 则易为人破坏嫉妒 ， 而招 
致麻烦困扰 ， 特别劳心费力 。 见火铃或 火铃夹者尤主劳累不堪 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """寅申宫 [ 紫破天府 ] ， 有吉曜朝拱则福厚 ， 且宽厚大 度 ， 无则劳心 ， 再见煞则多 
迟疑不决 ， 进退失据 ， 以致劳累不安 。 
[ 紫府 ] 与禄存同度 ， 虽多物质享受 ， 但常存自利之 心 。 若更火铃夹 ， 则思想常 
不能集中 ， 每因游移不决而招致损失 ， 或惹麻烦 。 
[ 紫府 ] 化科 、 化权 ， 自尊心极重 。 
[ 紫府 ] 而无禄同会 ， 且见羊陀 ， 火铃 ， 空劫 ， 刑耗 者 ， 不但鄙吝 ， 且常多无谓 
忧虑 。  """
                print(tmp)
                print("\n")
        if(star == "紫薇贪狼"):
            tmp = """[ 紫贪 ] 守福德 ， 若贪狼化禄 ， 则不喜昌曲 、 桃花 ， 否 则只主好色 。 无者 ， 则主有 
风雅的嗜好 。 或喜追随潮流 。 思想活跃 。 
倘贪狼化忌 ， 则主多奔波劳碌 ， 且往往因不能当机 立断而常生追悔之心 。 
[ 紫贪 ] 躔火铃 ， 思想积极 ， 见破军化禄者 ， 则常得 陇思蜀 ， 会武曲化禄者 ， 善 
于理财生财 ， 若会武曲化忌 ， 则防因理想太高而自招烦恼 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇天相"):
            tmp = """[ 紫微天相 ] 守福德宫 ， 见辅佐吉曜则宽厚大度 。 有 利忌夹者 ， 则主多疑 ， 且自 
尊心极重 。 若财荫夹者 ， 则更常存公益之心 ， 喜为人服务 。 
[ 紫相 ] 见煞 ， 反主小器 ， 若煞重 ， 又见吉曜 ， 则为 政客 。 
[ 紫相 ] 为火铃夹者 ， 主投机 。 
[ 紫相 ] 喜对宫破军化禄 ， 则创造力极强 ， 凡廉贞化 禄 ， 而无辅佐吉曜者 ， 则易 
流为清客 ， 但自尊心仍重 ， 有辅佐吉曜反而大度 。 
[ 紫相 ] 躔空劫 ， 见华盖 ， 则其人极富哲思 。 唯若又 见天姚 ， 则易流为伪君子 。 """
            print(tmp)
            print("\n")
        elif(star == "紫薇七杀"):
            tmp = """[ 紫相 七 杀 ] 守福德宫者 ， 主观极强 ， 爱个曾之心亦强 。 
化权者尤甚 。 
【 紫微 七 杀 】 而紫微化科 ， 则恐因自尊心与权力欲而 致自招烦个卤 。 
[ 紫杀 ] 必须见禄 ， 然后气质始主调和 。 再见昌曲 ， 则 有礼义 。 
紫杀见化禄皆吉 ， 唯以见廉贞化禄者行事最为 宽厚 ， 见破军化禄则主多劳 。 往 
往虽富贵仍汲汲不可终曰 。 贪狼化禄者常喜在交际场面中摆阔 。 见煞则必多酒色财 
气之嗜好 。 贪狼化总则时 起争夺之心 。 
【 紫杀 】 与关陀 ， 火铃 ， 空劫 ， 刑耗同会 ， 则主困扰 劳累 ， 易于中年后感到人 
生空虚 。 最不喜陀罗 ， 铃星同度 ， 则主自招烦恼 。 若躔火星 ， 做事急如星火 。 """
            print(tmp)
            print("\n")
        
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守福德宫 ， 一般情形下主多思多虚 ， 兴 趣多端 ， 思想不集中 ， 考虑欠周密 。 
若居陷宫 ， 则更易多学不实 ， 考虑时陷牛角尖 ， 且多优虑 。 会空曜 ， 华盖 ， 贝旺觉 
人生空幻 ， 易生宗教信仰 。 
天机如火铃 ， 或火铃夹者 ， 主身劳心劳 ， 不得安宁 。 化忌者更 甚 ， 且往往功败 
垂成 。 
天机化禄不如化权 ， 化权则能增加安定 ， 减少动荡 ． 亦使思想之周密性增加 。 
天机会吉曜 ， 亦不能增加其稳定 ， 唯见煞却会增加 其动荡 。 
"""
        print(tmp)
        print("\n")
        if(star == "天机巨门"):
            tmp = """天机不喜巨门 ， 无论同度或会合 ， 皆增加其动荡 。 即使巨门化禄 ， 亦仅主敏于 
思考 ， 劳丽有获 ， 若巨门化忌者 ， 进退不安 ， 劳心费神 。 
天机化忌与巨门阿度或对拱 ，， 烹枉抛力 。 且易常陷 牛角尖而不能自拔 。 若与桃 
花诸曜同麓 ， 则主易路感情困扰 。 或主爱情不专一 。 
天机巨门与火铃同度 ， 是为败局 。 化忌者多劳心 ， 是非 ， 化禄者圆滑 ， 但却易 
自寻烦恼 。 亦主学不专 一 。 """
            print(tmp)
            print("\n")
        elif(star == "天机天梁"):
            tmp = """天机与天梁同度或对拱 ， 无煞者 ， 常能自得其乐 ， 有煞 ， 则思想易走偏锋 。 有 
空劫同度者更甚 ， 但若沉潜于哲理 ， 却每有成就 。 
天机天梁的组合 ， 若天梁化禄 ， 又见煞忌刑耗空劫 ， 则多因财思虚 ， 烦恼 ， 或 
火之日夜奔波 。 天粱化权 ， 化科 ， 亦主精笔算 ， 为计姗 ， 管理 ， 设计人材 。 
天机天梁而天机化忌 ， 主易失眠 。 
天机天梁亦不喜火铃同度 ， 主烦躁不安 ， 易自寻烦 恼 。 更见空曜 ， 人生每觉空 
虚 ， 因而既急躁 ， 又消极 ， 易 成为不良不莠 。"""
            print(tmp)
            print("\n")
        elif(star == "天机太阴"):
            tmp = """天机太阴的组合 ， 若不见煞 ， 则主第六感觉强 。 
天机太阴 ， 主其 人既喜热闹 ， 但离开交际场合 ， 却有个人的天地 。 
天机太阴而天机化禄者 ， 兴趣广泛 ， 若见昌曲 才 ， 便为现代才子型人物 ， 虽无 
实学 ， 却令人觉得才气纵横 。 
天机太阴而太阴化禄者 ， 主精于筹算 。 
天机太阴而太阴化忌 ， 见煞刑空耗诸曜重重 ， 每主 智商低 。 但若吉煞交集 ， 则 
却又聪明伶俐而欠沉潜 。 
天机太阴而天机化忌者 ， 更见煞曜空劫 ， 思想多不 循正道 。 命宫若又不 ， 则每 
每易染不良嗜好 ， 以致诡诈多端 。 
天机太阴与文曲化忌同度 ， 其人多偏才 ， 更见煞曜 、 天姚 、 天虚诸曜 ， 则善砌 
词 ， 亦主工心计 ， 若天机化科 ， 文曲 ， 华盖 同度 ， 则主爱好神秘事物 ， 如术数 ， 幻 
术之类 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳守福德宫 ， 入庙者 ， 主个性开朗 ， 虽任劳任怨 亦有精神享受 。 落陷者 ， 则 
招是非口舌 ， 且烦躁不宁 。 
太阳主发射 ， 故在福德宫时 ， 无论入庙落陷 ， 均主 人好动不好静 。 见擎羊 、 火 
星同度 ， 尤主其人无事奔忙 。 若日生人 ， 见左辅右弼 、 三台八座同会 ， 然后始主较 
为安静 。 
太阳在福德宫 ， 一般主人自尊心强 ， 荣誉感重 。 尤 以太阳天梁星系组合及太阳 
化科者为然 。 但若有煞刑诸曜同度者 ， 则自尊心可能发展为自卑感 ， 原则性则变为 
顽固 ，太阳化忌者尤甚 。 
夜生人 ， 太 阳在福德宫 ， 除在丑未二宫 [ 太阳太阴一 同度者外 ， 一般均主不得宁 
静 。 落陷者更多忧虑 ， 常因小事而郁郁不乐 。 尤以与巨门化忌同度者为甚 。 
日生人 ， 太阳在福德宫落陷者 ， 每有求全之心 ， 因 而导致烦忙 。 巨门同度者尤 
甚 。 
太阳与陀罗同度 ， 人庙者 ， 仅主烦忙 ； 若落陷 ， 往 往自招烦恼 ， 且因热心助人 
而反招怨恨 ， 或常易招人误会 。 
太阳与空劫同芳者 ， 心绪不宁 ， 无事奔忙 。 见天马 同度者 ， 奔忙更甚 ， 且劳而 
无功 。  
女命福德富见太阳入庙者 ， 会诸吉 ， 主多闺房之乐 。 见桃花诸曜同度则主淫滥 ， 
落陷者尤甚 。 睢同时见空曜天刑 ， 则主能自律 。 
女命福德宫太阳化忌易受异性拖累 ， 常陷于感情 泥沼而难自拔 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阳太阴"):
            tmp = """太阳太阴的组合 ， 为阴阳调和 ， 主虽奔忙而仍能 乐享受 。 唯戌宫的太阳落陷 ， 
则仍主不得安宁 。 
[ 太阳太阴 ] 同度者 ， 最能忙里偷闲 ， 忙中得静趣 。 唯 若太阳化忌 ， 则有自卑感 ； 
太阴化忌者 ， 则易心志卑弱 ， 缺乏勇气 ， 仅能随遇而安 。 """
            print(tmp)
            print("\n")
        elif(star == "太阳天梁"):
            tmp = """太阳天梁的组合 ， 须仔细分别 。 见科文诸曜者 ， 主 聪明且好思考 ， 其情绪不宁 
亦由学术 、 问题的思考而来 。 但若见陀罗 、 铃星 、 天虚 、 阴煞 、 天姚 、 长生十二神 
之死曜等 ， 则主思想顽固 ， 喜钻牛角尖 ， 其烦恼与不安亦由此而来 。 
太阳天粱在福德富者 ， 不宜为人强出头 。 陀罗 、 钤 星同度者 ， 或太阳化忌者尤 
甚 。 亦不宜正面出头 ， 仅宜幕后策划 ， 否剐必招是非尤怨烦恼且易恩反成仇 。"""
            print(tmp)
            print("\n")
        elif(star == "太阳巨门"):
            tmp = """太阳 巨 门的组合 ， 主劳心费神 。 巨门化 忌者常主枉 抛心力 ； 太阳化忌者 常因理 
想不能实现而致困扰自卑 。 若巨门化禄 、 权者 ， 则常以口才得人赏识 ，． 或以方言 ， 
外语而得人欣赏 。 由是精神上得到满足 。 
太阳巨门的组合 ， 著见煞忌 ， 则常易招误会 ， 或主 受压力 受威胁 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为财星 ， 故福德宫 。 其精神享受亦必以物 质享受为基础 ， 化禄者尤 甚 。 贪 
狼同度者亦甚 。 
若武曲于福德宫化忌 ， 则 以 求财富为唯一精神享 受 ， 见煞 。 更主悭贪 ， 为富屋 
贵人 。 倘更见天月 、 天刑 、 天虚 、 阴煞 、 大耗诸曜 ， 则可能身带疾病 ， 或有特别癖 
好 ， 以 致影响精神享受 。 町洋疾厄宫及命宫 而 推断 。 
由于追求物质 ， 故武曲居福德宫时 ， 主人 劳心费神 ， 即使表面物质生活富足 ， 裨 
上精神空虚 。 尤以武曲破军的组合 ， 主人一生无理想 、 无目标 。 见煞者更欠精神享 
受 。 
且不耐安静 ． 以奔忙为乐 。 
武曲喜与廉贞化禄 、 贪狼化禄相会或同度 ， 前者主 精神愉快 ， 后者主多应酬之 
乐 。 故前者偏重 二精神 ， 后者 偏重于物 质 。 
武曲与廉贞化忌相会 ， 则常觉精神空虚 。 见煞 ， 则 主情绪上有挫折感 。 
武曲与廉贞化忌同会 ， 则主其人汲汲不叮终日 ， 虽 富有仍时时恐惧困乏 。 
武曲与桃花诸曜同度 ， 若同时见科文诸曜者 ， 则其 人喜流连风月 ， 以为精神享 
受 ， 武曲贪狼同度者尤然 。 
武曲与天厨 、 火星同躔福德宫 ， 其人擅长 品 评饮食 。 再见羊陀同度则为偏食 。 
武曲破军星系尤然 。 
"""
        print(tmp)
        print("\n")
        if(star == "武曲天府"):
            tmp = """[ 武曲天府 ] 见煞忌则主观 。 见辅佐诸曜则兴趣在于 商业 ， 尤擅长管理 。 
武曲天府基本性质为身安心劳 ， 但若火铃同度 ， 则不但内心易忧煎 ， 且亦主劳"""
            print(tmp)
            print("\n")
        elif(star == "武曲破军"):
            tmp = """武曲破军主内心多反覆 ， 且奔波不安 。 见煞者尤 甚 。 一生颠沛 。 
唯 [ 武曲破军 ] 与科文诸曜同度 ， 则主其人有独特见 解 ， 尤擅长于打破僵局 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲七杀"):
            tmp = """[ 武曲七杀 ] 同度者 ， 主奔忙 。 见煞 ， 主身心俱劳 。 见 天马 ， 主宗旨不定 ， 作事 
反覆进退 。 
[ 武曲七杀 ] 与天厨同度 ， 研究饮食必有专长 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲天相"):
            tmp = """[ 武曲天相 ] 在福德宫 ， 主其人易随波逐流 。 见吉 ， 然 后始主能乘势 ， 善于利用 
机会 。 
[ 武曲天相 ] 最不喜与空劫同度 ， 则主其人过空想 ， 能坐言而不能起行 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲贪狼"):
            tmp = """[ 武曲贪狼 ] 主性耽于物欲 。 桃花诸曜同度者 ， 主性 喜流连风月 。 科文诸曜同度 
者亦然 。 若桃花诸曜与科文诸曜交躔 ， 虽则风月却较高尚 。 
武贪见火星同度 ， 主追求快乐 ， 今朝有酒今朝醉 。"""
            print(tmp)
            print("\n")
        
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """福德宫喜见天同 ， 主共人精神生活丰足 ， 尤主性喜 音乐 。 然而有时并不代表物 
质生活充裕 。 
天同化禄 ， 有时嫌过份天真 。 入庙者佳 ， 落陷则须 不可任性 。 
天同喜见科文诸曜同会 ， 则主精神享受情趣高雅 。
若见煞刑诸曜 ， 则其精神享受仅为自得其乐 ， 可能流为癖好 。 甚至有时亦可为不 
良嗜好 。 
天同化忌 ， 一般主是非困扰 ， 但须详细判别有无 自寻烦个卤的性质 。 故最不喜陀 
罗 、 铃星同躔 。 
天同化忌 ， 更见天刑 、 天月 、 天姚 、 空曜 、 阴煞 、 天虚等杂曜同度或会合 ， 又 
有天德 、 月德者 ， 有时为弱智或自闭症的表徵 。 这种病人无忧无虑 ， 自己成为一个 
世界 ， 所以亦可视为精神享受丰足 。 
天同化权则情绪稳定 。 亦能主动掌握精神享受的方 向 。 见科文诸曜 ， 性质最为 
优雅 。 
唯天同化忌虽有弱智的危险 ， 但当化忌而无煞刑 诸曜同度 ， 且见辅佐吉曜 ， 或 
与天梁对拱 ， 更见科文诸曜之时 ， 则主其人聪明敏睿 。 
天同与空劫同度 ， 情绪不稳定 。 纵有吉曜同会 ， 亦 主多空想幻想 ， 若与陀罗 、 
铃星会合 ， 则时时沉溺于幻想之中 ， 形成怪癖 。 为旁人所 不能理解 。  
"""
        print(tmp)
        print("\n")
        if(star == "天同巨门"):
            tmp = """天同巨门的组合 ， 以巨门能暗蔽天同的情绪 ， 故常 主精神享受有阴暗面 ， 特别 
容易沉溺于苦恋 ， 畸恋 ， 以致形成内心痛苦 。 
天同巨门而巨门化忌者 ， 内心痛苦尤甚 ： 天同化忌 者 ， 则虽痛苦而仍能以苦为 
乐 。 若天同化禄 ， 则仅主因隐衷而烦扰 ； 巨 门 化禄 ， 内心痛苦性质温和 。 """
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """天同天梁的组合 ， 一般情形下主安乐 。 但若见天马 、 火星 ， 则此种安乐仅由凡 
事不经心而来 ， 故可伸展为惰性 。 
天同天梁而天梁化科者主聪明 ， 决断 。 又主外圆 内方 。 
天同天梁的组合 ， 不 宜 见辅佐诸曜太多 ， 否则主欠 决断力 、 独立性 。 
天同天梁而天梁化禄者 ， 常主内心犹豫 ， 往往进退 失据 。 """
            print(tmp)
            print("\n")
        elif(star == "天同太阴"):
            tmp = """天同太阴一般情形下亦主安乐 。 唯若天同化忌 ， 或太阴化忌 ， 又见空曜 、 火铃 、 
天月等 ， 则主弱智 。 
天同太阴与火铃同度 ， 时常因不经心而惹烦恼 。 思 想上有 [ 盲点 ] ， 易因感情而 
见事不明 ， 或有同性恋的倾向 。 
天同太阴化禄者 ， 始主一生安宁 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守福德宫 ， 主忙碌 。． 即使能自得其乐 ， 其乐趣 仍由忙碌而来 。 一般兴趣在 
于绘画及摄影 。 
廉贞与煞曜空劫刑耗同度 ， 主烦躁不安 ， 形神俱劳 。 或则无事奔忙 。 
廉贞化禄者 ， 无科文诸曜同度 ， 则情操 平庸 ， 有则情操高雅 ， 唯皆能享受书画 
琴棋之乐 。 或有幽默感 
廉贞化禄与桃花诸曜同度 ， 则喜享受风月 。 唯仍与 贪狼之寄情酒色不同 。 
廉贞化忌 ， 主多忧多虑 ， 或为神经过敏 ， 可发展为 怔忡 、 失眠等病患 。 
廉贞化忌若与桃花诸曜同会 ， 则闺房中有畸行 。 更 见空曜 ， 主同性恋 ， 见煞刑 

诸曜 ， 为虐待狂或被虐待狂 。 
廉贞化忌与科文诸曜同度者 ， 亦有艺术倾向 ， 而且 对艺术感觉敏锐 ， 或成为癖 
好 ， 并以风雅的癖好为精神享受 ， 但多讥评 ， 不能随遇而安 。 
 
"""
        print(tmp)
        print("\n")
        if(star == "廉贞贪狼"):
            tmp = """[ 廉贞贪狼 ] 见科文诸曜者 ， 重精神享受 ； 火铃夹 、 羊 陀夹 、 或陀罗同度者 ， 则 
重物质享受 。 然而二者茸性质不佳 ， 如与空劫刑耗同度 ， 且见化忌 ， 则可发展为怪 
癖 。 
[ 廉贞贪狼 ] 与火星同度 ， 主无事奔忙 ， 或喜无谓应 酬 。廉贞星系在福德宫 ， 有两种截然不同的性质 。 [ 廉贞 天府 ] 、 [ 廉贞天相 ] 、 [ 廉贞 
贪狼 ] 皆主自得其乐 ；  """
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """『 廉贞破军 ] 在福德宫主劳碌 。 破军吉化者则劳 而有 
成 ， 若廉贞化忌 ， 则劳而无功 。 
【 廉贞破军 】 有煞 ， 凡事易生改变之心 。 无煞者始有 决断力 。[ 廉贞破 军 ] 、 [ 廉贞 七 杀 ] 及廉贞独坐 ， 皆主多思虑 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞七杀"):
            tmp = """【 廉贞七杀 】 不擅长思考 ， 却思虑不休 。 见煞者尤甚 。 廉贞化忌 ， 且易因琐事 
而劳心焦虑 。 无煞 ， 有科文诸曜同度 ， 精神始易平衡 。 
【 廉贞七杀 】 思想消极 。 凡事喜从坏方面着想 。 [ 廉贞破 军 ] 、 [ 廉贞 七 杀 ] 及廉贞独坐 ， 皆主多思虑 。 """
            print(tmp)
            print("\n")
        elif(star == "廉贞天相"):
            tmp = """【 廉贞天府 】 而府库空露者 ， 有自卑感 ， 更见天姚 、 天 月 ， 则主贪婪 。 
[ 廉贞天相 ] 喜财荫夹 ， 则气质自然平和 ； 若为 刑 忌 夹 ， 则意志卑弱 。 
[ 廉贞天相 ] 喜昌曲夹 ， 主聪明 。 又喜与科文诸曜同 度 ， 则气质优雅 ， 艺术 感极 
强 。 且喜谈论政治 ， 或参与政治活动 。 
[ 廉贞天相 ] 若为火铃夹 、 羊陀夹 ， 则心理上自然产 
生压逼感 。 由是有不可理解之举动 。廉贞星系在福德宫 ， 有两种截然不同的性质 。 [ 廉贞 天府 ] 、 [ 廉贞天相 ] 、 [ 廉贞 
贪狼 ] 皆主自得其乐 ；  """
            print(tmp)
            print("\n")
        elif(star == "廉贞天府"):
            tmp = """[ 廉贞天府 ] 不加 煞 ， 一生自得其乐 。 能忙里偷闲 ， 或 虽忙碌而仍多乐趣 。 若加 
煞曜 ， 则喜无事忙碌 。 
[ 廉贞天府 ] 而天府化科者 ， 外表平易 ， 其实自尊心 甚重 。廉贞星系在福德宫 ， 有两种截然不同的性质 。 [ 廉贞 天府 ] 、 [ 廉贞天相 ] 、 [ 廉贞 
贪狼 ] 皆主自得其乐 ； """
            print(tmp)
            print("\n")
        elif(star == "廉贞"):
            tmp = """廉贞独坐 ， 主多思虑 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府在福德宫 ， 主为人谨慎 。 唯若与陀罗同度 ， 则 主小器 ； 火星同度 ， 常多不 
必要的思虑 ； 擎羊同度 ， 内多疑惧 ； 铃星同度 ， 对自己的决定多忧煎 ； 空劫同度 ， 
蘑 
无事找事做 ， 即广府人之所谓 [ 煲无米粥 ] 。 
天府化科 ， 则重信诺 。 同时见煞 ， 主身安而 ， 己 劳 。 其心劳多由荣誉感出发 。 
天府喜同会辅佐诸曜 。 主内心安静 ， 且有决断 力 。 见禄者尤擅长运筹帷幄 。 
天府见科文诸曜 ， 则常生恻隐之心 。 且主聪明而敦 厚 。 
天府与魁钺同会 ， 泱泱大度 。 
天府与天姚同度 ， 主好弄权术 ； 与天刑同度 ， 性好 挑剔 ； 与天月同度 ， 主内向 。
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """ 丑未宫的天府 ， 比较卯酉宫者有冲动 。 但若陀罗同 度 ， 则易生改变之心 ， 因而 
自招烦恼 。 
丑未宫的天府若空露时 ， 则主好弄巧 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """ 卯酉宫的天府 ， 身安心劳的性质最为明显 。 若火铃同度或相夹 ， 尤主身心皆不 
安静 。
卯酉宫的天府与桃花诸曜同度 ， 主好色 。 唯其好色 的本性却喜隐藏 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥宫的天府空露 ， 则心志卑弱 。 有禄 ， 则泱泱大 度 ， 且领导力极强 。 
巳亥宫的天府 ， 一般进取心较强 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴主静 ， 故居福德宫 ， 一般主喜宁静 。 即使太阴 落陷 ， 有煞 ， 亦主其人闹中 
有静趣 ， 或能忙里偷闲 。 唯无论入庙落陷 ， 均主竞争力不强 。 
太阴在福德宫 ， 入庙 ， 主有精神享受 ，。 且以乐观者 居多 。 唯若见空劫同度或相 
会 ， 则可能为万事不经心之乐 观 ， 或多白日梦 ， 沉醉于梦境 。 更见煞曜 、 天虚 、 大 
耗 、 天月 、 天刑 、 天姚等 ， 则可能发展为自闭症 。 若更与天同化忌同度 ， 则主弱智 
卜或心理不正常 。 
太阴落陷 ， 火星同度 ， 刚内心焦躁 ； 铃星同度 ， 则 情绪不稳定 ； 擎羊同度 ， 则 
忙碌而少成 ； 陀岁同度则小器 。 入庙者 ， 仅主不满足 ， 且因不满足而致忙碌 。 
太阴入庙与科文诸曜同度 者 ， 享受高雅 。 唯落陷 昌滟瞢 。 则 华而不实 ， 更见空 
曜 ， 内心孤寂 。  
太阴化忌 ， 不见煞 ! 亦主内心不安宁 。 见煞 ， 则不 但内心不宁 ， 且身劳不安 。 
"""
        print(tmp)
        print("\n")
        
        if(dizhi == "卯"):
            tmp = """太阴在卯宫落陷者 ， 有昌曲与迁移富的天梁同度 。 亦主擅长计划 。 有煞亦工心 
计 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 太阴在辰戌二富 ， 主擅权变 。"""
            print(tmp)
            print("\n")
        elif(dizhi == "亥"):
            tmp = """太阴在亥宫入庙者 。 与天 机相对 ， 故擅长计划 。 有 煞则主心计 。  """
            print(tmp)
            print("\n")
        if(star == "太阴太阳"):
            tmp = """【 太阴太阳 】 同度者 ， 若日生人 ， 则主天真 ； 夜生人 ， 则主享受 ， 有生活品味 。 
太阳化禄则开朗 ； 太阴化禄则沉 潜 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼在福德寓 ， 主放纵 。 见煞者固然放纵享乐 ， 即 使见吉星同会 ， 亦主醉心于 
一种嗜好 。 嗜好的性质可详具体星曜组合而定 。 见科文渚曜则优雅 ， 见桃花渚曜则 
贪酒 色赌博 。 若见空曜华盖则好哲学宗教 。 
贪狼化禄 ， 增加物欲享受的色彩 。 化忌 ， 则主无事 奔忙 。 多无谓的交际应酬 。 
且往往于奔忙应酬中枉抛心力 以致功败垂成 。 
贪狼化禄 、 化权者 ， 主喜投机 。 尤以 『 火贪 』 、 『 铃贪 』 格者为然 。 
福德宫见 [ 泛水桃花 ] 、 『 风流采杖 』 的格局者 ， 主好 色 。 但若有火刑交并 ， 则又 
主其好经营带桃花色彩的行业 ， 或喜侥幸犯险以求暴利 。 贪狼化禄者尤然 。 
贪狼会桃花诸曜 ， 一生风流自赏 。 但其人亦必有特 别才艺 ， 令异性倾 。  
贪狼与羊陀同躔 ， 一生多困扰纠纷 ， 喜交游而偏因 交游惹是非烦恼 。 
贪狼与火铃同度 ， 主性急 。 见禄 ， 则主好浮华 。 若 同时见空劫 ， 则中年以后 ， 
绚烂归于平淡 。 
贪狼昌曲同度 ， 倾向于艺术 。 但多动态倾向 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "午"):
            tmp = """贪狼在午宫者主好名 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "申"):
            tmp = """在申宫者主好利 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 在辰戌二 宫者好投机 。 见吉者尤然 。"""
            print(tmp)
            print("\n")
        
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门临福德宫 ， 其基本意义为 费神 。 原因在于凡事 轻于决定 ， 然后生追悔之心 。 
或喜事事亲力亲为 ， 事无大小皆必过问 。 
巨门为暗曜 ， 故无论任何星曜与之同度或相对 ， 其 阴暗面必然呈现 。 所以当天 
机受到巨门的影响时 ， 便表现为时喜中途改变决定 ， 或凡事半途而废 ， 或时生追悔 
之心 ； 当太阳受到巨门的影响时 ， 便表现为凡事亲力亲为 ， 或为小事而浪费精神 ； 
当天同受到巨门的影响时 ， 便表现为遇事先不经心 ， 然后却生悔恨 。 
巨门化禄 、 化权 ， 主人事无大小必须过问 ， 而且很 难接受别人的决定 ， 遇事必 
加己见 。 巨门化忌则常追悔 ， 而且过份追求理想 。 
巨门与太阳 化忌同度或相对 ， 则易因事事亲力亲为 而反招怨个艮 。 若太阳化禄 、 
杈 、 科 ， 则虽操心费神而仍能有精神享受 。 
巨门与天机化忌同度或相对 ， 则反悔之心极重 ， 以 致人际关系不佳 。 天机化禄 
权科 ， 则其追悔尚有责任上的交代 。 
巨门与天同化忌同度或相对 ， 则内心常觉苦闷 ， 或 易陷痛苦的情网 。 天同化禄 ， 
则主追求精神享受 。 
巨门见煞 ， 则操心劳碌 ， 进退犹豫 ， 且招是非压力 。 见吉曜亦主追求物欲 ， 并 
非精神上的愉快 。 若与空劫同度 ， 则多空想理想 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守 福德宫 ， 甚受同会的星曜影响 。 亦受相邻的星曜影响 。 
天相与 『 廉贞破军 』 相对 ， 最有正义感及同情心 。 不 见煞则不流于偏激 ， 不见 
昌曲则感情 ： 与理智可以平衡 。 
若廉贞吉化 ， 感情重于理智 ， 若破军吉化 ， 理智重 于感情 。 廉贞化忌则有感情 
创伤 。 
天相与紫微破军相对 ， 最易成为政治上的反对 派 ， 见煞则偏激 ， 且不负责任 。 
见昌曲则表现温和 ， 且负责任 。 
若紫微化权 ， 较偏激 ， 但责任心极重 ； 紫微化科 ， 名誉感极重 。 破军吉化 ， 尤 
主理智 。 
天相与武曲破军相对最有责任心 ， 却临事欠主 张 ， 因而易受人怂恿 ， 见昌曲者 
尤甚 。 见煞 ， 少则可以激发本身的意志 。 见煞重则易为人左右 。 陀罗同度则自招烦 
恼 。
见武曲吉化 ， 物质享受重于精神享受 ， 决断力亦较 佳 。 武曲化忌 ， 主因财失义 。 
天相为财荫夹 ， 嫌有依赖心 ； 为刑忌夹 ， 则多忧多 虑 。 
天相与四煞同会者 ， 凡事必多生 枝节障碍 。 与空劫同会者 ， 偏于空想 ， 坐言不 
能起行 。 
天相会空露的天府 ， 主一生招人打击 ； 若会有禄的 天府 ， 则主自足 。 
天相得禄 ， 主精神生活充足 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁主清贵 ， 故居福德宫时 ， 主人重视精神享受 。 同会入庙的太阳 ， 则太阳能 
解其孤忌之性 ， 自然精神生活丰足 。 
天梁化禄主招忌 ； 化权 ， 则自尊心极重 ； 化科 则主聪明敏睿 ， 宜学术研究 。 天 
巫同度 ， 思想超脱 ； 华盖同度 ， 倾向于哲理 ； 二 者若更逢空曜 ， 则其思想不易为人 
理解 。 
太阳落陷与天梁同会 ， 则主好理闲事 ， 以致自招忙 碌 。 更见吉曜 ， 却主忙于公 
益 。 若吉凶交集 ， 天梁不见吉化 ， 而会巨门化忌者 ， 却主伪善 。 
天梁与天同同拱 ， 主乐天知命 。 天同化忌则欠主张 ， 且一生浮荡不安 。 
天梁与天机同度或对拱 ， 劳心费神 。 天机化 忌 ， 则 
多躇不安 ， 且凡事欠宗旨主张 。 
天梁入庙 ， 一生安暇 ， 且有名士风致 ． 不喜处理俗 务 。 若天梁居于陷地 ， 则转 
化为懒散偷闲 。 见科文圹曜者尤甚 。 
天梁踺火星 ， 易烦躁不安 ； 铃星同度 ， 思想多阴暗 面 。 陀罗同度 ， 自招烦恼 ； 
擎羊同度 ， 无吉则惹是非竞争 ， 有吉则为好学慎思 。 空劫同度 ， 主理想太高 。 
太阳天梁与煞忌刑耗天月同会 ， 主易染不良嗜好 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥" or dizhi == "申"):
            tmp = """天梁在巳 、 亥 、 申三宫 ， 见天马 、 空劫 、 主一生浮 动不安 ， 不安一业 ， 时生改 
变之心 ， 以致影响事业 。 见煞忌者 ， 更主虚浮 。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀在福德宫 ， 入庙 ， 虽主有理想 ， 但却不利婚姻 ， 故宜迟不宜早 。 落陷且主 
思想倾向于消极 。 
七杀的理想 ， 偏重于个人利益 ， 因此每有怀才 不遇 之心 。 若见煞忌 ， 则更主牢 
骚满腹 ， 可能发展为偏激 。 
七 杀不喜廉贞化忌 ， 主感情上挫折不安 ， 且多无谓 的举动 ； 见武曲化忌 ，。 则 
内心焦虑 。 
女命 七 杀在福德宫 ， 亦主不利婚姻 ， 宜迟婚 ， 或以 偏房 、 继室为宜 。 见煞忌者 
更甚 。 
七 杀与武曲化忌同度或相对 ， 更主对婚姻不利 。 往 往有刑克 、 生离之事 ， 或主 
配偶体弱多病 ， 见煞者更甚 。 
七 杀在福德宫者 ， 每主冒昧作出决定 。 与武曲同度 或对拱者 ， 更主短虑 。 火铃同 
度更甚 ， 作出决定后更常多疑虑 。 
七 杀守福德宫者 ， 喜忙碌而不得清闲 。 紫微同拱者 更甚 。 若对宫 [ 紫微天 府 ] 而 
紫微化权者 ， 则凡事喜亲力亲 为而虎头蛇尾 ； 若天府化科 ， 则优柔寡断 。 又主理想 
太高 
不能实现 。 
七 杀与 [ 廉贞天府 ] 相对者 ， 主忙碌 ， 且喜为人谋 廉贞化禄者尤甚 。 
七 杀与空露的天府相对 ， 主内心多忧煎 。 倘府库充 盈 ， 则主福厚 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守福德宫 ， 入庙则病善决断 ； 落陷则多成见 ， 少决断 。 然二者皆主喜亲 
力亲为 ， 劳心劳力而不辞 ， 且易生改变之心 。 
破军与煞忌同会 ， 更见在刑 、 阴煞 、 大耗 、 天月等 曜 ， 主易患慢性疾病 ， 久缠 
难愈 ， 以致影响精神享受 。 
破军与火铃同度 ， 内心急躁焦 虑 ； 见羊陀同度 ， 内 心多追悔 ， 且多主意改变 ； 
见空劫同度 ， 多空想而少实行之心 。 
破军不喜昌曲同度 ， 若更见煞 ， 则主虚伪 。 不见煞 ， 则多犹豫胡疑 。 
破军与 [ 廉贞天相 ] 相对 ， 普通情形下少忧虑 ， 唯廉 贞化忌 ， 则惶惶不可终日 。 
破军与 [ 武曲天相 ] 相对 ， 主凡事劳心劳力 ， 不肯信 人 。 若武曲化忌 ， 则忧虑烦 
恼 ， 且凡事反覆 。 
破军与 [ 紫微天相 ] 相对 ， 一般情形下主自我陶醉 。 若紫微化科则自信心尤强 ； 
紫微化权则过份自我中心 。 
破军见辅佐吉曜 ， 则主多创见 。 
破军化禄化权 ， 又见火星 、 擎羊者 ， 主好高鹜 远 。 
破军与财荫夹的天相相对 ， 主气质优雅 ； 与刑忌夹 的天相相对 ， 则多无谓忧虑 ， 
有压逼感 ， 时生突破现状之心而不能实行 。
"""
        print(tmp)
        print("\n")
def GongXia12th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守父母宫 ， 主父母有权威 。 然如无百官朝拱 ， 则仅主父母主观 ， 在家庭有 
暴君倾向 ， 其权威性质在此 。 故若见煞忌刑曜 ， 则主自己童年不为父母爱护 ， 或父 
母常主观命令 ， 左右自己的意志 。 
这点性质 ， 亦可以用来推断跟上司的关系 。 上司习 惯命令 ， 须注意如何调和 。 
若紫微化科 ， 则父母主观 。 在野孤君者 ， 主观程度更甚 。 
若贪狼吉化 ， 见科文诸曜 ， 亦主感情融洽 ； 见桃花 诸曜 ， 父有偏房外室 。 
唯若廉贞化忌 ， 煞重主 刑 ， 煞轻则主不和 ； 贪狼化 忌 ， 亦主父有外室 ； 武曲化 
忌 ， 或为父母事业倾败 ， 或为刑克分离 ， 或为灾病 。 
与上 司的关系 ， 可依上述性质同断 。 
父母宫星曜性质 ， 主父亲或主母亲之克应 ， 仍须视 太阴太阳及日夜生人而定 。 
如太阴在巳宫化忌 ， 父母见紫微在子 ， 火星同度 ， 则主父亲离家 ， 自己依随母氏 。 
盖父 
亲时时离家 ， 母亲自然化忌矣 。 
"""
        print(tmp)
        print("\n")
        if(star == "紫薇贪狼"):
            tmp = """若 [ 紫微贪狼 ] 同度 ， 则不宜见武曲化忌 ， 更见煞 ， 主父母有意外灾病 。 亦不 ， 
宜见廉贞化忌 ， 见煞则主不为父母爱护 。 火星在命宫者 ， 主童年出继 。 
[ 紫微贪狼 ] 与火 、 铃同度 ， 亦主少小即离开父亲或 母亲 。 见吉 ， 其分离性质温 
和 ， 如 出外寄宿 ， 或父亲出外谋生之类 。"""
            print(tmp)
            print("\n")
        elif(star == "紫薇破军"):
            tmp = """『 紫微破军 』 见煞 ， 即易刑克分离 。 与上司的关系则 主易生变化更迁 。 
紫微破军对拱破军的组合 ， 则不主刑克 ； 见煞仅 主离别 ， 着更会武曲化忌 ， 亦 
主父母灾痫 。 会廉贞化忌 ， 见煞 重重 ， 主伦常有变 ； 煞轻主不和 。 
若破军化禄 ， 则离别克应之期在第二 个大限 。 火星同度则提前 。 """
            print(tmp)
            print("\n")
        if(dizhi == "子"):
            tmp = """紫微 、 擎羊 、 火星同度在午宫 ， 父母脾气暴躁 ， 或 父母关系不佳 。 见辅佐单星 ， 
或桃花诸曜 ， 主有继母或父亲有外宠 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            if(star == "紫薇天府"):
                tmp = """ 寅申宫 [ 紫微天府 ] 在父母寓 ， 不见在辅佐单星 ， 则无刑克 ； 若见单星 ， 主二母 ； 
桃花诸曜重重者 ， 主自身为继室所生 。 
紫微化科 ， 父母权威 ； 天府化科 ， 父母呵护 。 唯紫微化权则武曲必同时化忌 ， 
不 见煞尚可 ， 若煞刑诸曜重重则主父母有重大挫败 。"""
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "紫薇七杀"):
                tmp = """巳亥宫 【 紫微 七 杀 】 ， 对四化影响极为敏感 。 基本性质则为父母有责任心 ， 无论 
任何种 情 形下 ， 对自己均能呵护 。 
故最喜见廉贞化禄 、 破军化权 、 武曲化科同时相会则两代感情融洽 ， 且主受父 
母提携 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守父母富 ， 基本性质不利父子间的人际关系 。 见禄权科会 ， 然后始主稳定 ， 
否则 主两代远离 。 入庙无煞 ， 则远离的性质温和 。 
天机与桃花 、 天马同会 ， 主少小过继 、 出祀 ， 或年 长入赘 ， 或供养岳家而不供 
养父母 ， 或亲近岳家 ， 视煞忌轻重而定 。 
天机巨门的星系 ， 又主父母与当局者的配偶 不和 ， 见煞尤确 。 
天机与羊陀同会 ， 又见空劫 、 天刑者 ， 主刑克 ， 或 重拜父母 。 
天机与火铃同度 ， 主离不主克 。 
天机化忌 ， 基本性质为两代人际关系不佳 。  
凡天机在父母宫 ， 稍见刑忌即有 事端 ， 应详各流年父母宫而厘定其克应 。 克应 
之期 ， 多在太阴太阳的宫度 。 
"""
        print(tmp)
        print("\n")
        if(star == "天机太阴"):
            tmp = """[ 天机太阴 ] 为较佳组合 ， 无煞 ， 不主刑克分离 。 有 煞而不会化忌 ， 亦不主刑克 ， 
仅主分离 。 
[ 天机太阴 ] 而天机化禄者 ， 太阴 必同时化忌 ， 夜生 人父母宫在寅宫者 ， 早年不 
利父亲 。 
[ 天机太阴 ] 天马见煞 ， 与父母关系疏远 ， 却亲近配 偶或外室的父母 。"""
            print(tmp)
            print("\n")
        if(dizhi == "子" or dizhi == "午"):
            if(star == "天机"):
                tmp = """ 子午天机会天同化忌 ， 亦主关系不佳 ； 见煞 ， 则主 有伤心落泪之事 。 若对巨门化忌 ， 则童年父母不利 。 丑未宫者同论 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            if(star == "天机"):
                tmp = """ 丑未天机见吉者 ， 主父亲有偏见 。 
丑未天机与空曜同度 ， 与父母远离 。"""
                print(tmp)
                print("\n")
        
        elif(dizhi == "卯" or dizhi == "酉"):
            if(star == "天机巨门"):
                tmp = """卯酉宫 [ 天机巨门 ] ， 不见煞亦主远离 ， 或两代人际 关系不佳 ， 或不利父母 。 见 
煞者主刑克 ， 或父业破败 。 然酉宫者优于卯宫 。 
所谓 [ 不利父母 ] ， 乃指出生后父母境遇欠佳 。 持此 以验上司 ， 亦主上司在工作 
上境况不利 。 此项徵验可以推断流年 。  """
                print(tmp)
                print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            if(star == "天机天梁"):
                tmp = """[ 天机天梁 ] 在辰戌宫 ， 见吉化 、 吉曜 ， 则主有父母 荫庇 ， 亦主有上司提携 。 唯 
此荫庇提携之力不耐久 。 
天机天梁天马 ， 主远离 。 有火星 者 ， 远离性质不 吉 。 
[ 天机天梁 J 会太阳化忌 ， 夜生人不利父亲 。 见煞 ， 主 出祀 、 过继 、 寄养 。 """
                print(tmp)
                print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            if(star == "天机"):
                tmp = """巳亥宫天机 ， 若躔桃花诸曜 ， 又躔火铃 ， 主为偏房 继室所生 。 
巳亥宫天机 ， 见煞 ， 或见辅佐单星 ， 多主两重父母 。 会天同化禄者尤然 。 
亥宫天机最不喜与巳宫太阴化忌相对 ， 主早年父母 灾病死亡 。 
亥宫天机借会酉宫 [ 太阳天梁 ] ， 故见煞忌亦主不利 父亲 。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳在父母宫 ， 入庙者 ， 无克 ； 更见吉 ， 童年受父 母爱护 。 曰生人更吉 。 
若太阳落陷 ， 视煞忌会合程度 ， 而定是否刑克 ， 或 不为父母所喜 。 夜生人更凶 。 
人庙见煞 ， 而太阴又与煞星同度 ， 主父母不和 。 
落陷见煞 ， 而太阴又有煞星同度 ， 主先克母 ， 或父 母因事分离 。 倘太阴无煞同 
躔 ， 则童年父运不利 。 
曰生人 ， 父母宫太阳入庙 ， 又会吉星 、 吉化 ， 则不 但童年受父母溺爱 ， 且主父 
亲境遇良好 。 夜生人减等 。 
流年太阳于 父母宫化忌 ， 不可即作刑克论 ， 煞刑交 并 ， 始主灾病 ， 若煞轻 ， 有 
时只为与父母不和 ， 产生歧见 。 又须详流曜 ， 见天煞 、 丧门 、 自虎 ， 然后始应于父 
母 ， 否则可能主与上司不和 。 
流年太阳化禄 ， 又见辅佐诸曜重重 ， 可能其克应在 于上司主管 。 
"""
        print(tmp)
        print("\n")
        if(star == "太阳巨门"):
            tmp = """太阳巨门在父母宫 ， 主父亲曾离乡安家 。 若见化 忌 、 四煞 ， 则父有灾病 ； 见吉 
化吉曜 ， 则父有事业 。 
【 太阳巨门 】 见吉化者 ，、 以服务异族为 佳 ， 主得异族 上司提拔 。 
[ 太阳巨门 ] 化忌 ， 则主与上司不和 ， 因此以自由职 业为佳 。 """
            print(tmp)
            print("\n")
        elif(star == "太阳天梁"):
            tmp = """太阳天梁守父母宫 ， 若太阳吉化 ， 则得父母荫庇 之力甚大 。 唯见辅佐吉曜过多 ， 
则反主自身欠缺父母以外之助力 。 
[ 太阳天梁 ] 在父母宫 ， 如无吉曜 ， 则虽不见煞忌 ， 亦 主父母主观 。 同时亦主与 
上司易有成见 。 
【 太阳天梁 】 以太阳化权为最吉 ， 不但可受父母荫庇 ， 且多助力 ： """
            print(tmp)
            print("\n")
        elif(star == "太阳太阴"):
            tmp = """【 太阳太阴 】 同度者 ， 一般情形下主父母和美 ， 与自 身关系亦良好 。 若太阴化 
禄 ， 则主幼年受父母溺爱 ； 太阳化禄 ， 则受父母助力 ， 或得父母之戚友提携 ； 在未 
宫者 较不利母 ， 唯在丑宫较不利父 。 
太阳太阴同度于父母宫 ， 若太阴化科见煞者 ， 占 代以为主婆媳不和 ； 太阳化科 ， 
见煞者 ， 古代以为福荫不及三代 ( 即自身之子女易破败 ) 。 此种情形 ， 今日只能参考 。 
推断与上司之人际关系 ， 以 『 太阳太阴 』 最难推断 。 若见吉 ， 则关系良好 ， 唯 
见占曜占化太多 ， 却又主自身常因对上司怀有感情 ， 以致不思独立进取 。． 见吉煞交 
集 ， 则主与自己关系良好的上司易 转换 ； 见忌 ， 则防初时关系 良好 ， 但却易因误会 
而转为恶劣 ； 见忌又同时见辅佐吉曜 ， 则此种性质尤确 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲守父母宫 ， 若不入庙 ， 又无辅佐吉曜扶持 ， 则 主刑克父母 。 亦主与上司关 
系不良 。 
若武曲入庙 ． 有辅佐吉曜及吉化 ， 则不主删克 。 与 上司 、 老板的关系则仍易疏 
离 。 
武曲守父母宫 ， 见化忌 ， 同时见煞 ， 则须参考命宫 及大运 、 流年命宫 、 父母宫 ， 
而推断其是否刑克 ， 或仅主父母事业破败 。 
凡武曲守父母宫者 ， 古人皆 主张出祀或离乡 ， 认为 因此可免刑克 。 关于此点 ， 
今日似不必认为可以克应 。 但父母对自身缺乏助力 ， 或易形成代沟 ， 则宜加以注意 。 
武曲化禄于父母宫 ， 唯于第一个大运却化为忌星 者 ， 往往主父母产业凋零 。 若 
武曲化忌 。 于第一大运化为禄星者 ， 则主父母灾病 。 
武曲化忌 ， 最忌羊陀夹 、 火铃夹 ， 主父母灾病 ， 或 有极大破败 。 
武曲在父母宫 ， 更与羊陀 、 火铃 、 空劫 、 刑耗诸曜同会者 ， 少年时父母必不利 。 
流年大运父母宫见此种星系 ， 亦防父母突生灾病或事业破败 。 甚至父母富有武曲化 
忌对冲 ， 亦有此种情况 。 
唯武曲化忌 ， 天厨 、 火 星同度者 ， 往往又主父母所业者带煞气 ， 如饮食业之类 。 
不见天厨 ， 亦为操利器行业 。 如外科医生 、 理发之类 。 其职业贵贱 ， 视有无辅佐吉 
曜同会而定 。 
"""
        print(tmp)
        print("\n")
        if(star == "武曲天府"):
            tmp = """武曲天府的组合 ， 最为有利 。 无煞忌刑耗 ， 则不 主刑克 。 若煞轻 ， 有天寿同宫 ， 
亦不主刑克 。
[ 武曲天府 ] 会廉贞化忌 ， 则主父子参商 。 会刑忌夹 的 [ 紫微天相 ] ， 亦然 ； 或主 
受上司的压力 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲贪狼"):
            tmp = """[ 武曲贪狼 ] 与火铃同度 ， 主克 ； 亦主与上司关系有 突然变化 ， 权利纠纷 ， 凶终 
隙末 。 若武曲化忌则亦主父母横破 。 
[ 武曲贪狼 ] 而贪狼化禄 ， 则主上司提携 ， 唯有煞 ， 则 仍主始终关系变劣 。 
武曲天相见财荫夹 ， 主得父荫 ， 亦主得上司提携 助力 ； 刑忌夹者 ， 则主刑克 ， 
亦主受上司忌才 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲天相"):
            tmp = """[ 武曲天相 ] 亦不喜火铃夹 、 羊陀夹 ， 主刑克 ； 亦主 受上司排挤 ， 或多争吵 、 误 
会 。 """
            print(tmp)
            print("\n")
        elif(star == "武曲七杀"):
            tmp = """武曲 七 杀基本亦主刑克 ， 见煞忌者尤甚 。 若无煞 ， 反见吉化 、 吉曜 ， 则仅主关 
系疏离 。 亦不喜见火星同度 ， 再会桃花 ， 则主自身为外室或庶室生子 。"""
            print(tmp)
            print("\n")
        elif(star == "武曲破军"):
            tmp = """【 武曲破军 】 刑克亦重 ， 与武杀大致相若 。 凡武 破 、 [ 武杀 ] 在父母宫者 ， 亦主 
时时转换工作 。 
[ 武曲破军 J 而武曲化忌 ， 则极可能为父母产业暴破 暴败 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同为带感情 的星曜 。 入庙 ， 则主两代相洽 ， 亦不 见刑克 。 唯落陷时 ， 则仍多 
意见不和 。 
天同化忌 _ 若煞重 ， 仍主伤心流泪 。 须详大运及流 年父母宫而定其不利性质 。 
天同与擎羊同度 ， 则主受上司压力 ， 以致不和 。 陀 罗同度 ， 见刑忌者 ， 主受上 
司牵累 ； 火铃同度 ， 时时变换上司 。 
天同化禄 ， 唯与天梁同度或对拱者 ， 始主受父母荫 庇 ， 否则反主父母于自己童 
年时出外谋生 。 
天同火星 ， 亦主幼年离开父母 。  
天同与煞忌刑曜同会 ， 又有吉曜或吉化者 ， 尤其是 天同化禄 ， 往往主父母产业 
虽丰 ， 但得不到手 。 
天同与天梁相对者 ， 亦不宜与天马同度 ， 否则主分 离 ， 火铃同度者尤甚 。 亦主 
退尽祖业 。 
天同与卯宫太阴相对 ， 不如酉宫太阴 ， 此项克应 ， 指与父母或上司关系而言 。 
天同躔昌曲 、 桃花 ， 主父有外遇 ， 或主自身为偏房 继室所生 。 
天同与左辅右弼 ， 或天魁天钺同会 ， 以见齐对星始 吉 ， 见单星者 ， 主父母两次 
婚姻 ， 不必见煞已然 。 
天同守父母宫 ， 流年不宜廉化忌 ， 若父母宫见昌及 煞曜 ( 或命宫见昌曲 、 父母宫 
见煞 ) ， 当主孝服 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """天同在辰戌二宫 ， 最嫌对宫巨门化忌 ， 主父子参商 。 亦主与上司不和 。 """
            print(tmp)
            print("\n")
        if(star == "天同太阴"):
            tmp = """[ 天同太阴 ] ， 基本星系性质主感情丰富 ， 唯若与刑 忌煞耗诸曜同会者 ， 则亦主 
刑克分离 。 最不喜太阴化忌 ， 亦父母不全 。 
[ 天同太阴 ] 吉化 ， 则无刑克 。 吉化而煞重者 ， 仍主 不和 。 亦主与上司参商 。"""
            print(tmp)
            print("\n")
        elif(star == "天同巨门"):
            tmp = """[ 同巨门 ] 居父母宫 ， 性质最为不良 ， 主父子不和 。 化忌者尤甚 。 
天同巨门与天巫同度 ， 刑煞重 ， 而见化禄同会者 ， 主父母遗产引起争夺 。 
天同巨门与火铃同度 ， 主少年重拜父母 。 若桃花 诸曜重重 ， 则主为偏房继室所 
生 ； 见辅佐单星 ， 决主两重父母 。"""
            print(tmp)
            print("\n")
        elif(star == "天同天梁"):
            tmp = """天同天梁同度者 ， 则父母婚姻有波折 ， 以曾解除 婚约者 ， 父母始白头偕老 。 见 
桃花诸曜 ， 父有外遇 。 
[ 天同天梁 ] 与天马同度 ， 主父母须离乡背井 。 更见 火铃 ， 则主飘流 。 此种星 
曜性质 ， 有时又主父亲所业者带流动色彩 。 
[ 天同天梁 ] ． 而天梁化科者 ， 一般情形下主利父不利 母 。 更见煞 ， 主刑克 。"""
            print(tmp)
            print("\n")
        
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞在父母宫 ， 由于其为带感情及血缘的星曜 ， 所 以性质相当复杂 。 尤其是当 
廉贞化禄或化忌之时 ， 性质异常敏感 ， 所以须小心推断 。 
廉贞化禄 ， 一般主不刑克 ， 或感情融洽 。 唯此时太 阳必同时化忌 ， 基本性质不 
利父母 ， 故此时必须详视太阳 、 太阴所同会的星曜 ( 不论在何宫垣 ) ， 及父母宫廉贞 
所同会 的星曜 ， 然后始能作 出推断 。 
廉贞化忌 ， 一般主不利父母 ， 或刑克 、 或生离 、 或感情不融洽 。 须见太阳 、 太 
阴同会星曜而定 。 
若廉贞化忌 ， 与火铃 、 羊陀 、 空劫 、 天刑 、 天伤等 星曜同会者 ， 一般主刑克 。 
若廉贞化忌 ， 与火星同度 ， 或与天马 、 天虚同度 ， 主远离父母 。 
若廉贞化忌 ， 与铃星同度 ， 或与杀 、 破 、 狼同度而 无吉 ， 且见虚 、 耗 、 刑 、 伤 
者 ， 则宜出祀 、 过继 ， 两重父母 。 
廉贞与昌曲 、 桃花诸曜同宫或会照 ， 则主为偏房继 室所生 ， 或上代阴盛阳衰 ， 
或父有外遇 。 见辅佐对星带单星者 ， 则决主父有外遇 ； 见昌曲化忌 ， 决主偏房继室 
所生 。 
廉贞化忌 ， 桃花诸曜毕集 ， 主父母婚姻情况复杂 。 
凡廉贞带桃花者 ， 宜从事以异性为 顾 客对象的行 业 ， 或带精神享受色彩的行业 。  
若廉贞化忌会武曲化忌于父母宫 ， 主父母是年有 病症或死亡 。 一若武曲据父母 
宫而会廉贞化忌 ， 则有为父母破败 。 断上司关系 ， 则可能为遭上司解雇 。 
廉贞与流昌流曲相会 ， 昌曲化忌 ， 则亦为不利父 的星系结构 。 一一有时此克应 
亦在流年命宫或小限出堋 
"""
        print(tmp)
        print("\n")
        if(star == "廉贞天相"):
            tmp = """[ 廉贞天相 ] 逢财荫夹者 ， 主有父母荫庇 ； 逢刑忌夹 者 ， 则主刑克或感情破裂 。 
若刑忌夹印而廉贞本身化忌 ， 则于该流年或大运 ， 主父母刑伤 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞天府"):
            tmp = """[ 廉贞天府 ] 为最稳定结构 ， 不主刑克 ， 见吉曜且主 感情和美 。 
若 [ 廉府 ] 而府库空露者 ， 则亦主两代感情不和 。 或 有父荫而未得克享 。 
廉贞人流年父母宫 ， 与杀 、 破 、 狼同会 ， 更见煞忌 刑耗交侵 ， 则主妨父母 。 尤 
不喜流年白虎与流羊相会于流年父母宫 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞七杀"):
            tmp = """[ 廉杀 ] 、 [ 廉破 ] 、 [ 廉贪 ] ， 基本性质亦主刑 伤 。 化忌见煞者更甚 。 若廉贞化禄 ， 
又见吉曜 ， 则可以化解 ， 以与父母远离为宜 。 在古代 ， 认为宜重拜父母 ， 过继出祀 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞破军"):
            tmp = """[ 廉杀 ] 、 [ 廉破 ] 、 [ 廉贪 ] ， 基本性质亦主刑 伤 。 化忌见煞者更甚 。 若廉贞化禄 ， 
又见吉曜 ， 则可以化解 ， 以与父母远离为宜 。 在古代 ， 认为宜重拜父母 ， 过继出祀 。"""
            print(tmp)
            print("\n")
        elif(star == "廉贞贪狼"):
            tmp = """[ 廉杀 ] 、 [ 廉破 ] 、 [ 廉贪 ] ， 基本性质亦主刑 伤 。 化忌见煞者更甚 。 若廉贞化禄 ， 
又见吉曜 ， 则可以化解 ， 以与父母远离为宜 。 在古代 ， 认为宜重拜父母 ， 过继出祀 。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守父母宫 ， 一般情形主父母双全 。 仅于府库 空露的情形下 ， 始有刑克 ， 或 
主 不克享父荫 。 
天府与擎羊同度 ， 主两代不和 。 与陀罗同会 ， 主有 刑克 。 见天刑者更重 。 
天府与火 、 铃同度 ， 主生离 。 见天刑者 ， 少年时父 母不全 。 
天府与空劫同度 ， 主重拜父母 。 
天 府禄存同度 ， 见煞 ， 主父子参商 。 又主父母喜独掌财权 。 
天府与化禄同度或对拱 ， 以武曲化禄最宜 ， 则父母 财荫颇厚 。 见天巫同度 ， 或 
天巫在命宫 、 财帛宫者 ， 主父母遗产丰厚 。 
唯流年父母宫天府 ， 忽见重重化禄或禄存冲会者 ， 乃须防丧服之应 。 
天府与廉贞化忌对冲 ， 更见煞者 ， 主父母不全 。 与 武曲化忌对冲 ， 则 或为刑克 ； 
或为父母事业崩败 。 
天府化科 ， 主无刑克 。 若太阳同时在庙旺宫垣化禄 ， 主得父亲荫庇之力 ； 
天府得百官朝拱 ， 必须见对星 ， 不喜对星带单星 ， 主两重父母 ， 或自身为偏房 
继室所生 。 
天府与桃花同躔 ， 见昌曲单星 ， 主父有外遇 。
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守父母宫 ， 一般不主刑克 。 倘太阴入庙 ， 即使 见煞 ， 往往亦仅主生离 。 
太阴落陷则不利母 。 倘仅躔火 、 铃 ， 则只主分离 。 若煞重 ， 则防刑克 。 
太阴独坐更不宜落陷 。 轻则主幼年狐独 ， 不为母亲 疼爱 。 重则远离父母 ， 或刑 
伤生母 。 
太阴擎羊同度 ， 主与母亲 缘份浅 ， 落陷更甚 。 
太阴陀罗同度 ， 主与母亲不和 ， 各怀成见 ， 亦落陷 者更甚 。 
太阴与天马 、 天虚同度 ， 不见火铃亦主远离父母 。 见火铃 ， 少幼时父母及自身 
星散 。 倘更见单星 ， 往往主过醚或祀出 。 
太阴与天梁 、 天寿相会 ， 则虽落陷化忌 ， 亦仅主灾 病 ， 不主刑克 。  
太阴化权 、 化科于父母宫 ， 盘中太阳无力 ( 如不会 化吉曜 ) ， 则幼年母代父职 ， 
或母亲持家 。 若太阴在巳 ， 往往为父亲离家或死亡之应 。 
流年父母宫太阴曾煞刑白虎 ， 母氏有伤 。 
太阴化忌见羊陀 ， 更见文曲 ， 主有人进谗 ， 以致与 父母或上司不和 。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """卯酉宫太阴 ， 见天同化忌 ， 主父母事业破败 ； 见天 同化禄 ， 则亦不主克享父荫 ， 
盖天同对父母宫的影响 ， 其基本意义为自立 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰宫太阴落陷 ， 刑克较重 ， 戌宫入庙 ， 见煞亦仅主 与父母无缘 。 唯辰戌太阴父 
母宫 ， 皆不宜化忌 ， 主幼年刑克 。  """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """
巳亥 宫太阴 ， 巳宫主刑克分离 ， 亥宫则不是 。 唯若 于亥宫化忌者 ， 幼年亦主克父 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼在父母宫 ， 必须入庙始无事端 。 不入庙 ， 则虽 见辅佐吉化 ， 亦无全美 。 
贪狼与桃花诸曜同度 ， 见天虚 、 天刑 ， 主自身为继 室偏房所生 。 更见煞 ， 主有 
刑克 。 
贪狼化忌 ， 主早年离开父 母 ， 更见刑煞诸曜 ， 主有刑克 。 
贪狼落陷 ， 天马同宫或对拱 ， 主远离 。 有桃花 ， 亦主两重父母 ， 或为偏房继室 
所生 。 
贪狼同会辅佐单星 ， 亦主两重父母 。 更见煞 ， 父母婚姻情况复杂 。 
贪狼化禄 ， 可补落陷之缺憾 。 纵落陷见煞亦不主刑克 ， 仅主生离 。 若入庙化禄 ， 
则决无刑克 。 但仍不宜见辅佐单星 。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """ 贪狼在子午 ， 火铃同度则主幼少离开父母 。 见桃花 ， 父有外室 。 或自身为外室 
所生 。 """
            print(tmp)
            print("\n")
        
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """贪狼在寅申二宫 ， 有煞主刑克 ， 若见空劫 、 天刑 、 天虚 、 天伤 ， 则与父母中道 
分张 。  """
            print(tmp)
            print("\n")
        
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """ 贪狼在辰戌宫独坐 ， 对宫武曲化忌 ， 有火铃 、 空 劫 、 父业突生崩败 。 
贪狼若与武曲化禄相拱 ， 则父业峥嵘 ， 见辅佐诸曜 尤吉 。 唯若同时见桃花 ， 则 
父亲有外宠 。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """贪狼在巳亥宫落陷 ， 廉贞同度 ， 见煞主刑 ， 或离父 母 。 天马火星同度者更甚 。 
昌曲同躔 ， 父有外宠 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门于父母宫为恶曜 。 必须无煞忌 ， 然后始主全美 。 否则纵使化禄 ， 亦仅主父业 
丰厚 ， 刑克或不和仍难避免 。 
巨门落陷 ， 见煞曜 、 天刑 ， 父母不全 。 
巨门与天同同度或相对 ， 火铃同躔 ， 则主父母子女 参商 。 见桃花诸曜 ， 父母婚 
姻复杂 。 见辅佐单星 ， 父母别有恋情 。 
巨门天同的星系结构不利父母 。 除前述外 ， 尚有不 能克享父业的意味 。 见煞 ， 
天同无吉化 ， 为祖业消退 ； 又见空劫 ， 天刑 ， 则祖产为人所夺 。 
巨门与天机同度或相对 ， 古人认为乃重拜父母 ， 二 姓延生之兆 。 其实若不见煞 ， 
仅主寄宿或寄养 ， 不主二姓 。 煞忌空劫刑耗重重 ， 则为刑克或生离之兆 。 
巨门化禄 、 化权 ， 仅主减少克害程度 。 唯若叠禄 ， 始主父业丰厚 。 
流年父母宫巨门化忌 ， 有煞 ， 主与上司不和 ， 亦主 以异族为上司主管 。
"""
        print(tmp)
        print("\n")
        if(star == "巨门天机"):
            tmp = """巨门天机的星系结构最为不吉 ， 克害程度最大 。 若 煞轻 ， 则仅为少小离开父母 。
如父母因工作无暇照拂 ， 将自己托养于人之类 。 """
            print(tmp)
            print("\n")
        elif(star == "巨门太阳"):
            tmp = """巨门太阳的结构 ， 一般情形下主父子不和 。 若见吉 化 ， 则主父母离乡别井 。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守父母宫 ， 对辅佐诸星特殊敏感 ， 若见昌曲夹 、 魁钺夹 、 左右夹者 ， 甚可 
能有两重父母 ， 或不只一母 。 若更见单星同度或对拱者尤确 。 
天相为火铃夹 ， 主远离父母 ， 见天马尤确 。 若火铃 夹而有辅佐单星同度或对拱 
者 ， 亦主两母 。 
天相与昌曲 、 桃花诸曜同度及会合者 ， 主不只一母 ( 在现代亦可能不只一父 ) 。 
天相最不喜与武曲同度或对拱 ， 主少年不利父母 。 武曲化忌 ， 父母多灾病 。 
天相与廉贞同度或对拱 ， 有羊陀 夹 、 火铃夹者 ， 主 刑克或远离 。 无煞夹 ， 但见 
辅佐单星 ， 更有桃花 ， 主两母 。 纵无桃花 ， 在现代每主有两重上司主管 。 
天相最喜见魁钺 、 左右 ， 亦喜见天官 、 天福 、 天贵 、 解神 、 天德 、 龙德 、 天巫 、 
长生诸曜 ， 则与父母和美 。 亦主易受主管提拔 。 
天相与火铃 、 羊陀 、 空劫 、 天刑 、 天伤同会 ， 则主 父母有刑克 。 
倘见煞忌 ， 又见辅佐单星 ， 则须详太阴 、 太阳之庙 旺而定其父母情况 。 可能为 
一亲早丧 ， 一亲另行婚嫁 。 
流年天相与廉贞化忌或武曲化忌同会 ， 又见昌曲及 流煞重重冲会 ， 则主有孝服 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为寿星 ， 又为荫 星 ， 在父母宫入庙 ， 无煞 ， 或 煞不重者 ， 主父母双全 。 
倘入庙无煞 ， 而有吉曜吉化会合 ， 则主必得父母福 荫 。 见天巫及禄 ， 主父母有 
遗产 ， 或继承父母事业 。 
天梁落陷 ， 主有刑克 。 见煞忌者尤确 。 古人认为 ， 过继或出祀者可免 。 在现代 ， 
往往主远离即可避免 。 
天梁与天马 、 擎羊同度 ， 主离家 。 或主入赘 ， 或主 供养岳家而与父母疏离 。 
天梁喜见天同同度或对拱 ， 唯天同化 忌或与四煞空劫刑伤同会者 ， 则主两代意 
见参商 。 或主过继出祀 。 
父母宫天梁 ， 与命宫一见火星 、 一见铃星者 ， 则为 重拜父母之兆 ， 或入赘 ， 或 
瞻养岳家而 不瞻养父母 。 
太阳入庙拱照天梁 ， 主和美 。 若太阳落陷 ， 又有空 劫 、 天刑 ， 则主代沟 。 或主 
与上司严重不和 。 
太阳落陷与天梁同度或对拱 ， 吉煞诸曜混杂者 ， 不 主刑克 ， 唯主无父母荫庇 ， 
或父母主观 ， 以致自身感到孤业 。 
流年太阳化忌照天梁 ， 又有昌曲及流煞冲会者 ， 若 见白虎丧门入限 ， 主孝服 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七 杀于父母宫并非善曜 ， 即使入庙 ， 亦与父母关系 疏远 。 尤不喜与武曲或廉贞 
同度 。 
七杀与紫微同度 ， 有吉曜者 ， 不主刑克 ， 唯主父母 极度主观 。 若无吉曜 ， 但有 
刑煞忌者 ， 则仍主刑克 ， 或不和 ， 或远离 。 
七杀守父母宫 ， 煞轻者 ， 主有代沟 。 亦主与上司不 和 。 
七 杀不喜会孤辰 、 寡宿 ， 否则主孤 。 亦主与上司关 系疏远 。 
七 杀对拱 [ 紫微天府 ] ， 见煞 ， 或见辅佐单星 ， 主有 两重父母 。 
七杀会紫微化权 ， 父母成见极深 。 
七杀会紫微化科 ， 又见吉曜 ， 父母有声誉 。 但两代 关系未必相谐 。 
七杀与火铃同度 ， 或会天马 ， 主远离父母 ， 且远离 之性质不良 。 
七杀不喜见武曲化忌 、 廉贞化忌 ， 若再见凶煞恶曜 ， 主父母刑伤 ， 或事业倾败 ， 
或恶疾缠身 ， 详所会杂曜丽守 
七 杀不与恶曜同度 ． 但却会煞三合宫 ， 且见武 曲化禄 者 ， 主父母任武职 ， 或牙 
医 、 外科医生之类 ( 持利器 以求财 ) 。 
七 杀得禄 、 权 、 科会 ， 主得父母荫庇之力 。 见天巫 主得遗产 ， 或继承父母事业 。 
流年 七 杀守父母宫 ， 见流煞冲会 ， 又见化忌者 ， 须 防孝服 。 
"""
        print(tmp)
        print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守父母宫 ， 基本性质不忍受 ， 稍见煞即主远离 ， 煞重则主刑克 。 
破军与火星 、 铃星同度 ， 尤 主远离 。 火铃二星一 居父母宫 ， 一居命宫 ， 主与 
父母关系疏离 。 见孤辰 、 寡宿 ， 尤主幼年即远离父母 。 
破军独坐于父母宫 ， 基本性质孤独 。 亦主跟上司关 系疏远 ， 故有时亦主时时变 
换工作 。 唯见辅佐对星者 ， 则可 以调和关系 。 
破军与擎羊 、 陀罗 、 空劫 、 天刑 、 天伤 、 天虚等同 度 ， 主刑克 。 古人认为宜 
重拜父母 ， 二姓延生 。 在现代 ， 可能为离家后再难与父母相聚 ， 唯却与岳家相处 。 
破军与忌星相会 ， 多主 刑 克 ， 若更见羊陀交并者尤 确 。 以论上司关系 ， 则主终 
身难得长上提携 ， 且亦为上司夺功 。 
破军化禄 ， 则父母和美 ， 更见辅佐吉曜者尤佳 。 
破军化权 ， 绝不宜羊陀同 宫 ， 否则主父子关系不和 ， 或与上司不和 。 
破军与辅佐单星 ， 见桃花 诸 曜 ， 主两母 。 见化忌 ， 则生母刑伤 。 
破军守流年父母宫 ， 有辅弼单星同度 ， 流煞飞入 ， 主父母病重 。 亦主与上司结 
怨 。 
破军守流年父母 宫 ， 见武曲化忌或廉贞化忌 ， 有流 昌流曲 ， 亦主孝服 。 若无流 
昌流曲者 ， 则以见火铃羊陀为然 。
"""
        print(tmp)
        print("\n")


