def GongChu1st(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """ 
紫微独坐除喜[百官朝拱]外，更喜左辅右弼夹命，文昌文曲夹命；龙池凤阁夹
命，可以增加气势，减少辛劳。 
若为在野孤君，更见天空、地空等空曜，则宜追寻哲理，成为宗教人物，亦可
成为领导人才。遇华盖，宗教信仰更深，且喜探索神秘事物。 
紫微独坐而辅、佐、煞、化诸曜并见之时，须详各星曜的多寡以及力量而定其
吉凶。一般来说，多主人理想高而行动力量不足，后天补救，注意努力寻求理想的
实现。 
倘如无吉曜会合，只逢煞曜，则容易觉得怀才不遇，宜于经商。只要煞曜入庙，
而且碰到的煞曜不多，仍能经商致富。最好是能与化禄或禄存会合，则致富之外且
有相当社会地位，尤其是在商业社会，更易发展。若从事政治、文教，则反多蹭蹬
坎坷。 
煞曜重，一般皆主纠纷是非。尤其是碰到落陷的擎羊，更主词讼，或外科手术。
紫微独坐，亦喜化权、化科。化权能增加人的领导力及竞争力，化科则有声誉，
宜从事学术研究，可融汇百家而有所创造，但皆令人的主观更强，不易接受别人的
意见。 
唯紫微见一二点煞忌等曜，却主为人耳朵软，易听谗言是非。 
凡紫微独坐，对宮必见贪狼，亦主人好色，见桃花诸曜会合更甚，唯同时会合
天刑，则主人能自律；见陀罗，则亦可自制。 
大限流年在紫微独坐的宮限，须详会合的星曜而定吉凶。见吉则职位升迁，商

务发展，福禄皆厚，若逢空劫、耙星则主经济困难或破财；见煞曜相会，主纠纷，
在商或致停业，在职则有降黜之虞。"""
        print(tmp)
        print("\n")
        tmp = """ 
        星曜名称 紫微
        归类 帝星
        属性 土／气
        振动形态：集中往高处、底盘稳定
        在人
        精神领袖、天气预报主持人、高层领导、小资情调的人、预测师、分析师、策划总监、投资人、导师、佼佼者、竞选冠军、设计师、咨询师、理发师、导游、组织委员、高空项目陪练、飞行员、工程师、站在高处的人、塔吊师、专家、董事长、航空业人员、宇航员、管理者
        在事
        高楼、宾馆、公寓、别墅、贵宾室、土坡、珠宝、装饰、奢侈品、气象局、政府机关部门、精致的物品、头、脾胃、高山、高端品牌、山、北极星、楼梯、楼层、台阶、极限运动设备、飞机、鸟、兔子、龙猫、松 鼠、青蛙、弹涂鱼
        在物
        宗教信仰、大的事业、高端局、升级、提高、扩大、预测、装修、砌墙、 爬山、组织活动、毕业、通过考试、登高、攀岩、爬楼梯、高空极限运 动、盖楼、封顶、摸头、跳高、仰视、俯视、站中间、逛商场、乘坐电梯、盘头发、拍卖、竞赛在观感稳重厚实的、有实力的、明智的、有先见之明的、容纳性强的、高大的、 高瞻远瞩的、高端的、高档的、在高处、给人引导的、头上的、领头的、 中心的、自尊心强的、好面子的、具有装饰性的、高不可攀的"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午宫独坐
紫微独坐，子宫不如午宫，因为在午宫时人庙，领导力以及制化调和之力皆较
子宫独坐为大，所以地位和财富均较优胜。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 紫微贪狼
            属性 土＋水＋木
            在人
            高级客户经理、金融预测分析师、舞蹈演员、演员、杂技演员、公关、高级酒水代理、时尚达人、名媛、上流社交活跃的人、投资人、国家外交官、竞赛冠军、竞标的人、竞拍的人
            在物
            滑梯、水上乐园、大型动物、巨型犬、高级酒水、高级茶叶、高级社交场合、赛事现场、拍品、滑翔伞、恐龙、龙、巨蟒、大蛇、眼镜王蛇、大舌头、长舌、昂贵的宠物、贵宾犬、蜜袋籍、电梯、渔具
            在事
            竞拍、竞赛、预测金融分析、在高处的动物、滑翔、玩滑梯、在水上乐园、看杂技表演、看画展、画画、宠物美容、宠物竞赛、钓鱼、参加酒会、看舞蹈表演、高空杂技表演、形体课、走台步、国标舞、钢管舞
            在观感
            高处滑行、高级情商、在高空柔软的、曲线往中间的
            """
            print(tmp)
        if(len(star) == 4):
            if(star == "紫薇破军"):
                print("紫薇破军\n")
                tmp = """ 
        但当破军化权的时候，破军的变动力增加，因而人生，便更多变化。若见左辅、
        右弼会合，则能减少辛劳，倘遇四煞，则只宜经商，并须注意经营具创新性质的行
        业。 
        如果破军化禄，则于开创的同时亦有进财的机遇，使人的物质生活富足，以补
        偿所付了的辛劳。可是与此同时，却易多感情困扰，而且使人偏于肉欲享受。因为
        这时在巳宫会合的廉贞贪狼，亦易因破军化禄的会合而发挥作用。 
        无论破军化权抑或化禄，均可令此格局的人富贵。但若同时会合四煞刑忌诸曜，
        则虽富足却招是非口舌。见擎羊、天刑、化忌，且易兴爭讼。宜从事武职或法律界，
        及为适合。 
        紫微破军的星系既主变动，所以经商者须注意不时出魂的机遇，而且有同时经
        营两三种关系行和可能。若是雇员，则主兼差、兼职，或多超时工作，但必独当一
        面。 
        紫破坐命，主人耿直。但若逢华盖，则宜研究宗教或哲理。 
        不过，由于其人多思虑、多变动，而且福德宮的天府又主思虑周密，所以当会
        煞曜空曜之吋，有时又会表现得自私。一一古人说：[紫微破军，为臣不忠，为子不
        孝]；又说[紫破同宫无左右，无占曜，凶恶胥吏之徒]，即是指出其自私的本性，及
        其好思虑以自肥的倾向。但只须有占曜会合，这些不良的性格就可得减轻甚至消除。
        大限流年逢紫微破军，主去旧更新。得吉曜会合，自然变动吉利，若见煞曜，
        则宜三思，不可仓卒变动。倘吉曜煞曜并集，应视下一运限之吉以定行止。"""
                print(tmp)
                print("\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp == """紫微坐丑、未两宫，皆有破军同度。这是一个很有开创力的星系结构。破军本
        已为先锋战将之材，得紫微蜒占身驾驭，破坏力因之减少，创造力却相对增加。虽
        人生不免辛劳，但由于其人富领导力，有决断力，故亦主历辛劳而有成。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                星曜组合 紫微破军天相
                属性 土＋水＋水
                在人
                游泳冠军、模特、广告代言人、演员、艺术团团长、二手奢侈品回收商、高级研究员、空姐、空乘、整形师、个子高的人、高级工程师、装修师傅、画家、冲浪的人、国家机要任务人员、国家间谍、典当人员、设计师、摄影摄像师、高级科研人员、跳水运动员。脑科医生、旅行家、高空坠落的人
                在物
                二手奢侈品、高级护肤品、高级化妆品、香水、高的浪、喷泉、海滩悬崖、典当行、设计感的作品、火箭、电梯、高处的泳池、 vip 通道、水上飞行器、双子塔、空中走廊、廊桥
                在事
                回收奢侈品、小资情调拍摄、录制广告、看模特表演、看剧、高级艺术表演、国画作画、拍卖、设计、整形、美容美发、装修、高级会议、摄影摄像、拍摄高级广告、拍摄国家宣传片
                在观感
                高级又表面的、注重外表的、高雅艺术感的、高处的通道
                """
                    print(tmp)
            elif(star == "紫薇天府"):
                print("紫薇天府\n")
                tmp = """
        紫府同宫时，紫微若化权或化科，则紫微的力暈轨大，气派亦大；倘天府化科，
        则仅倾向于信诺，有一言九鼎的美德，可是反而显得过份恭俭纯良，欠缺领导与一
        切从实际开创的能力。 
        这种星系结构，最宜见[禄马交驰]来会，主富贵双全；其次为[禄文拱命]，即
        禄存或化禄，与文昌文曲同全，亦主富贵；再次则为辅、佐诸曜会合，主贵而不主富。 
        若辅佐诸曜不会，而火、铃、羊、陀四煞并见．则反主为人外忠诚而内刁诈，
        多兴背面是非。更逢空曜，或落空亡，则更为人孤独，庸碌度日。 
        女命紫微天府，若福德宮贪狼会合红鸾、天喜、咸池、天姚等桃花诸曜，宜重
        视感情生活；若命宫煞刑诸曜毕集，则只宜继室，或由于孤芳自赏而终身不婚。 
        大限流年命宮见紫微、天府，比较在星盘的命宫吋为吉利，主得贵人助力，有
        突发性的表现。倘更见天魁、天钺，或流魁、流钺，则能因政制命令的改变，或企
        业制度的改变而得益。在商者亦多不求自得的幸运际遇。"""
                print(tmp)
                print("\n")

                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """紫微天府二曜，在寅、申二宫同度。紫微力北斗主星，性宜开创；天府为南斗
        主星，性利保守，所以两颗主星相遇，不但有[一山不能藏二虎]的冲突，而蛙性质
        互相牵制，反而难以发挥。一般来说，仅主其人清高。甚至有可能发展为孤芳自赏。
        这种星系结构，最宜教育事业，出任公职亦可，不宜从商，否则进退失据，常常坐
        失机缘，又或者弄巧反拙。 """
                    print(tmp)
                    print("\n")
                    tmp = """
        星曜组合 紫微七杀天府
        属性 土＋火
        在人
        经常暴怒的人、烟花爆竹厂商、会展从业人员、房地产开发从业人员、政客、校长、集团公司董事长、董事长秘书、百货商场管理、奢侈品店柜姐、空乘、机长、航空从业人员、鸟类养殖人员、猎人、跑酷运动员、吊威亚特效师、古装武侠演员、政府高官、高级领导、专家、班干部、队长、团长、导游、艺术品／古玩收藏家、拍卖主持人、古董商、瓷器商、发型师、装修师傅
        在物
        鹰、鸟、烟花、爆竹、百货公司、商场、火山、射击场、武侠剧、塔吊、高楼、公寓、别墅、城堡、弓箭、火箭、弹射装置、炮弹、飞机、飞行器、国家内务、瞭望台、城墙、地图模型、地形图、艺术藏品、画作、装饰品、瓷器、降落伞、爬梯、逃生装置、贵宾室
        在事
        跑酷、爬山、跳楼、爬楼、坐飞机、观看火箭、乘坐火箭、发射炮弹、射击、观看火山、逛商场、爬梯、 homeparty 、观看武侠剧、看武侠小说、打仙侠游戏、养鸟、逛鸟市、被鸟啄、打猎、开会、政治会议、国家党政事项、站在城墙上、站在塔上、观星、看云朵、探讨战术策略、画展、看展、拍卖会、翼装飞行、速降、打理头发
        在观感
        从下往上俯冲、从某个角度发射、往中间高处集中、在高处瞭望、重要的位置、一个队伍的最高领导人、提升指导、厚积薄发、俯视
                    """
                    print(tmp)
            elif(star == "紫薇贪狼"):
                print("紫薇贪狼\n")
                tmp = """
        若紫微化权，得[百官朝拱]，则有如太平盛世的风流天子，富贵多情；紫微化科
        会吉曜，则其入虽克享盛名，学而有成，但仍偏重于情欲及物欲。 
        如果贪狼化禄，则主多交际应酬，偏重物欲，但却主其人财运亨通；贪狼化权，
        物欲亦重，但主经历竞争而有成；贪狼化忌，虽桃花减色，可是人的才艺却亦较难
        发展。虽有物欲，却难如愿。 
        紫贪星系，喜左辅、右弼同宫，而不喜文昌文曲。若昌曲同宫，其人吸引异性
        的倾向更大，而且重视修饰以及事情的表面完美，所以做事便多虛少实。但如果左
        辅与文昌，或右弼与文曲夹命宫，则反易发挥才志，事业有成。――古人所说的[左
        右昌曲夹制]，依[中州派]的意见，是指[交叉夹命宫]而言，因为紫贪永无左右夹命、
        昌曲夹命的可能。 
        紫贪见煞，只宜经商，但煞重亦有是非纷争。若更见空曜及华盖，反宜宗教生
        涯。 
        女命紫微贪狼，见桃花及煞曜，易落风尘，尤其不喜见擎羊，若桃花诸曜咸集，
        堕落风尘的危险更大。同时有因追求物欲而堕落的倾向。但假如酉宮坐命，借入卯
        宫的紫同(图三)，此点宜加注意。 
        大限或流年命宫见紫微贪狼，桃花的性质较会星盘命宫时为轻。一般来说，会
        吉曜时，主小幅度的去旧更，可得进步；但如果诸煞并集，又见刑忌，则可能进步；
        但如果诸煞并集，又见型忌，则可能因色破财招灾，又或者因应酬而招口舌是非。"""
                print(tmp)
                print("\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """紫微贪狼在卯、西二宮同度，古人称这种格局为[桃花犯主]，认为主人淫乱。
        所以逢紫贪同宫，最不宜再见红驾、天喜、咸池、大耗、天姚、沐浴等桃花诸曜，
        否则主人易吸引异性而不能自制，倘再逢煞曜，主因色致祸，即使不逢煞曜，亦影
        响事业。 """
                    print(tmp)
                    print("\n")
                    tmp = """
        星曜组合 紫微贪狼
        属性 土＋水＋木
        在人
        高级客户经理、金融预测分析师、舞蹈演员、演员、杂技演员、公关、高级酒水代理、时尚达人、名媛、上流社交活跃的人、投资人、国家外交官、竞赛冠军、竞标的人、竞拍的人
        在物
        滑梯、水上乐园、大型动物、巨型犬、高级酒水、高级茶叶、高级社交场合、赛事现场、拍品、滑翔伞、恐龙、龙、巨蟒、大蛇、眼镜王蛇、大舌头、长舌、昂贵的宠物、贵宾犬、蜜袋籍、电梯、渔具
        在事
        竞拍、竞赛、预测金融分析、在高处的动物、滑翔、玩滑梯、在水上乐园、看杂技表演、看画展、画画、宠物美容、宠物竞赛、钓鱼、参加酒会、看舞蹈表演、高空杂技表演、形体课、走台步、国标舞、钢管舞
        在观感
        高处滑行、高级情商、在高空柔软的、曲线往中间的
            """
                    print(tmp)
            elif(star == "紫薇天相"):
                print("紫薇天相\n")
                tmp = """ 
        紫相星系，最喜得禄存会照，主人能富，唯主观成见极深，且好争权，易受人排
        挤。若无禄存，而紫微化权，则爭权之心更为激烈；倘若化科，则争权之心虽然稍
        減，可是自尊心与名誉慼却更重，仍易遭旁人之忌。 
        倘如不遇禄、权、科，则此星系仍喜得[百官朝拱]，而不喜煞忌会合，得左辅、
        右弼、文昌、文曲会照，仍能事业有成，为领导人物，而且温和敦厚。但因破军在
        封宫的影响，人生中必仍须经过一次波折。 
        若不见吉曜，而四煞会合，则以擎羊、陀罗为较佳，适宜从商。若见火星、铃
        星，便因费耗紫微化解之力，而增了辛劳与艰苦。假如见火铃再见空劫、天刑，则
        可能遭逢不幸，以致精神受刺激，或心脏有病患。一一凡紫相守命，即使不遇煞曜，
        亦宜注意心脏，及保持精神修养。 
        若煞曜多会，主人橫发橫破，而且容易表现出无情无义。若有吉曜相会，则仍
        主人一生多经波折，或遇特殊变化，或遇逢意外的不幸，或有特殊幸运的机遇。唯
        仍然会在有意无意间偶然表现出情义的淡薄。 
        女命紫微天相，须注意感情生活，同时须留意此星系无情无义的特性，必须加以自
        制，则仍然有良好的归宿，但愛情生活则仍必多波澜。 
        大限或流年命宮见紫微天相，若逢煞忌，则必多掣肘，时生改变之心，如切望
        转工转业之类，但却未能如愿；见吉曜则仍卜运途顺遂，事业有成。"""
                print(tmp)
                print("\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """紫微天相在辰、戌二宫同度。紫微为帝曜，天相为印星，看起来似是一个很理
        想的结构，但这两颗同宫的斟卧却因封宮的破军而改变了性质。一一[中州派]重视
        整个星系结构的特性，这即是一个明显的例子。"""
                    print(tmp)
                    print("\n")
                    tmp = """
        星曜组合 紫微破军天相
        属性 土＋水＋水
        在人
        游泳冠军、模特、广告代言人、演员、艺术团团长、二手奢侈品回收商、高级研究员、空姐、空乘、整形师、个子高的人、高级工程师、装修师傅、画家、冲浪的人、国家机要任务人员、国家间谍、典当人员、设计师、摄影摄像师、高级科研人员、跳水运动员。脑科医生、旅行家、高空坠落的人
        在物
        二手奢侈品、高级护肤品、高级化妆品、香水、高的浪、喷泉、海滩悬崖、典当行、设计感的作品、火箭、电梯、高处的泳池、 vip 通道、水上飞行器、双子塔、空中走廊、廊桥
        在事
        回收奢侈品、小资情调拍摄、录制广告、看模特表演、看剧、高级艺术表演、国画作画、拍卖、设计、整形、美容美发、装修、高级会议、摄影摄像、拍摄高级广告、拍摄国家宣传片
        在观感
        高级又表面的、注重外表的、高雅艺术感的、高处的通道
                    """
                    print(tmp)
            elif(star == "紫薇七杀"):
                print("紫薇七杀\n")
                tmp = """
        一般来说，紫微七杀可以视为权力的表徵，所以紫微不宜再化权，反主人权力欲过高，表现出一种令人难以忍受的霸气。
        最宜得吉曜会照。如左辅、右弼；文昌、文曲；禄存、天马同会，则使七杀的
        刚勇有英雄用武之地，所谓[化杀为权]，即是这种格局。但假如无吉曜会照，则有
        如英雄落草为寇，便难免表现得强蛮霸道，主人橫发橫破。 
        倘无吉曜，反见煞曜会合，则刑伤克害不免。 
        女命紫微七杀，在婚姻生活方面尚无大碍，但假如诸煞照会，则主孤独。 
        大运或流年遇紫微七杀，若遇煞曜，则虽有变化的机遇，但却难以如愿；但若
        吉曜咸集，则主经过变化而得进益。"""
                print(tmp)
                print("\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """紫微七杀于巳、亥两宫同度。紫微为帝曜，七杀为将星，二者同宮，表现出无
        与伦比的威势。故主人富开创力，且思想独特。 """
                    print(tmp)
                    print("\n")
                    tmp= """
        星曜组合 紫微七杀天府
        属性 土＋火
        在人
        经常暴怒的人、烟花爆竹厂商、会展从业人员、房地产开发从业人员、政客、校长、集团公司董事长、董事长秘书、百货商场管理、奢侈品店柜姐、空乘、机长、航空从业人员、鸟类养殖人员、猎人、跑酷运动员、吊威亚特效师、古装武侠演员、政府高官、高级领导、专家、班干部、队长、团长、导游、艺术品／古玩收藏家、拍卖主持人、古董商、瓷器商、发型师、装修师傅
        在物
        鹰、鸟、烟花、爆竹、百货公司、商场、火山、射击场、武侠剧、塔吊、高楼、公寓、别墅、城堡、弓箭、火箭、弹射装置、炮弹、飞机、飞行器、国家内务、瞭望台、城墙、地图模型、地形图、艺术藏品、画作、装饰品、瓷器、降落伞、爬梯、逃生装置、贵宾室
        在事
        跑酷、爬山、跳楼、爬楼、坐飞机、观看火箭、乘坐火箭、发射炮弹、射击、观看火山、逛商场、爬梯、 homeparty 、观看武侠剧、看武侠小说、打仙侠游戏、养鸟、逛鸟市、被鸟啄、打猎、开会、政治会议、国家党政事项、站在城墙上、站在塔上、观星、看云朵、探讨战术策略、画展、看展、拍卖会、翼装飞行、速降、打理头发
        在观感
        从下往上俯冲、从某个角度发射、往中间高处集中、在高处瞭望、重要的位置、一个队伍的最高领导人、提升指导、厚积薄发、俯视
                    """
                    print(tmp)
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """
        星曜名称 天机
        归类 智星
        属性 木
        振动形态：榫卯结构作用力
        在人
        策划人员、设计师、机械行业人员、 it 行业人员、公务员、司机、桥梁工程师、路建工程师、铁路工程师、地铁工程师、机械工程师、土木工程师、教师、导游、规划师、测绘师
        在物
        道路、机械、策划案、榫卯、机动车、手机、智能产品、管道、树木、四肢关节、腺体、经络、线条、书法、电脑、逻辑学、 IT 程序、有机物、植物、脑神经、桥梁、纺织、绳索、毛衣针织衫、条纹服装、吉他、古筝、弦乐器
        在事
        策划、设计、脑力劳动、操作机械、计算、开车、坐飞机、操作电脑、拉扯、排队、插队、修路、过马路、坐火车、过桥、缝纫、十字绣、纺织、做智力题、编织
        在观感
        智慧的、细长的、可循环的、生长、逻辑性强、变动多的、线路状／条状事物、有延展性的"""
        print(tmp)
        print("\n")
        tmp = """
一般来说，天机与巨门相对，若得左辅、右弼、文昌、文曲、化禄、化权、天
魁、天钺会照，可职掌威权，成为大企业的领导人员，或政府部门首长。倘更遇禄
存、天马拱照，则更财源丰厚。若文昌、文曲夹命，则主为人聪明优秀，可从事文
艺事业，亦宜从事传播媒介的工作。 
倘如有吉曜来会，但又见煞曜，若从事政治或商业，虽可宝贵，但不耐久，不
如利用煞曜的性质以作趋避。一般而言，会化忌者宜从事传播工作；遇擎羊则可从
事科技工艺，更见天刑，可以作外科医生；遇火铃或羊陀，则宜专门技艺谋生。 
女命天机独坐子午，聪明机巧，但性好弄权柄，唯亦持家有道。最嫌天机化忌，
可能因受刺激而玩弄感情；若对宫巨门化忌，更会煞曜，宜迟婚，否则伤夫克子。 
大限流年命宫见天机独坐子午，事业有变迁的趋势，须详所会星曜而定其吉凶。
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午宮独坐 
天机在子、午宮皆为独坐，而且入庙，是比较上最能发挥天机特性的宮位。由
于对宫巨门与之会合，只要巨门不化忌，便不会招惹是非口舌，反主办事有条理，
反应敏锐且有口才机变。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机巨门
            属性 木＋土／气
            在人
            命理师、矿工、地道工、律师、快递员、外卖员、扒手、飞车党、小偷、侦探、穿越的人、穿越小说家、探洞探险家、司机、乘客、流水线工人、装箱工人、物流公司老板、消化科／呼吸科医生、无证经营的人、走私犯、管道疏通工人、托运部人员、偷车贼、空姐、飞行员、卧底记者
            在物
            隧道、下水道、地铁、高铁、火车、摩托车、车、山洞、蚂蚁洞、枪、电梯、缆车、索道、食道、呼吸系统、消化系统、行李箱、装着肢体的箱子、棺材、香插、香炉、邮件、包裹、卡丁车、矿车、货车、飞机、交通工具、条状的门、防盗门窗、百叶窗
            在事
            探洞、枪击案、掏肛、抠喉咙、插管、灌肠、开车、送外卖、点外卖、骑车、被偷、遭遇飞车党、争辩、捋思路、坐车、送快递、坐缆车、发邮件、传文件
            在观感
            线路穿梭、条状物与洞、传输、移动的条状物
            """
            print(tmp)
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """天机在丑、未独坐 
天机在丑、未两宫为落陷独坐，其特点是与对宫的天梁相对照。古人说：[机梁
会合善谈兵]，并不表示其人有军事才能，只表示其人喜欢谈论一般人不熟悉的话题，
而且表现出一种雄才伟略姿态，但必能言善辩，敏感机变。一般来说不宜从商，可
成为僚幕人才。 
天机化禄，仅主财来财去，很难积聚。不过却易有突如其来的进财幸运。若天
机化权，则可增加权势，或有机会结识权要，对事业发展及本身地位有帮助。天机
在丑未宫化科，必须得文星相夹或拱照，然后才能有所表现。但却主其人聪明出众，
口才便捷，反应敏锐。 
在丑未宫的天机最嫌煞忌并照。古人说：[天机加恶杀同宫，狗偷鼠窃]，即指
在丑未二宮而言。但必须四煞刑忌并照，无吉曜会合，且见阴煞、天虚始是，然亦
仅主人品低下，亦可藉后天修养及努力加以补救。女命天机在丑未宫，化忌尤多感情上的忧虑与挫折，在爱憎方面游移多变，内
心痛苦不足为外人道。 
 大限流年命宫逢比，不利见异思迁。若化忌及煞曜并临，则有不得不变之势，而
且变动得不利。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机天梁
            属性 木＋土
            在人
            桥梁工程师、纺织工人、裁缝、服装设计师、特工、间谍、医疗器械老板、显老的人、律师、打官司的人、命理师、金融行业人员、策划、旅游攻略博主、班主任、教导主任、老师、司机、旅行社人员、导游、文物修复师、流浪汉
            在物
            桥、纺织厂、秋千、巷子、古镇的街道、股市图、 PPT 分析、路线图、针织衫、沉香木、琥珀、氢气长条气球、打气筒、无人机、心电图、拐杖、批注、粉笔、炭笔、毛笔字、扁担、教鞭、古筝、琴弦、吉他、尤克里里、吊桥
            在事
            穿梭巷道、走在桥梁上、桥梁设计、制作 ppt 、炒股、制作旅游攻略、分析计划、织围巾、跟导航行驶、荡秋千、打嗝、开天然气、测量心率、批改作业、流浪、荡吊桥
            在观感
            线条起伏、计划路线、管道气流上升、年代久远的条状物、矫正的线条、弹动的条状物
            """
            print(tmp)
        if(len(star) == 4):
            if(star == "天机太阴"):
                print("天机太阴\n")
                tmp = """
        本宮星曜的特质，是处事有条理，而且一板一眼，能按既定方针与计划办事，
        所以宜于公职，或担任企业职务。现代社会重视企业管理，最宜于以本宮为命宮的
        人。 
        另一方面，[机月同梁]的格局，亦主人偏近于阴柔的一面，男性固易于接近异
        性，懂得女人的心理；女性亦主容貌美丽，感情丰富，易得男性追求。 
        但这种阴柔的性格，却亦可以发展为内怀权术，工心计，耍小手段。这亦是[作吏
        人]的基本因素。 
        所以无论男女命，不宜文昌文曲同度会照，因为加上文星的点缀，太过阴柔，
        不但易流为华而不实，抑且容易巧言令色以讨别人的欢心。 
        本宫的格局，最宜见左辅右弼及禄存，则能增加气势，兼且使心志高尚。若见
        化禄、化权、化科并照，则能富能贵，虽居僚幕，亦掌职权。唯天机化禄：厂本宮，
        于财帛有损后方招进财的迹象，见煞则入不敷支；见吉则出小财进大财。 
        女命天机太阴，外貌美好，内心则多困扰，天机再化忌星，则多愁善感，对异性
        忽冷忽热，若即若离。若四煞冲突，宜作继室，否则刑克不免。更遇桃花诸曜，则
        宜从事表演艺术，会天同主爱好音乐，故可考虑从事歌艺。但仍易为异性追求。
        大限流年命宮天机太阴，亦主有变动，若会天马，则常出外工作，更见禄存，
        尤利出门求财。一般来说，见吉曜则变动如意，可添财福；见凶曜则受环境影响，
        欲变动而不如意，或被逼作不利的改变。"""
                print(tmp)
                print("\n")
                if(dizhi == "寅" or "申"):
                    tmp = """天机太阴在寅、申二宫同度，财帛宫天同，事业宫天梁，是一个典型的[机月同
        梁]星系。古人说：[机月同梁作吏人]，本宫最为标准。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 天机太阴
                    属性 木＋水＋气
                    在人
                    地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
                    在物
                    细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
                    在事
                    计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
                    在观感
                    线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物
                    """
                    print(tmp)
            elif(star == "天机巨门"):
                print("天机巨门\n")
                tmp = """ 
        这个组合的特色，主人口舌便给，反应敏锐，但做事懒散，容易有头无尾。而
        且受太阴太阳的影响，人情亦忽冷忽热，兼且气量狭隘。 
        这种命局，最不宜见煞忌诸曜，虽富贵亦不耐久，尤忌见擎羊、陀罗，多背面
        是非，而且早运坎坷，退书祖业。女命尤其不利婚姻，易逢感情挫折。 
        天机化禄，得财必费唇舌；若天机化权，则历艰辛而事业有成，最利从事公务，
        或服务于大企业，倘若经商，波折必大。若天机化科，则仍主艰辛，但有利于竞争，
        而且往往可因辛劳策划而得享名誉。若巨门化禄，主人口舌进财，虽带浮滑，仍宜从事传播事业；巨门化权，具有说
        服力。增加在本宫守命者的社会地位，能因忠实工作而掌权。 
        但若天机化忌，或巨门化忌，则主人多无谓的思虑，兼且作事犹豫，常易失机缘，
        以致感到怀才不遇。天机带来的机会常一瞬即逝，非注意把握，当机立断不可。 
        天机巨门同宫，见禄存或化禄，或对宫见禄存，若无煞曜，皆主事业有表现，受
        人提拔，地位崇高。若见煞曜则平常，唯仍有一定的地位。但如无言曜，诸煞并凑，
        则生平必有险阻。
        女命天机巨门，亦不宜化忌，否则容易失足，而且喜欢玩火。
        若命宮在卯，借入酉宫的天机巨门；或命宮在酉，借入卯宫的天机巨门，则所
        会合者便不是太阴、太阳、天梁，性质便有变化。主要的分别，是更利口才的发挥；
        做事更有条理，但却更具内才，有权术，而感情方面则比较淡薄。 
        大限流年命宫见天机巨门，如无吉曜会合，主口舌是非纷扰。更见煞忌，则诸
        多不宁，处事多变，以致忧心忡忡。若见辅佐诸吉，则宜变动。见禄存天马，尤利
        变动以求财。"""
                print(tmp)
                print("\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """天机巨门在卯、酉二宫同度。这个组合有一个特点，即事业宫无正曜，必须借
        人夫妻宫的星曜(图四)。因此，三方四正就变成是天机巨门、太阴太阳以及天同的
        组合。――[中州派]所传，有一个[阴阳同机巨]的星系，本宫即是这种结构。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 天机巨门
                    属性 木＋土／气
                    在人
                    命理师、矿工、地道工、律师、快递员、外卖员、扒手、飞车党、小偷、侦探、穿越的人、穿越小说家、探洞探险家、司机、乘客、流水线工人、装箱工人、物流公司老板、消化科／呼吸科医生、无证经营的人、走私犯、管道疏通工人、托运部人员、偷车贼、空姐、飞行员、卧底记者
                    在物
                    隧道、下水道、地铁、高铁、火车、摩托车、车、山洞、蚂蚁洞、枪、电梯、缆车、索道、食道、呼吸系统、消化系统、行李箱、装着肢体的箱子、棺材、香插、香炉、邮件、包裹、卡丁车、矿车、货车、飞机、交通工具、条状的门、防盗门窗、百叶窗
                    在事
                    探洞、枪击案、掏肛、抠喉咙、插管、灌肠、开车、送外卖、点外卖、骑车、被偷、遭遇飞车党、争辩、捋思路、坐车、送快递、坐缆车、发邮件、传文件
                    在观感
                    线路穿梭、条状物与洞、传输、移动的条状物
                    """
                print(tmp)
            elif(star == "天机天梁"):
                print("天机天梁\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """天机天梁在辰、戌二宮同度。财帛宫会天同太阴，所以亦属于[机月同梁格]。
        但天机天梁坐命，却与天机太阴坐命不同；机梁主好辩论，擅词令，故以外才为重，
        与天机太阴之内才不同。 
        但由于天梁的影响，本宫星曜便有一个特质，虽有吉星交会，但富贵不能两全。
        或富而不耐久享，或富而徒具虚名。 
        尤其天梁不宜化禄，若化禄则必成是非之挠，为众人所交责。即使同宫的天机
        化禄，亦足以发生影响；不但得财而不能守，而且易因钱财惹是非纷扰。 
        最宜天机化权、天梁化科同聚命宫，则可减少浮动，且增加天梁排难解纷的能
        力。 
        若天机化科，不外徒具虚名，反易滋感情上的困扰。倘天机化忌，则困难重重，多忧多虑，虽有天梁排解，亦必饱受虚惊。 
        倘若事业宫借人的巨门太阳化为禄、权，则主事业上受异族人提拔，或可考虑
        从事与外国人有关的工作。倘见擎羊、天刑会照，则是法律人才，因为太阳巨门与
        天机天梁都主口才，尤其宜于引用条文律例(图五)。天机主变化浮动，反应敏锐，天梁则守原则，依律例，二者结合，分析力特别
        高强。这是本宮星系的特点。但倘遇煞曜刑忌，则天梁反而显露出孤克的性质，无
        论男女命，皆对六亲少缘份。 
        天机天梁最吉会左辅、右弼、文昌、文曲，使人其才足以济其用，可以成为有
        社会地位的人物。 
        辰戌二宫比较，辰宫所会的天同太阴以及太阳巨门都入庙乘旺，而戌宫所会者
        则落陷，所以辰宮比戌宫大为优胜，格局较高。 
        女命最嫌天机化忌、或巨门化忌、或太阴化忌，倘遇合忌星，更见空劫刑煞，
        刑克夫子之力甚重。虽主长寿，但人生不免寂寞，所以最宜迟婚，子女亦宜迟得。 
        大限流年见天机天梁，主经历麻烦纠纷始变动有成。但若煞忌重重，则变动仍
        不如意。 """
                    print(tmp)
                    print("\n")
                    tmp = """星曜组合 天机天梁
                    属性 木＋土
                    在人
                    桥梁工程师、纺织工人、裁缝、服装设计师、特工、间谍、医疗器械老板、显老的人、律师、打官司的人、命理师、金融行业人员、策划、旅游攻略博主、班主任、教导主任、老师、司机、旅行社人员、导游、文物修复师、流浪汉
                    在物
                    桥、纺织厂、秋千、巷子、古镇的街道、股市图、 PPT 分析、路线图、针织衫、沉香木、琥珀、氢气长条气球、打气筒、无人机、心电图、拐杖、批注、粉笔、炭笔、毛笔字、扁担、教鞭、古筝、琴弦、吉他、尤克里里、吊桥
                    在事
                    穿梭巷道、走在桥梁上、桥梁设计、制作 ppt 、炒股、制作旅游攻略、分析计划、织围巾、跟导航行驶、荡秋千、打嗝、开天然气、测量心率、批改作业、流浪、荡吊桥
                    在观感
                    线条起伏、计划路线、管道气流上升、年代久远的条状物、矫正的线条、弹动的条状物
                    """
                    print(tmp)
                elif(dizhi == "巳" or dizhi == "亥"):
                    tmp = """
            在巳、亥宫独坐 
            天机在巳、亥宮皆为独坐。但在巳宮时，对宮的太阴入庙；在亥宮时，对宫的
            太阴落陷，所以巳宫比亥宫的性质要好得多。 
            天机与太阴对照，受太阴的影响亦非常强烈，因而无论男女都表现得对异性温
            柔体贴，一生多感情发展。女命尤其易与异性滋生情愫。若天机化忌或太阴化忌，
            则更容易发生畸恋，但当事人却以感情的创伤作为美好的记忆，因此容易发展为玩
            弄感情。 
            天机与太阴相对，再见擎羊，主女子美艳不可方物，更易招惹异性。 
            天机化禄，则太阴必同时化忌。天机若在巳宫，太阴不畏化忌，反利于变动；
            天机若在亥宮，太阴不宜化忌，变动未必有利。 
            天机化权，不外增加变动吋的主动性；若天机化科，则太阴必同时化禄，利于变动，财帛名誉同时增加，但必须辛苦耕耘而后有收获。 
            天机在巳、亥二宫，不宜见煞忌，主人多学无成，且一生易失机遇。于是便难
            免漂泊，而且牢骚满腹，时或借酒浇愁，潦倒时是好施小计以谋生活之资，故古人
            称之为[天机太阴巳亥逢，好饮离宗奸狡重。]趋避之道，在于精通一门巧艺以谋生。
            女命逢此星系结构，最宜注意爱情生活。 
            大限流年命宮见天机独坐巳、亥，于变动吋须加以小心。需详所会星曜以定吉凶。
            倘星曜不吉，不宜妄生改变。 
            依[中州派]所传，凡天机坐命，不论居任何宫垣，鸟宮均不宜见贪狼。主人日夜无
            事奔忙；多无谓应酬，且虽染不良嗜好。若贪狼见煞忌，或命宮煞曜咸集，主人一
            出生即他迂，或离宗出祀，否则童年必遭虛惊。若七杀及破军会合在寅、卯、辰三
            宫的贪狼，再见煞曜，主生意外血光之灾。再见空劫刑忌而无吉化，寿夭。"""
                    print(tmp)
                    print("\n")
                tmp = """
                星曜组合 天机太阴
                属性 木＋水＋气
                在人
                地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
                在物
                细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
                在事
                计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
                在观感
                线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物
                """
                print(tmp)
    elif (star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """
        星曜名称 太阳
        归类 散星
        属性 人
        振动形态：光和温度向四周扩散
        在人
        教师、慈善家、摄影摄像师、导演、贸易行业人员、创业者、社会义工、传媒行业人员、施救者、外乡人、社交达人、父亲、丈夫、政治老师、经济学家、像男人的女性、能源开采工程师、名人、灯光师、眼科医生、社会服务人员、记者、媒体人
        在物
        暖炉、热水、阳光、灯光、眼睛、发亮的物体、心脑血管、男科生殖、星球、经济贸易中心、电视台、广播、星体、能源、公益项目、广告、经济学、政治、火、火锅、辣椒、麻辣烫
        在事
        牺牲奉献、公益慈善、烫伤、声名远扬、去远方、扩散、政治、捐款、做义工、晒太阳、晴天、发烧、发烫、人群、社会活动、政治活动、社交活动、外交活动、吃热辣食物、传播、人群集中
        在观感
        善良但有锋芒、有名气、热情、博爱关怀、牺牲奉献、火红、温度高、光照、使温度升高，使照亮、使传播
        """
        print(tmp)
        if(dizhi == "子"):
            tmp = """在子、午宫独坐 
    太阳在子、午两宫皆为独坐，但在子宫落陷失辉，在午宫则日丽中天，所以两
    个宫垣的性质有所分別。 
    在子宫的太阳，包涵容忍的力量较大，但因失辉的缘故，光和热都不足以化解
    对宫天梁那种孤克的性质，亦不足化解事业宫巨门暗曜的影响，因此内心便多痛苦，
    童年吋更难得父亲的荫庇。然而由于其能包涵容忍，所以当会照吉曜之时，仍主事
    业有成，可凭托儿所而得名利。特别是当太阳化禄、化权、化科之时，或收入增加；
    或能发挥领导权力；或因服务公众而得名誉，若更见辅、佐诸曜、便可以由事业将
    内心的隐痛弥补。 
    但如果太阳在子宫化忌，更逢煞曜，则对眼目有损。 
    太阳在子宫的女性，感情内蕴，伹外表则不显露。若内心的痛苦(例如童年不幸
    的遭遇，感情上的挫折等)且给人发掘，便容易感情崩溃，反易为人所乘，宜小心避
    免。 
    大限流年命宮太阳在子，作事多虚，逢煞曜更招小人骚扰。若太阳化禄，反主
    健康有损，易头痛头昏。 
    """
            print(tmp)
            print("\n")
        elif(dizhi == "午"):
            tmp = """在子、午宫独坐 
太阳在子、午两宫皆为独坐，但在子宫落陷失辉，在午宫则日丽中天，所以两
个宫垣的性质有所分別。
太阳在午宫时，阳光强烈，足以化解天梁及巨门的扰克刑忌。但无论男女，童年
吋仍对父亲不利，或与父亲无缘，或不得父荫，或父亲灾病以至死亡应详所会煞忌
刑诸曜的多寡及性质而定。 
太阳在午宫无包涵容忍的力量，但不如意的遭遇却反成激发之力，开创的力量
很大。若见太阳化禄，虽主幼年无父福或自身多灾病，但仍主财帛丰盈，能富能贵。
若化权星，则能贵显，难遇煞曜亦可为小局面的领导，不过午宫太阳已嫌猛烈，化
权后便更加强了他的主观；若太阳化禄，虽主有名誉，却忌出锋头，恐因此招惹嫌
忌。 
 太阳若在午宫化忌，早年与父母无缘， 自身亦多灾病，然因天梁之力而逢凶化
吉。 
 太阳在午嫌阳光猛烈，亦主有目疾，如近视散光之举。老年则宜提防血压及心脏病，尤其以大限顺行者（即阳男、阴女)为然。 
 女命太阳在午，有男子气概，秉性贞烈，虽对夫星不利，但自身却可创造命运。
若逢煞曜刑忌空劫，反能激发起刚烈坚贞的赋性。若吉曜咸集，能如男子创业。 
大限流年命宫太阳在午，遇吉星则平步青云，结婚生子；遇煞曜则多辛劳，亦
有头痛头昏的症候。逢化忌、眼目有损，或多眼风。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳天梁
            属性 火＋土＋气
            在人
            教育家、教育局人员、政法机构人员、历史老师、生物医药老师、名医、脑科医生、心脑血管医生、慈善家、间谍、知名的老人、老男人、年代久远的能源、燃油、弹拉面的人、知名考古学家、地质学家、地震局人员、哲学家、农业／自然／社会老师、品牌金融证券从业人员、知名律师、李春平
            在物
            针织物、围巾、医疗器械、检察院、法院、纪委、沙漠、金字塔、金矿、光波、带灯光的氢气球、热气球、土耳其、甘肃、兰州拉面、硫磺、火山、琥珀、尼泊尔、地毯、地暖、热炕头、烤红薯、阳光下的庄稼／农田／梯田／稻田、历史纪录片、旅游宣传片、动物世界节目、求生节目、社区管理员、养老院、福利院、疗养院、心电图、摩洛哥
            在事
            乘坐热气球、爬坡、欣赏琥珀、法律科普、历史科普、测量心率、慈善公益活动、沙漠旅游、看发光的土、弹拉面、躺热炕头、欣赏大自然、烤红薯、公开批评
            在观感
            光热与波动的、公开引导矫正
            """
            print(tmp)
        elif (dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌二宫独坐 
            太阳在辰宫安命，对宫太阴，二者皆入旺宫，为典型的[日月并明]格局；但如
            在戌宫，则太阴太阳皆在陷宫，却是典型的[日月反背]格。 
             [日月并明]一般主少年得志，为人正直，而且处书练达机敏；若会辅、佐诸曜
            化禄、化权、化科，更主贵显。但若吉曜及煞曜并照，则宜从事法律，或担当监察
            职务，亦可从事传播界工作，若文星同时人命宮，则宜从事文教、文化工作。[日月反背]，古人认为与父母无缘。但现代社会力小家庭制度，而且离乡背井
            已不算什么一回事，所以[父母无缘]所表现出来的具体事实，并不如古代那么严重。
            在事业方面，则主名声难以显达，但当会照吉曜之时，特別是太阳化禄，则主可成
            巨富，唯必须经一番艰辛的挣扎。而[父母无缘]的性质亦表现为必须白手起家，难
            得父荫。适宜从事的职业，与在辰宫者相同。 
            太阳在辰、戌二宫化禄，均丰财帛进益；若化权星，在辰宫者主权力增加，在
            戌宫化权，令人主观加强，虽有权力，若见煞反招嫌忌是非，宜注意自我修养。 
            太阳在辰、戌二宫化科，名声均显，但在戌宫者不宜求名，名愈高即是非愈大。
            若太阳化忌，在辰宫者宜注意与男性尊亲包括上司、老板的关系；在戌宮化忌，
            除注意人际关系外，并防眼目有病。若更会擎羊、天刑，主官非。 
             女命[日月并明]，古人认为可[早配贤夫]，这是因为古代妇女根本无事业可言；
            若在现代，则亦主自身可以发展事业。但若逢[日月反背]，则宜迟婚。若命宫更有
            火星铃星同度，早婚有失足之虞，且辛劳少人缘。 
            大限流年命宫在辰、戌，会吉曜仍主喜庆，若煞忌并会，则防意外破财，橫招
            损失。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳太阴
            属性 火＋水
            在人
            网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
            在物
            灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
            在事
            看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
            在观感
            日月同辉、光照、热度高、传播能力强、距离远
                                """
            print(tmp)
        elif (dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳、亥二宫独坐 
            太阳在巳、亥二宫，对宫必为巨门。巨门暗昭须藉太阳化解，因此巳宫安命的
            人，以太阳居于旺宫的缘，化解巨门的力量， 自比居于亥宫落陷的太阳为大。 
            所以巳宮安命的人容易少年得志，或得父母福荫，但忌得志后心高气傲，过露
            锋芒。若能收敛，或因气傲遭遇挫折之后仍不懈于事业，则仍主名高显达。 
            亥宫安命者，幼年不利父亲。若煞忌并照，则宜出祀外姓。自身则防眼目疾病。
            唯主其人思想独特，倘能奋斗，则自然卓立有成，不过其思想行为仍不易为一般人
            所理解。 
            太阳化禄，喜更会天马，能富。化权、化科则更易招忌，虽权力声誉均可增加；
            若化忌星，少年不利，亦不易服从上司。 
            女命巳亥二宫皆不宜见煞忌诸曜，主劳碌及招惹是非，此乃太阳巨门相会的通
            病。同时因会合天梁的缘故，不宜更见天刑来会，否则婚姻恐有挫折。若煞忌并临，
            虽主人性情端庄，但父福、夫福、子福均不如意。 
            太限流年命宫太阳在巳、亥，一般来说，在巳宫者得意，在亥宫者劳碌奔波然
            后有成，落空陷均主作事空虛不实，见煞忌重者防橫得橫破，不可妄图侥幸。"""
            print(tmp)
            print("\n")
        tmp = """
            星曜组合 太阳巨门
            属性 火＋土
            在人
            名嘴、记者、经纪人、歌星、命理师、穿越的人、穿越小说作者、能源工程师、煤矿工人、盗墓贼、盗墓小说作者、老师、经济学家、政治老师、公益活动人员、义工旅行人员、肛肠科医生、品牌4s店老板、燃气公司员工、传媒公司人员、企业宣传人员、广告公司人员、被雪藏的名人、探洞探险家、外贸公司老板、跨境电商、涉外律师、公证处人员、吃火锅的人、吃辣食的人、被烫了嘴的人、埃及法老、外星人、牙医、看牙医的人、厨师、面点师、火把传递者、偷金子的人、知名大盗、侠盗、侠盗小说作者、名侦探、推理大师、评论家、支教、昭君、假小子、刁蛮公主
            在物
            壁炉、矿洞、火山口、火锅、亮光的皮鞋、火葬的棺材、埃及法老陵墓、不明飞行物、飞碟、带灯的飞行器、带灯的交通工具、闪光的无人机、陨石、太阳神鸟、凤凰、乌鸦、渡鸦、星链、探照灯、火炬、《名侦探柯南》贞德、进口商品、煤气罐、炸弹、流星
            在事
            灯光明亮的舞台上讲话／唱歌、接受采访、采访他人、使用取暖器、火葬、使用炉灶、烧冥币、传菜碟、下厨、吃火锅、看牙医、看路过的火车、看天上的流星、看陨石降落、运动会火炬传递、接力赛、与男人发生争执、辣评段子、义工活动、检举揭发。看侠盗剧
            在观感
            明亮的洞、传播光热、揭露黑暗、发光的移动物体、嘴毒心善
            """
        print(tmp)
        if(len(star) == 4):
            if(star == "太阳太阴"):
                print("太阳太阴\n")
                tmp = """太阳太阴在丑、未二宫同度。太阳在丑宫落陷，太阴则在未宫落陷，两个宫位
        都有一颗落陷的正曜。所以古人虽有[日月并明]的格局，所指的其实不应该是曰月
        在孔、未同宮的情况，而是指太阳居卯、太阴居亥的会合。 
        当太阳太阴同度之吋，最基本的性质便是令人有忽阴忽阳的表现。 
        具体来说，对人的态度忽冷忽热；对事业一时消极一日寸积极；对钱财一时大
        方一时吝啬，便即是忽阴忽阳的性格。 
        两个宫位比较，丑宫由于是太阳失辉的缘故，太阴的光辉不能将太阳照亮；但
        在未宫，失辉的太阴却可以得太阳照应，所以一般来说，丑宫不如未宮。丑宫安命
        的人，容易表现出作事虛浮的特色，而未宫安命时，则基本上有豪迈的个性。但当
        煞曜会照之吋，则两宮安命都表现得吝啬，假如太阳化忌，则可能童年与父母都缺
        缘份，自身则多柄或多虚惊。太阴化忌则多忧多虑，人生亦艰苦。 
        在丑未两宫，太阴化禄、化权、化科，不如太阳之得化曜。化禄一般不利感情，
        且多是非口舌；化权则常易感到力不从心，无法开展事业；化科则主可得虛名而少
        实际。 
        在这两个宫垣的太阴太阳亦不宜见火、铃、羊、陀四煞，女命尤忌与火星同宫，
        虽胸无城府，但易感情用事。 
        大限流年命宫见太阳、太阴，宜提防处事缺乏方针，而且不宜理想太高。"""
                print(tmp)
                print("\n")
                tmp = """
                星曜组合 太阳太阴
                属性 火＋水
                在人
                网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
                在物
                灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
                在事
                看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
                在观感
                日月同辉、光照、热度高、传播能力强、距离远
                """
                print(tmp)
                if(dizhi == "丑"):
                    tmp = """太阳在丑宫化禄、化权、化科，可以加强太阳的力量，得与入庙的太阴平衡，
        因此个性便比不得化曜时为开朗，人生的遇合亦较川页遂，从事服务性行业或公教
        职务亦可有成就。尤喜文昌文曲在巳酉两宫来会，则不但可增加人的社会地位，同
        时亦增强其领导能力。这即是太阳主贵的特色。 """
                    print(tmp)
                    print("\n")
                elif(dizhi == "未"):
                    tmp = """太阳在未宫化禄、化权、化科，使本来已经得地的太阳更加生色，所以个性就
        较偏向于积极，但却失去太阳的冷静。同时太阳主贵而不主富的特性，亦发挥得淋
        漓尽致，主人有地位而财禄未必丰厚。亦喜文昌文曲于亥。口两宫来会，则未宫的
        太阳更加出色。 """
                    print(tmp)
                    print("\n")
            elif(star == "太阳巨门"):
                print("太阳巨门\n")
                tmp = """太阳与巨门在寅、申二同度。巨门为暗曜，须要太阳的光辉加以照耀，然后可
        解其暗。 
        太阳化科则主名誉昭彰，寅宫比申宮尤为有利。巨门化权则可增加言语的权威
        性。 
        但太阳化忌及巨门化忌，则主人喜以下犯上，与男性的尊亲或上司不和。若加
        四煞，更主是非口舌。尤其是当会合天刑、擎羊之时，更恐牵涉词讼。 
        女命寅申二宮皆易有感情挫折，尤以坐申宮时有失足的可能，以迟婚姻为宜。
        大限流年命宫见太阳巨门，见吉曜则事业发展，见凶曜则理想不能实现。"""
                print(tmp)
                tmp = """
                星曜组合 太阳巨门
                属性 火＋土
                在人
                名嘴、记者、经纪人、歌星、命理师、穿越的人、穿越小说作者、能源工程师、煤矿工人、盗墓贼、盗墓小说作者、老师、经济学家、政治老师、公益活动人员、义工旅行人员、肛肠科医生、品牌4s店老板、燃气公司员工、传媒公司人员、企业宣传人员、广告公司人员、被雪藏的名人、探洞探险家、外贸公司老板、跨境电商、涉外律师、公证处人员、吃火锅的人、吃辣食的人、被烫了嘴的人、埃及法老、外星人、牙医、看牙医的人、厨师、面点师、火把传递者、偷金子的人、知名大盗、侠盗、侠盗小说作者、名侦探、推理大师、评论家、支教、昭君、假小子、刁蛮公主
                在物
                壁炉、矿洞、火山口、火锅、亮光的皮鞋、火葬的棺材、埃及法老陵墓、不明飞行物、飞碟、带灯的飞行器、带灯的交通工具、闪光的无人机、陨石、太阳神鸟、凤凰、乌鸦、渡鸦、星链、探照灯、火炬、《名侦探柯南》贞德、进口商品、煤气罐、炸弹、流星
                在事
                灯光明亮的舞台上讲话／唱歌、接受采访、采访他人、使用取暖器、火葬、使用炉灶、烧冥币、传菜碟、下厨、吃火锅、看牙医、看路过的火车、看天上的流星、看陨石降落、运动会火炬传递、接力赛、与男人发生争执、辣评段子、义工活动、检举揭发。看侠盗剧
                在观感
                明亮的洞、传播光热、揭露黑暗、发光的移动物体、嘴毒心善

                """
                print(tmp)
                print("\n")
                if(dizhi == "寅"):
                    tmp = """在寅宫，太阳为旭东升；在申宫，太阳已近日落西山，所以两个宫位的星系，也便有不同的性质。 
        在寅宫，阳光初露，所以虽然前程远大，但却难免要经过一番挣扎，尤其是受
        巨门的影响，所得利益以及名誉、事业，均有迟得迟发的现象，晚景比较优柔。
        寅宫安命的人有魄力，处事稳重，有理想而且能为理想而努
        力；所以寅宫安命的人可以从事法律、政治，或学术研究；
        """
                    print(tmp)
                    print("\n")
            elif(dizhi == "申"):
                    tmp = """在申宫，阳光已开始转弱，受巨门的影响，便难免有无以为继的现象，所以人
        生虽有一段辉煌的时刻，所需要着重的却是如何持盈保泰，努力不懈。 
        从性格方面来说，在申宫安命的人，则比较上有头无尾，处事缺乏毅力，但为人随和，感情上也
        比较天真。而申宫安命的人，
        则宜从事公关、传播、推销、以及教育工作。 
        无论在寅宫抑或申宫，都喜太阳化禄，在申宫者虽较辛劳，但仍主财帛亨通，
        尤其利于藉口才以求财。 """
                    print(tmp)
                    print("\n")
            elif(star == "太阳天梁"):
                print("太阳天梁\n")
                tmp = """
                星曜组合 太阳天梁
                属性 火＋土＋气
                在人
                教育家、教育局人员、政法机构人员、历史老师、生物医药老师、名医、脑科医生、心脑血管医生、慈善家、间谍、知名的老人、老男人、年代久远的能源、燃油、弹拉面的人、知名考古学家、地质学家、地震局人员、哲学家、农业／自然／社会老师、品牌金融证券从业人员、知名律师、李春平
                在物
                针织物、围巾、医疗器械、检察院、法院、纪委、沙漠、金字塔、金矿、光波、带灯光的氢气球、热气球、土耳其、甘肃、兰州拉面、硫磺、火山、琥珀、尼泊尔、地毯、地暖、热炕头、烤红薯、阳光下的庄稼／农田／梯田／稻田、历史纪录片、旅游宣传片、动物世界节目、求生节目、社区管理员、养老院、福利院、疗养院、心电图、摩洛哥
                在事
                乘坐热气球、爬坡、欣赏琥珀、法律科普、历史科普、测量心率、慈善公益活动、沙漠旅游、看发光的土、弹拉面、躺热炕头、欣赏大自然、烤红薯、公开批评
                在观感
                光热与波动的、公开引导矫正
                """
                print(tmp)
                if(dizhi == "卯"):
                    tmp = """太阳天梁在卯、酉二宫同度。但两宫的基本性质又名有差异。 
在卯宫，称为[日照雷门]。这有如黎明时份的太阳，光芒初露。一一所谓[雷门]，
则是指东方震宫。但在这宫位的太阳，其光与热却仍未足解除天梁星曜那种孤克刑
忌的性质，因为阳光初露，前程虽然远大，但是光和热都有限，故在这宫位立命的
人，必先经过艰难与险阻，然后才能在事业上有所成就。但本宫星曜仍然主贵而不
主富，因而也就宜于从事公众服务行业；假如遇到文星，则适宜从事学术研究，或
担任教职。 
倘若命宫有禄存及文昌同度，则是所谓[阳梁昌禄]格。古人说：[阳梁昌禄，传
胪第一名]，所以命宫逢此格局的人，最利参加国家典试，或参加资格考试，如建筑
师、女计师之类。若参加学位考试，则更易获成功。无论参加什么考试，都可藉此
踏上成功的阶梯。所以照[中州派]所传，太阳卯宫坐命，主人多艺多才，名显富裕。
卯酉二宫的太阳最喜化权，可以增加权威，若会天魁天钺、恩光天贵、三台八
座等曜，则可考虑从政，或成为大企业的高级管理人员。 
大限流年命宫见太阳天梁，若会文星，亦主年限之内利于参加考试、甄选，或
在事业竞争中胜利。若辅、佐诸曜并照，主人平步青云。即使流年命宫太阳化权、
化科是年亦必有突发性进步。若火铃羊陀及忌星并照，则有小人侵害，遭意外纷扰，
或致破财。中年以后尤须注意山血压。 
"""
                    print(tmp)
                    print("\n")
                elif(dizhi == "酉"):
                    tmp = """太阳天梁在卯、酉二宫同度。但两宫的基本性质又名有差异。
                    假如在酉宫安命，命宫无正曜，须借卯宫太阳天梁入宫安星，则所会合者为天
司巨门及天机，则不如原在卯宫者得会天同巨门及亥宫的太阴之佳。因为卯宫太阳
太阴的会合，主既富且贵，但借星人西宫者，则因为有天梁天机的会合，故关于阐
釋事理之外，特別适宜学术研究，亦宜从事法律工作，但社会地位虽高，富裕，则
不如原卯宫安命者。在酉宫安命，虽然星曜组合与卯宮相同，但由于西宫伪太阳已日落西山，晚景虽
佳，只可惜黄昏已近。所以在本宫安命的人，命运一般不如卯宫安命的人。即使同
是[阳梁昌禄]的格局，其成就亦有所不如。大致上是晚景较为孤独，所以宜于中年
时创立名声事业，注意积蓄。中年以后，宜研究哲理，寄托身心。 
假如卯宫无正曜，须借酉宫的太阳天梁入宫安星，亦宜于从事学术研究或从事
法律工作，或从事服务社会的行业。(图七) 
太阳有天梁同宫，所以不喜化禄。若太阳化禄，无沦卯宫或西宫安命，都易招
困扰，容易受人指责，或凡获财利必先经纷扰。但从事学术研究或文艺创作者则无
妨，因为这类工作者必须先伤脑筋，然后才获名利，事业性质符合星曜的性质。
卯酉二宫的太阳最喜化权，可以增加权威，若会天魁天钺、恩光天贵、三台八
座等曜，则可考虑从政，或成为大企业的高级管理人员。 
卯宫太阳不十白化忌，称为[变景]；但在酉宫化忌则甚为不且，若再会煞刑等
曜，主有牢狱之灾，唯有天梁同宫，终可逢凶化吉。 
女命太阳天梁，于卯宫者，主婚前有波折，于酉宫者，则婚后仍多困扰波折， 以
晚婚为宜。 
大限流年命宫见太阳天梁，若会文星，亦主年限之内利于参加考试、甄选，或
在事业竞争中胜利。若辅、佐诸曜并照，主人平步青云。即使流年命宫太阳化权、
化科是年亦必有突发性进步。若火铃羊陀及忌星并照，则有小人侵害，遭意外纷扰，
或致破财。中年以后尤须注意山血压。 
 """
                    print(tmp)
                    print("\n")
                elif(dizhi == "辰" or dizhi == "戌"):
                    tmp = """在辰、戌二宫独坐 
太阳在辰宫安命，对宫太阴，二者皆入旺宫，为典型的[日月并明]格局；但如
在戌宫，则太阴太阳皆在陷宫，却是典型的[日月反背]格。 
 [日月并明]一般主少年得志，为人正直，而且处书练达机敏；若会辅、佐诸曜
化禄、化权、化科，更主贵显。但若吉曜及煞曜并照，则宜从事法律，或担当监察
职务，亦可从事传播界工作，若文星同时人命宮，则宜从事文教、文化工作。[日月反背]，古人认为与父母无缘。但现代社会力小家庭制度，而且离乡背井
已不算什么一回事，所以[父母无缘]所表现出来的具体事实，并不如古代那么严重。
在事业方面，则主名声难以显达，但当会照吉曜之时，特別是太阳化禄，则主可成
巨富，唯必须经一番艰辛的挣扎。而[父母无缘]的性质亦表现为必须白手起家，难
得父荫。适宜从事的职业，与在辰宫者相同。 
太阳在辰、戌二宫化禄，均丰财帛进益；若化权星，在辰宫者主权力增加，在
戌宫化权，令人主观加强，虽有权力，若见煞反招嫌忌是非，宜注意自我修养。 
太阳在辰、戌二宫化科，名声均显，但在戌宫者不宜求名，名愈高即是非愈大。
若太阳化忌，在辰宫者宜注意与男性尊亲包括上司、老板的关系；在戌宮化忌，
除注意人际关系外，并防眼目有病。若更会擎羊、天刑，主官非。 
 女命[日月并明]，古人认为可[早配贤夫]，这是因为古代妇女根本无事业可言；
若在现代，则亦主自身可以发展事业。但若逢[日月反背]，则宜迟婚。若命宫更有
火星铃星同度，早婚有失足之虞，且辛劳少人缘。 
大限流年命宫在辰、戌，会吉曜仍主喜庆，若煞忌并会，则防意外破财，橫招
损失。 """
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 太阳太阴
                    属性 火＋水
                    在人
                    网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
                    在物
                    灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
                    在事
                    看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
                    在观感
                    日月同辉、光照、热度高、传播能力强、距离远
                    """
                    print(tmp)
                elif(dizhi == "巳" or dizhi == "亥"):
                    tmp = """在巳、亥二宫独坐 
太阳在巳、亥二宫，对宫必为巨广]。巨门暗昭须藉太阳化解，因此巳宫安命的
人，以太阳居于旺宫的缘，化解巨门的力量， 自比居于亥宫落陷的太阳为大。 
所以巳宮安命的人容易少年得志，或得父母福荫，但忌得志后心高气傲，过露
锋芒。若能收敛，或因气傲遭遇挫折之后仍不懈于事业，则仍主名高显达。 
亥宫安命者，幼年不利父亲。若煞忌并照，则宜出祀外姓。自身则防眼目疾病。
唯主其人思想独特，倘能奋斗，则自然卓立有成，不过其思想行为仍不易为一般人
所理解。 
太阳化禄，喜更会天马，能富。化权、化科则更易招忌，虽权力声誉均可增加；
若化忌星，少年不利，亦不易服从上司。 
女命巳亥二宫皆不宜见煞忌诸曜，主劳碌及招惹是非，此乃太阳巨门相会的通
病。同时因会合天梁的缘故，不宜更见天刑来会，否则婚姻恐有挫折。若煞忌并临，
虽主人性情端庄，但父福、夫福、子福均不如意。 
太限流年命宫太阳在巳、亥，一般来说，在巳宫者得意，在亥宫者劳碌奔波然
后有成，落空陷均主作事空虛不实，见煞忌重者防橫得橫破，不可妄图侥幸。"""
                    print(tmp)
                    print("\n")
                tmp = """
                星曜组合 太阳巨门
                属性 火＋土
                在人
                名嘴、记者、经纪人、歌星、命理师、穿越的人、穿越小说作者、能源工程师、煤矿工人、盗墓贼、盗墓小说作者、老师、经济学家、政治老师、公益活动人员、义工旅行人员、肛肠科医生、品牌4s店老板、燃气公司员工、传媒公司人员、企业宣传人员、广告公司人员、被雪藏的名人、探洞探险家、外贸公司老板、跨境电商、涉外律师、公证处人员、吃火锅的人、吃辣食的人、被烫了嘴的人、埃及法老、外星人、牙医、看牙医的人、厨师、面点师、火把传递者、偷金子的人、知名大盗、侠盗、侠盗小说作者、名侦探、推理大师、评论家、支教、昭君、假小子、刁蛮公主
                在物
                壁炉、矿洞、火山口、火锅、亮光的皮鞋、火葬的棺材、埃及法老陵墓、不明飞行物、飞碟、带灯的飞行器、带灯的交通工具、闪光的无人机、陨石、太阳神鸟、凤凰、乌鸦、渡鸦、星链、探照灯、火炬、《名侦探柯南》贞德、进口商品、煤气罐、炸弹、流星
                在事
                灯光明亮的舞台上讲话／唱歌、接受采访、采访他人、使用取暖器、火葬、使用炉灶、烧冥币、传菜碟、下厨、吃火锅、看牙医、看路过的火车、看天上的流星、看陨石降落、运动会火炬传递、接力赛、与男人发生争执、辣评段子、义工活动、检举揭发。看侠盗剧
                在观感
                明亮的洞、传播光热、揭露黑暗、发光的移动物体、嘴毒心善
                """
                print(tmp)
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """
        星曜名称 武曲
        归类 财星
        属性 金
        振动形态：重力钝压
        在人
        武警、安保、门卫、司法刑法人员、检察官、金融行业人员、武术家、运动员、健身教练、工业行业人员、市场营销人员、牙科／外科医生、 DJ 、矿物相关人员、体力活动人员、肌肉结实的人、肌肉男、钢材厂人员、举重运动员、铁匠、铸剑师、武术指导、公安人员
        在物
        金属物体、钱财、银行、公安机关、政府部门、健身房、建设器材、工具、机床、钢材、铁艺产品、军火、手术室、金融中心、牙齿、肺、乐器、骨头、钻石、玉石、矿物、肌肉、冰淇淋、冰箱、牙齿、鼓
        在事
        金属伤害、手术、官司、健身、谈钱、经济、工程项目、铸造、接触金属、运动、训练、被检查、军火、战争、打斗、整牙、咳嗽、疼痛、冰冻、转账、取款、收账、举重、被压、看牙科、拔牙、盖章、压实、搬重物、敲锣打鼓
        在观感
        质地坚硬的、现实的、直来直去的、有能力的、武力值高的、酷的、勇敢的、冰冷的、无情的、权衡利弊的
        """
        print(tmp)
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌宫独坐 
    武曲贪狼在辰、戌二宫会照。主要星曜会合虽然与丑未的武曲贪狼同度相同，
    但因不会破军，所以性质有所改善。在性格方面容或相近，即同样有耿直而豪爽的
    个性，且有才艺，但在际遇方面却要顺遂一些，少经一些波折，同时所具的才艺较
    易受人欣赏，故成就亦较佳。 
    不过若武曲与禄存相会之时，则与丑未宮安命的人相同，反易变成自私自利。 
    武曲在辰戌宫为人[天罗地网]，因此一般主迟发。古人云：[武曲会贪狼，少年
    不利。]又说：[武曲墓中居，三十才发福。]，所指的即是迟发。现代社会个人从事
    事业较古人为晚，因此秀发的年龄亦可能拖迟，依照笔者的经验，有延迟至接近四
    十岁然后才卓然建树者，读者不妨参考。 
    武曲不喜在天罗地网中化禄，嫌其受化禄的羁糜，令人失去雄心壮志，因小名
    小利而不思进取。但却喜化权，使人生多一点表现。 
    在天罗地网中，化权及遇煞都可以刺激武曲守命的人奋发有为，可是性质却不
    相同。化权者是出于对权力争取的上进心，因而人生的途径便比较坦易；若遇火星、
    擎羊的刺激，则人生道路便较崎岖，必经一波三折然后有成。若陀罗同度，则反易
    变成因循苟且的人。所以武曲陀罗同宫，最宜以专门技艺安身立命。 
    武曲化科，在罗网中无甚利益，见煞曜同度，主有巧汹名。不见煞则宜从事财
    经工作。 
    在辰戌的武曲，若有左辅、右弼、天魁、天钺、文昌、文曲拱会同度，更见
    化禄、化权、化科者，最为上格。或武曲化忌或对宫贪狼化忌，更见擎羊、陀罗者，
    无辅、佐、禄曜及天寿化解，少年时有灾病甚重，煞凶诸曜成集，福德宫所会星曜
    又不佳者，则有夭折的危险。若能廷寿，则中晚运始觉顺遂。 
    女命武曲，不喜人天罗地网。虽诸吉并集，亦嫌夫妻感情欠温柔体贴，若煞集
    命宫，少年坎坷，且有堕落风尘险。大限流年命宫见武曲坐辰戌，一般来说，主经过困扰而后顺利，所以碰到不如意的
    事，不可灰心。见武曲化忌，提防有争财或财物被盜等。在商者主周转困难。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 武曲贪狼
            属性 金＋水＋木
            在人
            米粮商人、面馆商人、摊贩商人、酱板鸭商人、军警、瑜伽师、古典民族舞老师、杂技演员、酒吧老板、酒庄老板、酒店老板、投标人、销售、公关、酒水销售、巡警、刑警、酒驾交警、美杜莎、法海、捕蛇人、猎人、和尚、画家
            在物
            冰淇淋、蛇、屎、电梯、酱板鸭、警犬、水泥、面团、面条、大米、冰啤、滑冰鞋、溜冰场、推车、滑板、货车、麻将、骰子、弹珠、水晶球、玉石、沙包
            在事
            招投标、水泥施工、拉推车、查酒驾、溜冰、滑雪、看杂技表演、吃面、吃米饭、在推车摊贩买东西、搬家、搬东西、压腿、咏春拳、太极拳、乞讨、赌博、赌石、拳击、摔跤、举重、掐脖子
            在观感
            又硬又软、又硬又滑、又冰又滑、又直又曲、软和硬的接触、刚柔并济、直线和曲线同时在一个画面
            """
            print(tmp)
        if(len(star) == 4):
            if(star == "武曲天府"):
                print("武曲天府\n")
                if(dizhi == "子" or dizhi == "午"):
                    tmp = """武曲天府在子、午两宫同度，而且同居旺宫。武曲性刚，天府性柔；虽同为主
    财帛的星曜，可是武曲主创业理财：天府主守成，主守财；因此这两颗星曜会合，
    未免使易生矛盾，唯其矛盾冲突的程度则不如紫微天府之强烈。 
    碰到这种命宫的星系结构，应该先检视福德宫。福德宫贪狼独坐，若会火星铃星，则性情急躁，容易失去命宫夭府那种谦厚的优点，但却增强了刑事曲的刚耿之
    气。若会擎羊、陀罗、地空、地劫、大耗等曜，则为人多争多气，且易染不良嗜好，
    亦失去命宫星曜那种擅于守财理财的特性，逢空劫主人孤立，更见天姚，则为权术
    阴谋之人。见吉曜会合，尤其是左辅、右弼、文昌、文曲、天福、天贵等曜，始主
    人温俭恭良，能攻能守。 
    又须检视其父母宫，若煞星并临，则幼年难得父母荫庇，教养可能不善，因此
    命宫星曜的性质冲突，可能变成进退失据。 
    武曲天府宜见化禄，主财源丰厚，但却不喜见禄存同宮，虽富亦主悭贪，性格
    略嫌自私；武曲化权，则武曲的力量增加，而天府的力量相对減少，因此利于开创，
    可以进财；武曲化科，虽主事业顺遂，但不宜好高鹜远，只要略会一两点煞星，都
    易招失败。唯天府化科则主在钱财方面信誉甚好，不易跟人借债、透支，但却是信
    用非常好的债务人。 
    最嫌武曲化忌，主事业失败，钱财周转困难；若更见煞曜，可致一败涂地。 
    此外，更有一些特殊的星曜组合性质，读者应加留意―― 
    武曲天府居于午，不会煞主有寿。 
    武曲居子，见天马，宜远涉重洋，于异国立业。 
    武曲天府守命，对宫必为七杀，若七杀与擎羊同宫，则主因财而持刀动武。 
    武曲天府与火星、铃星同度，更见大耗、劫煞，则易招盜贼抢劫。 
    武曲天府坐命，若夫妻宫破军所会的星曜不吉，夫妻刑克相当重，宜晚婚，婚
    后又有配偶出门外居等事。女命主妻夺夫权，早婚或配偶年龄相当者，易成怨偶。 
    女命最嫌武曲化忌坐命宫，会照煞星，主健康不佳，易患癌症，或对夫、子均
    有刑克。若会文昌、文曲；咸池、大耗；谦贞、天姚，则个性轻佻，对异性易生情
    愫，又易为有妇之夫追求，唯化禄、化权，化科等曜会福德宫者可以自制自律。 
    大限流年命宫为武曲天府，见化忌主事业失败，钱财困扰；不宜再见羊、陀，
    易因财兴讼，更见天刑，有牢狱之灾。若见地空、地劫，主突招困厄，财帛周转不
    灵；若见化禄，则财源茂盛，更逢辅、佐吉曜，机遇频频，宦勇往直前进取。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲七杀天府
                    属性 金＋火＋土
                    在人
                    检察官、军警、安保、银行经理、打铁工人、矿工、市场管理、工商管理、武术指导、金融教育、投资人、收藏家、银行行长、银行大堂经理、冶炼厂厂长、工厂管理、代理商、建材老板、铁艺家具老板
                    在物
                    工厂、仓库、保险柜、货架、金库、健身房、金属材料、矿物、铁艺床、铁艺家具、收藏品、兵器、武侠小说、军火、呼吸道、牙床、检察院、法庭、警局、工业学院、石墩
                    在事
                    健身、撸铁、采矿、制造、铸造、冶炼、打架、打仗、打官司、进警局、进银行、看牙齿、足球比赛、工业制造、压制
                    在观感
                    具有重量感的物体收藏、有价值的产品投资
                    """
                    print(tmp)
            elif(star == "武曲贪狼"):
                print("武曲贪狼\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """武曲贪狼在丑、未二宫同度，若福德宮星曜吉，则主人长寿。因为这两个宫位
    都同时会合财帛宫的廉贞破军(图八)，所以最喜财帛宫的星曜吉利，如见化禄、化
    权，则命宫因之生色，主人精神物质生活都觉丰富。若廉贞化忌，则不宜强自出头，
    否则恐招烦恼。 
    对于武曲贪狼，古人认为[主少年不利，先贫后富]。其实这是专指[武曲贪狼火
    星同宫]的情况而言。若无火星或铃星，則反主少年享受，青年以后却必须力求进取，
    然后始可保福荫。 
    武曲贪狼见火、铃，即不同宫亦主暴发，但不宜再见化忌或羊、陀，否则即使
    暴发，亦有暴败，最宜及时引退，持盈保泰。 
    武曲贪狼同宫，擅长交际，且耿直豪爽的性格易为朋友欣赏。但若见煞曜化忌，
    及大耗、地空、地劫等曜，则切忌赌博，否则可以倾家，亦不宜流连花酒。 
    一般来说，武曲贪狼守命的人都有才艺，若见煞星，宜学习专门技术谋生，若
    不见煞，且有天魁天钺会合，则可手握经济重权；更见禄马交驰，在他邦可成巨富。
    最喜武曲化科，会合廉贞化禄、破军化权、一生权重禄厚，可成财经界巨子，
    或在政府主掌财权。 
    女命见吉曜者，主为女中豪杰，若见天刑，虽婚姻不利，但自身事业财帛可比
    美男子。一般来说，武曲贪狼的女命，比武曲独坐的女性为佳，可以内外兼顾，不
    致专注于事业，对丈夫亦刚中有柔，见天姚或咸池同宫者，更富女性吸引力。 
    大限流年武曲贪狼，见吉曜者须留意事业机会。若贪狼化忌，则宜留意改变处
    事的方针或目标，不可坚持原定计划。若武曲化忌，以守成为宜，不可贸贸然盲目
    发展。星同宮，则虽有意外的幸运，但亦有意料不到的挫折危机。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲贪狼
                    属性 金＋水＋木
                    在人
                    米粮商人、面馆商人、摊贩商人、酱板鸭商人、军警、瑜伽师、古典民族舞老师、杂技演员、酒吧老板、酒庄老板、酒店老板、投标人、销售、公关、酒水销售、巡警、刑警、酒驾交警、美杜莎、法海、捕蛇人、猎人、和尚、画家
                    在物
                    冰淇淋、蛇、屎、电梯、酱板鸭、警犬、水泥、面团、面条、大米、冰啤、滑冰鞋、溜冰场、推车、滑板、货车、麻将、骰子、弹珠、水晶球、玉石、沙包
                    在事
                    招投标、水泥施工、拉推车、查酒驾、溜冰、滑雪、看杂技表演、吃面、吃米饭、在推车摊贩买东西、搬家、搬东西、压腿、咏春拳、太极拳、乞讨、赌博、赌石、拳击、摔跤、举重、掐脖子
                    在观感
                    又硬又软、又硬又滑、又冰又滑、又直又曲、软和硬的接触、刚柔并济、直线和曲线同时在一个画面
                    """
                    print(tmp)
            elif(star == "武曲天相"):
                print("武曲天相\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """武曲天相于寅、申二宫同度。由于天相的影响，武曲刚直的性质得以调和，所
    以处事就比较随和。不妨将前述两个星系的性质，跟本宮性质比较一一武曲天府同宫，是靠天府的
    谨慎来调和武曲的刚直，所以为人刚中有柔；武曲贪狼同宫，是靠贪狼的圆滑来调
    和，所以物欲虽深而世故；武曲天相不如武曲贪狼的圆滑但具正义感而非世故；不
    如武曲天府之刚柔并济，但却乐于为人服务。这是武曲性格受到不同星曜调和吋，
    表现出来的差别。 
    但武曲天相的对宫为破军，因而对武曲天相星系亦有强烈的影响。假如有煞曜
    在命宫或与破军同宫，特别是当擎羊陀罗夹命宫的情况下，则主为人主观强烈，可
    能成为独具的随和性质便非常之弱，变成外表随和，内心激烈，而为人服务的性质
    亦变为统治欲的增加。由此可知评定这星系结构的要点。 
    若不遇煞忌，则武曲天相反喜会合昌曲，可从事政冶、财经工作。遇煞则不过
    聪明巧艺。最忌见擎羊，若会天刑、化忌，主易有争讼。 
    关于女命及大限流年的性质，可参考前两种星系的叙述。唯关于婚姻方面，女
    命主夫有外遇，否则容易生离，这本星系的特色。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲破军天相
                    属性 金＋水
                    在人
                    园林工程师、建筑工程师、建筑工人、钱币铸造师、呼吸科医生、军警、矿工、玉石商、皮革商、雇佣军、焊工、铸造工人、海军、健身教练、拳击手、保镖、材料厂人员、钢材批发人员、工匠、雕刻师、战争片演员、模具制造商、水库管理、玻璃厂人员、加工厂人员、出版社人员
                    在物
                    玉石、皮革、铁管、水管、钢管、破碎的瓷器、破碎的玻璃、单面镜、山水摆件、模具、瓷砖、工艺画、工艺品、瀑布、都江堰、水库、水闸
                    在事
                    砸墙、检查、铁焊、健身、打拳击、照单面镜、玉石拍摄、开原石、打磨玉石、手工制作、模具制造、复印、盖章、复刻光碟、拧水闸、参观水库、切割
                    在观感
                    硬物的破坏、军事任务、检查通过、压制复印、石头和高低活水
                    """
                    print(tmp)
            elif(star == "武曲七杀"):
                print("武曲七杀\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """武曲七杀于卯、酉二宫同底，星曜结构非常之强列必须得左辅右弼拱照，更得
    会化禄或禄存，人生的际遇后始得顺遂，否则容易孤立无援而破财。 
    本星系结构的特性，是敏锐而性急；有谋略但无远见；精明能干但易赶尽杀绝，
    亦必得左右昌曲的调和，然后才变成聪明精练而不流于短虑薄情。若更逢化禄、化
    科、天马会照，则福泽悠厚。 
    在卯宮安命，化忌或遇煞，古人说有木压雷惊之灾，在现代社会，则为遭遇土
    木压伤及触电。在酉宫安命，化忌或遇煞，主意外不测，易生癌症，或脑部疾患。
    卯酉二宮安命，火铃同度，则为财利之事而生意外，再见武曲化忌及劫杀、阴煞或
    大耗同度，则有盗劫之灾；擎羊同度，主因财利而动武。――若所会的廉贞化忌，
    则应提防血光之 
    灾，或生病动手术。 
    由于星曜强烈，所以主其人作事有魄力有毅力，但亦主青少年吋不利，必须经
    过奋斗然后有成，尤其不可投机，应从事公职，或经营实业，亦可在财经界工作。
    卯酉宫安命，财帛宫廉贞贪狼有禄存同度或在对宫冲照者，并有天马及吉曜会合，
    为英雄末路遇贵人之象（图九)，主于困境中突然发迹变泰。 
    倘命宫会合火、铃、羊、陀、空、劫、刑曜，宜从事军警或保安工作。煞太多，
    则为屠夫。若有文星，或见禄权科会，则宜作外科医生；会谦贞化忌，则以妇产科
    为宜。 
    若然煞刑等曜，见禄马，反宜经商。 
    女命武曲七杀，配夫年长八年以上者为宜。 
    大限流年命宫武曲七杀，主有较大幅度的变动，吉凶须详所会合的星曜而定。
    若化忌星，则有停职、倒闭的危险。见煞者更蹭蹬，且健康不佳。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲七杀天府
                    属性 金＋火＋土
                    在人
                    检察官、军警、安保、银行经理、打铁工人、矿工、市场管理、工商管理、武术指导、金融教育、投资人、收藏家、银行行长、银行大堂经理、冶炼厂厂长、工厂管理、代理商、建材老板、铁艺家具老板
                    在物
                    工厂、仓库、保险柜、货架、金库、健身房、金属材料、矿物、铁艺床、铁艺家具、收藏品、兵器、武侠小说、军火、呼吸道、牙床、检察院、法庭、警局、工业学院、石墩
                    在事
                    健身、撸铁、采矿、制造、铸造、冶炼、打架、打仗、打官司、进警局、进银行、看牙齿、足球比赛、工业制造、压制
                    在观感
                    具有重量感的物体收藏、有价值的产品投资
                    """
                print(tmp)
            elif(star == "武曲破军"):
                print("武曲破军\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """武曲破军于巳、亥二宫同度。古人对这结构甚不恭维，有[武曲破军难贵显]的说
    法，这个观点，可跟[武曲闲宫多手艺]的说法，彼此联系起来。 
    凡武曲破军坐命的人，多喜研究专门技能，即使会合禄存、化禄、文昌、文曲，亦
    主对财经事业有专门甚至冷门的知识，决不会大行大路，从事一般性工作。若命宫
    有煞曜同度，则更宜以巧艺安身。
    在古代，具专门知识以及巧艺的人，一般社会地位不高，尤其是科举时代，所
    以便有[难贵显]的说法。在现在，若命宫会合辅佐渚曜，或见化禄、化权、化科，
    则可能是飞黄腾达的专业人才，如工程师、理工科教授、财经教授、财经主管之类。
    即使见煞，亦可凭技艺谋生。
    一般来说，武曲破军守命者不宜经商，但若事业宫的紫微贪狼见禄马，或见火
    铃，则可有突发机会。 
    女命武曲破军，主有男子气慨，若见诸吉更见天刑，必为社会知名人士，但不
    利婚姻。 
    女限流年武曲破军，有变动的机会。是否变动得好，应详所会星曜吉凶而定。
    最畏化忌，有停职失业的危险，更见擎羊天刑，或须动手术。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲破军天相
                    属性 金＋水
                    在人
                    园林工程师、建筑工程师、建筑工人、钱币铸造师、呼吸科医生、军警、矿工、玉石商、皮革商、雇佣军、焊工、铸造工人、海军、健身教练、拳击手、保镖、材料厂人员、钢材批发人员、工匠、雕刻师、战争片演员、模具制造商、水库管理、玻璃厂人员、加工厂人员、出版社人员
                    在物
                    玉石、皮革、铁管、水管、钢管、破碎的瓷器、破碎的玻璃、单面镜、山水摆件、模具、瓷砖、工艺画、工艺品、瀑布、都江堰、水库、水闸
                    在事
                    砸墙、检查、铁焊、健身、打拳击、照单面镜、玉石拍摄、开原石、打磨玉石、手工制作、模具制造、复印、盖章、复刻光碟、拧水闸、参观水库、切割
                    在观感
                    硬物的破坏、军事任务、检查通过、压制复印、石头和高低活水
                    """
                    print(tmp)
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳、亥二宫独坐 
    天同在巳、亥二宫同度，对宫必为天梁。所以基本性质与[天同天梁]相同。 
    天同最喜居亥宫，其次为巳宫，可以使人一生多享受。但如果没有辅、佐吉曜
    来会照，又不见禄，则可能是事业平凡，收入平衡却讲求享受的人。财业不足以支
    持享乐，处顺境尚可，一见逆境，即便可能成为听天由命的人，影响一生事业。所以[天同天梁]同宫者，由于享受心理没有天同独坐巳亥的人那么强，因此也
    就少了一点流离浪荡的色彩。 
    在本宫，不怕见煞。古人说：[福星独坐，见煞反为南]，指的即是这种星系构，
    因煞星反能減少天同的享乐本质，使人生增添了进取；主力。最佳的星系组合是：
    天魁钺、文吕、文曲、左辅、右弼会合，略见火、铃、羊、陀、空、劫一二点煞曜，
    則反叮主贵显。天同再化禄星，则既贵且富。从事政府职务，或公用服务企业，可
    成行政主管。若对宫的天梁勺天刑、擎羊会照命宫，则是很好的外科、儿科医师。 
    但天同在亥，却最怕化忌，若会煞、刑、空劫诸曜帮多于四点或以上者，古人
    称为奴婢之命，服务社会的十七质转化成力昝人作嫁，或其至成为专受别人差遣。
    古人说：[天同在亥，最畏忌星躓，男女奴婢]，这是指这种星系结构。 
    ――在巳宫安命者较吉，有辅、佐吉曜化解者亦吉。但无论巳亥两宫安命者，若见
    煞刑凶曜在四点以上者，则有终身残疾之处，或一生多主孤克。 
    女命天同坐巳、亥，主额高鼻直，体能丰盈适度，容貌美丽，所以易招异性追
    求，婚后仍多蜂引诱，若失足，终身婚姻不幸。 
    其余见化曜的性质，以及大运流年吉凶，可参考[天同天梁]一节。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合
            天同天梁
            属性
            水＋土＋气
            在人
            老人与小孩、教书的老人、教授、老师、历史／生物／农业／地理／医药／玄学老师、命理师、农民、农业科研人员、生物医药科研人员、保险推销、金融信托人员、非物质文化遗产传承人、文物保护单位人员、国家栋梁人才、律师、陪审、护工、保护救助流浪小动物协会成员、老人养大的小孩、救助失独老人义工
            在物
            摇篮、儿童医院、儿童医药、养老院、敬老院、疗养院、少管所、石油、古老的微生物、国家保护动物、弹力球、孵化箱、学习工具、琥珀、盆栽、微生物、水藻、细胞、实验器皿、医疗器皿、弹力球
            在事
            推摇篮、上儿童医院／疗养院／养老院／少管所、逛博物馆、陪同出庭、陪同爬山、掩护特务、看谍战片、救助流浪动物、援助流浪者、陪伴旅游、陪伴流浪、陪同探险、保险赔付、使用信托、保护非物质文化遗产、保护文物、保护农作物、写研发医疗论文、玄学研究、培育土壤、救助失独老人
            在观感
            年幼与年代久远的、研发／保护／学习／包裹年代久远的、圆形的和波浪形的、圆形年代久远的
                                """
            print(tmp)
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """在卯、酉二独坐 
天同在卯、酉二宫独坐，对宫为太阴，基本性质与天同太阴同度者相同，但不
宜见擎羊同度，主身体伤残。 
若见天魁、天钺、文昌、文曲，主人性好文艺，再会桃花诸曜，则更宜从事演
艺，尤其适宜歌唱表演。 
天同在卯、酉宫喜见禄，无论禄存或化禄，均主人生的境遇平顺，可以悠闲享
受。 
女命虽喜美容打扮装饰，但感情不易受困扰。唯若桃花诸曜在命宫同度，则必
惹游蜂浪蝶。 
天同化禄，可增加财禄享受；化权则事业多表现；化科增加声誉，最宜表演工
作者，女命天同在卯西二宫化科，艳丽异常。 
大限流年命宫天同独坐卯酉，主平淡而享受。若化忌星，则主住宅或办公室装
修或搬迁。煞忌刑曜毕集，则因享乐懈怠而招尤怨；若更桃花遍集，防生殖系统疾
病；无桃花者则防肝气疾患。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同太阴
            属性 水
            在人
            带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
            在物
            湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
            在事
            孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
            在观感
            暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
            """
            print(tmp)
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌二宫独坐 
天同在长、戌二宫独坐，对宫必有巨门来会，基本性质与天同巨门同度者相同。
主要性质为是非口舌。化解之道，为从事口舌性质的工作，如教师、推销、公关、
传播等行业。 
可是此种星系结构，却是[机月同梁对巨门]的格扁，仍然带有为社会服务及担
任公职的色彩，所以虽然化禄会禄，仍然不宜从商。最喜丁年生人，古人说[天同戌宫为反背，丁人化吉主大贵]，其实辰宫亦定。在辰宮，丁年生人，为天同化权、太阴化禄、天机化科、巨门化忌的会合，若
从事政治，或担任大企业职务，主历艰辛而有甚高成就，即使加煞，亦可从事教育、
文化工作，必名利齐来。(图十三) 
在戌宮，除了化禄、化权、化科、化忌毕集之外，天梁更得禄存同度，所以初
期的人生境遇比辰宫安命者更艰苦，可是中年以后的成就却非辰宫所可比拟，此为
否极泰来的命局。 
女命在感情困扰上，不如天同巨门同度者之甚，即使遇煞，产生苦恋，最后亦
终因种种变迁而得正式结合。 
本宮其余性质，以及大限流年运程，可参考[天同巨门]一节。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同巨门
            属性 水＋土
            在人
            车保推销员、守门员、外卖员、快递员、4s店老板、导游、守墓人、车友俱乐部成员、副驾驶、把风的小偷、偷包贼、护士、幼师、图书管理员、宠物店老板、游乐园老板、牙医、律师、加油站人员、博主、文化教育咨询、小学老师、乘务员、园丁、同性恋
            在物
            蜂巢、快递箱、包裹、车保合同、学步车、小摩托、儿童车位、外卖、小吃、寿司、罐头、保险柜、小盒子、很小的洞、卡丁车、婴儿车、救护车、面包车、保姆车、小型车、洞中的卵、泡泡、气球、输卵管、幼儿园、书柜、衣柜、宠物笼、扭蛋机、蛋盒、小孔、传输的文件包、知识分享、加油站、喷壶、洒水车、厕所、莲蓬
            在事
            吃回转寿司、玩卡丁车、推学步车、买卖车保、吹泡泡、吃豆子、打开柜子、穿衣服、戴口罩、带牙套、朗诵、辩护、给车加油、输液、撒尿、洒水、看洒水车、上幼儿园、吹气球、肛交
            在观感
            守护黑洞、传送包裹、洞口传输液体
                    """
            print(tmp)
        if(len(star) == 4):
            if(star == "天同太阴"):
                print("天同太阴\n")
                tmp = """
                星曜组合 天同太阴
                属性 水
                在人
                带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
                在物
                湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
                在事
                孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
                在观感
                暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
                """
                print(tmp)
                if(dizhi == "子"):
                    tmp = """天同太阴在子、午二宫同度。但在子宫二曜皆入庙旺，在午宫则二曜失陷，所
以性质亦有不同。 
天同太阴在子宫，男女皆对异性有吸引力，而自身亦对异性温柔体贴。加上太
阴感情丰富、天同温文有礼的本质，所以很容易惹起感情纷扰。尤其是女性，天同
太阴坐命本已婚主擅长修饰美容，若有一二点煞星同度，则更觉容貌美艳夺目，肤
色白皙，体态丰满，所以易吸引异性追求，若福德宫太阳巨门加羊、陀，则很容易
失足，以致姻缘不利。 
若于迁移宫有擎羊相照，因擎羊的激发，反主其人能以武职荣身，宜从事军警
或保安工作。 
天同太阴安命，必会天机天梁，是为[机月同梁]格。由于财帛宮借会太阳巨门，所以除利于服务公职，或参加大机构大企业工作外，尤特別利于从事与外国人有关
的事，或受外国人提拔。若禄枚科会命宮，而太阳巨门化忌见刑曜者，则可成为律
师，或从事司法、立法。 
天同化禄，主人生活安适，有生活情趣，但亦增加困扰的力量；若太阴化禄，
则天同必同时化权，天机必同时化科，为[机月同梁]的大格，可成为政要或企业首
脑。 
天同化权比化禄更佳，使天同太阴受到激发，事业亦更易发展，人生亦多坦途。
但若太阴化权，虽使人多内才，擅权变，可是一生的事业亦多变动。女命逢之，应
较主动处理感情问题。 
天同化忌，于子午二宫不妨。太阴亦不畏于子宫化忌，唯于午宫化忌时，男女
皆对女亲不利，但却对数理科技有特殊天才： 
天同不喜见化科，若更见文曜，一生易受爱情痛苦。但从另一方面来说，却亦
甚宜从事文教、文化事业。从事学术研究，亦必有成就。 
大限流年天同太阴命宫，主事业有良好变动，若会吉曜，则动静皆宜。见四煞、
空劫，则先破后成。
"""
                    print(tmp)
                    print("\n")
                elif(dizhi == "午"):
                    tmp = """天同太阴坐午宫，若逢煞曜，古人认为主[肢体贏黄]及[男女飘蓬]。此皆因二
曜同时落陷的缘故，若日生人更甚。 
 但若同时有擎羊同度，则是[马头带箭]的大格，主掌握兵权，立战功于边域。但
必须经历艰难险阻然后富贵。在现代，未必有立战功的机会，若从事工业，亦可白
手兴家。但以不再会其他煞曜始为合格。若见煞忌，则人生更多坎坷，而成就亦不
如合格者之大。 
                    天同太阴安命，必会天机天梁，是为[机月同梁]格。由于财帛宮借会太阳巨门，所以除利于服务公职，或参加大机构大企业工作外，尤特別利于从事与外国人有关
的事，或受外国人提拔。若禄枚科会命宮，而太阳巨门化忌见刑曜者，则可成为律
师，或从事司法、立法。 
天同化禄，主人生活安适，有生活情趣，但亦增加困扰的力量；若太阴化禄，
则天同必同时化权，天机必同时化科，为[机月同梁]的大格，可成为政要或企业首
脑。 
天同化权比化禄更佳，使天同太阴受到激发，事业亦更易发展，人生亦多坦途。
但若太阴化权，虽使人多内才，擅权变，可是一生的事业亦多变动。女命逢之，应
较主动处理感情问题。 
天同化忌，于子午二宫不妨。太阴亦不畏于子宫化忌，唯于午宫化忌时，男女
皆对女亲不利，但却对数理科技有特殊天才： 
天同不喜见化科，若更见文曜，一生易受爱情痛苦。但从另一方面来说，却亦
甚宜从事文教、文化事业。从事学术研究，亦必有成就。 
大限流年天同太阴命宫，主事业有良好变动，若会吉曜，则动静皆宜。见四煞、
空劫，则先破后成。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "天同巨门"):
                print("天同巨门\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """天同巨门在丑、未二宫同度。巨门为是非口舌是挠，故天同与之同度，其优点
    便亦不能发挥，宜从事以口才为主的工作，女命则可教授化装、发型、插花、烹饪，
    即以口传授一种享受的学问。若从事行业性质的不同，则一，生易招口舌。 
    天同巨门必须会合文昌文曲，或天魁天钺，或左辅右弼；或左辅右弼在命宫左
    右相夹而魁钺会照，则可富可贵。宜任公职教职，或在大企业、服务性行业工作。
    亦可从事广告传播等业(尤其是播音、音乐行业)。唯少年不免坎坷，人生亦不免比
    较辛劳，须勤奋然后始可获致成就。 
    天同巨门坐命，有一个特殊的格局，是丁年生人，同宫地劫，因丁年生人擎羊
    在未，即有擎羊与地劫同宫或会照(图十及图十)一由于财帛宫无正曜，须借入其对
    宫的太阳天梁，所以整个星系结构，便变成是天同巨门、太阳天梁、天机、擎羊、
    地劫的行业、社会工作、教育界、或传播界任事，可成为领导人物。若命宮有桃花
    或文曜，则 
    可从事音乐表演，或在文化界成名。 
    此外还有一个奇格。于未宫安命，无正曜，借丑宫的天同巨门为用，称为[明珠
    出海格]。(若丑宮无正曜，借未宮天同巨门者不入此格)古人认为[明珠出海，财官
    双美]。(图十二)此宫星曜，得太阴太阳会照，又有天梁影响巨门的性质，将是非口
    舌争讼化为对学术的深刻探讨(探讨学问其实亦是口舌与争讼，古人称之为[自讼]，因要深入研究一门学问吋，
    必须今日之我与昨日之我互相交诤，然后学问才有进步)，将此星系性质妥为利用，
    可名誉彰显，为人赞颂。倘[明珠出海]更见左辅右弼夹丑宮或未宫，遇文昌文曲、
    天魁天钺，格局更佳；乙、丁、辛、癸年生人尤佳，事业局面甚大。 
    天同化禄，增加享受；巨门化禄，增加收入；若天同化权，则必会天机化科及巨
    门化忌，虽婚姻状态改善，男丰得贤美之妻，女主得才干之夫，但自身则多口舌是
    非；巨门化权，增加说服力，且是非口舌性质为之消減。若属[明珠出海格]而巨门
    化权，则为优秀的司仪或法律人才，甚宜对公众发表意见。天同化忌，增加人的辛
    劳。 
    大限流年命宫见天同巨门，亦主辛劳是非，见煞刑忌曜会照更甚。宜有辅佐吉
    曜扶持。若见[明珠出海]，则必有升迁之吉，或福禄喜庆重来。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 天同巨门
                    属性 水＋土
                    在人
                    车保推销员、守门员、外卖员、快递员、4s店老板、导游、守墓人、车友俱乐部成员、副驾驶、把风的小偷、偷包贼、护士、幼师、图书管理员、宠物店老板、游乐园老板、牙医、律师、加油站人员、博主、文化教育咨询、小学老师、乘务员、园丁、同性恋
                    在物
                    蜂巢、快递箱、包裹、车保合同、学步车、小摩托、儿童车位、外卖、小吃、寿司、罐头、保险柜、小盒子、很小的洞、卡丁车、婴儿车、救护车、面包车、保姆车、小型车、洞中的卵、泡泡、气球、输卵管、幼儿园、书柜、衣柜、宠物笼、扭蛋机、蛋盒、小孔、传输的文件包、知识分享、加油站、喷壶、洒水车、厕所、莲蓬
                    在事
                    吃回转寿司、玩卡丁车、推学步车、买卖车保、吹泡泡、吃豆子、打开柜子、穿衣服、戴口罩、带牙套、朗诵、辩护、给车加油、输液、撒尿、洒水、看洒水车、上幼儿园、吹气球、肛交
                    在观感
                    守护黑洞、传送包裹、洞口传输液体
                    """
                    print(tmp)
            elif(star == "天同天梁"):
                print("天同天梁\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """天同天梁在寅、申二宫同度，亦属[机月同梁]的格局。但虽然[机月同梁作吏人]，
[吏人]的性质却应属于[循吏]而非恶吏。因为二曜同宫，主为人品德高尚，内圆外
方，心性溫和善良，即使恶曜煞曜相加，亦不过一生多遭遇需要化解的困难而已，
并不主品格因之变坏。 
喜遇辅、佐吉曜，但却不喜禄存、化禄及天马。无禄马者可从事文化、传播、
广告事业，亦宜社会服务工作：有禄马者则可从事娱乐事业，唯易与异性发生刻骨
铭心，但却不能结合的恋情。 
天同化禄或天梁化禄，易增加感情上的无谓困扰，女命尤其不利，会终生迹成
苦恋，然而却主事业进展，经一番磨练，即有突发表现；天同化权或天梁化权亦主
感情困扰，唯宜从事服务性工作，且无事忙碌；天梁化科，则宜从事文化工作，或
电视艺员、电影明星，因易得知名度，且以露面为宜。但化科亦主增加感情困扰。 
若天同人忌，再见刑曜，宜从事监察、纪律工作。唯男女皆婚姻不利。 
大限流年见天同天梁，空劫、煞曜、刑耗并集者，主灾病或宫非，或甚至有刑
克六亲，企业破产之事；见辅佐吉曜，则多新机会，且主增添人口，财喜叠叠。若
见桃花诸曜，则将产生畸恋。 """
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 天同天梁
                    属性 水＋土＋气
                    在人
                    老人与小孩、教书的老人、教授、老师、历史／生物／农业／地理／医药／玄学老师、命理师、农民、农业科研人员、生物医药科研人员、保险推销、金融信托人员、非物质文化遗产传承人、文物保护单位人员、国家栋梁人才、律师、陪审、护工、保护救助流浪小动物协会成员、老人养大的小孩、救助失独老人义工
                    在物
                    摇篮、儿童医院、儿童医药、养老院、敬老院、疗养院、少管所、石油、古老的微生物、国家保护动物、弹力球、孵化箱、学习工具、琥珀、盆栽、微生物、水藻、细胞、实验器皿、医疗器皿、弹力球
                    在事
                    推摇篮、上儿童医院／疗养院／养老院／少管所、逛博物馆、陪同出庭、陪同爬山、掩护特务、看谍战片、救助流浪动物、援助流浪者、陪伴旅游、陪伴流浪、陪同探险、保险赔付、使用信托、保护非物质文化遗产、保护文物、保护农作物、写研发医疗论文、玄学研究、培育土壤、救助失独老人
                    在观感
                    年幼与年代久远的、研发／保护／学习／包裹年代久远的、圆形的和波浪形的、圆形年代久远的
                    """
                    print(tmp)

    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """在寅、申宫独坐 
    谦贞在寅、申宫独坐，对宫必为贪狼。正次桃花星曜相会，无论男女，都主具
    有才华而且易受人欣赏。但却易有酒色财气的嗜好。 
    若在寅宫，丙、辛、乙、戌年生人，为[廉贞清白]的格局；在申宫，甲、己、
    庚、癸年生人，亦属此格。主要是利用擎羊或陀罗之力，克制桃花的性质；或利用夫妻宫得禄，弥补七杀坐守的缺憾，所以女命虽主艰辛，但却为人贞烈，可以相夫
    教子，家庭幸福。 
    在申宫还有一个大格。当廉贞在申宮独坐之时，七杀必在午宫，则廉贞的阴火
    燃烧七杀的阴金，有如火炼矿苗，可先历艰辛而成大器，亦为[雄宿乾元格](请与廉
    贞七杀坐未宮的[雄宿乾无格]参看)。有吉星而不见煞忌刑耗诸曜者乃富贵双全上上
    之局。 
    廉贞独坐申宫，最嫌火星同度，因火星落陷，与廉贞同宫之时，破坏了[雄宿乾
    元]的格局，反主人遭逢蹭蹬，有自杀之心。唯见禄可以化解，虽多是非，或逢逆境，
    仍能雨过天晴。
    在寅宫安命，则无上述的格局。 
    无论男女，在命宫会禄存或化禄者，亦是[廉贞清白]的格局，可担任行政、财
    经工作，亦可经商，但以经营带艺术色彩，或美观的消费品为宜。若会文吕文曲，
    则其人哗爱好书画艺术，对色彩敏感，可经营艺术品行业，亦可学书画艺术为副业。
    但若不见化禄、禄存，而见地空地劫同度，则以从事工程、设计为宜，亦可学习专
    门技艺以谋生。 
    大限流年命宫见廉贞独坐寅、申二宮，不畏廉贞仆忌，因有紫微天相在财帛宫
    会合，可以转化为小灾病，前一些麻烦讨厌的毛病，如皮肤敏感暗疮之类。但若煞
    有介事曜刑曜同临，则仍须注意避免纠纷，及生病动手术。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 廉贞贪狼
            属性 电＋木＋水
            在人
            赌徒、嫖客、艺术家、画家、诗人、吸毒人员、缉毒警察、刑警、交警、烧烤店老板、咖啡店老板、夜宵店老板、赌场老板、鉴黄师、养殖场老板、毒贩、电玩达人、情色按摩店老板、情色邪教人员、烟酒店老板、茶楼老板、麻将馆老板、纹身店老板、巫师、通灵师、妖精、编导、舞蹈老师、美术老师、电网公司从业人员、电玩店老板、网吧老板、牧场老板、宠物店老板、宠物医院老板、加工食品厂老板、琴师
            在物
            博彩机、电子游戏、茶叶、烟酒、烧烤、咖啡、壁虎、变色龙、毒蛇、哺乳动物、带毛的动物、生殖器、肝肾、荷尔蒙、内啡肽、奶茶、苦瓜、南瓜、葡萄、狐狸、猫狗、麻药、迷药、蛊毒、颜料、涂料、油漆、化工品、磁疗仪器、香水、精油、蛊毒、毛虫、蜈蚣、烙印、陷阱里的猎物
            在事
            吃烧烤、喝咖啡、抽烟喝酒、赌博、嫖妓、玩电游、养宠物、看黄片、画画、喝奶茶、酒水里下迷药、下毒、绑架、 SM 、游泳、弹琴、吟诗作赋、写毛笔字、解剖、做实验、磁疗、电击皮肤、炙烤、刺青、纹绣、宗教仪式舞、性爱、下蛊、邪教双修、瑜伽、烙刑、越狱、玩电游
            在观感
            生殖器充血、网状曲线、炙烤的动植物、禁欲、诱捕猎物、扭曲分裂、有毒的、诱惑的
            """
            print(tmp)
        if(len(star) == 4):
            if(star == "廉贞天相"):
                print("廉贞天相\n")
                if(dizhi == "子" or dizhi == "午"):
                    tmp = """廉贞天相在子、午二宫同度，会照事业宫的武曲、迁移宫的破军，以及财帛宫
    的紫微天府，星曜强烈。所以无论是否会照煞曜，皆主无父祖事业，纵有亦必因社
    会环境变迁而破败，但自身却有另寻出路的能力。 
    在性格上，则为负责任、重感情，处事谨慎，但亦畏首畏尾，所以开创性不强，
    仅能服务于他人。但若与禄存或化禄相会或同度，则能按部就班，逐渐升迁至主管
    首脑之职。但却只宜守成，不利破旧创新。若是经商，亦宜与八合股，不宜独资。 
    最嫌廉贞化忌，主人橫发橫破，富贵不耐久。尤其是当廉贞化忌又遇桃花诸曜
    之时，主人于境遇顺利，事业有成吋流连风月，徵歌逐色，于是因酒色而招破败。
    见这种星系结构的人，宜于有成之后自律。 
    廉贞会文昌文曲，则主人能有自制力，反主好礼义，再见禄存或化禄则添星系
    的致富能力。 
    若廉贞与擎羊同度，主多招是非，更见天刑或空劫，主词讼或倾败。若擎羊与
    迁移宫的破军同度，不利出门远行。丙年生人廉贞化忌，更主客死异乡。若见吉曜
    化解，如辅、佐诸曜，及天德、解神、天寿、天福等曜会照，则仅主在异乡招惹纷
    扰。再逢天月，则主异乡染病。 
    廉贞天相若见四煞、空劫、刑曜咸集或会照，则有不测之祸，或因病动手术，
    多主肾石、胆石、膀胱结石，或瘤肿，且一生有内脏敏感、皮肤过敏的疾患。倘廉
    贞化忌，则有意外压伤，或蛇犬兽类咬伤，或受意外而有血光之灾。 
    女命不见禄存、化禄、文昌、文曲，即使不遇煞曜，亦主易受感情欺骗，倘见煞曜，或见桃花诸曜重者，须防失足。 
    大限流年命宫见廉贞天相，喜见昌曲、或流昌流曲，化禄，或流禄人命或会照，
    则有升迁之吉，或事业扩展。若化忌与天刑同会，则主脓血之灾，或动手术。女命
    于是年生育则可免。倘然忌刑并临。无昌曲禄解救，则有性命之虞，或牢狱之灾。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 廉贞破军天相
                    属性 电＋水＋水
                    在人
                    海关人员、游客、出国人员、宾馆前台、警察、消防员、海员、邮轮乘务员、程序员、秃头的人、头发稀少的人、植发的人、戴假发的人、混血儿、外国人、变性者、同性恋、双性恋、少数民族、游牧民族、诈骗犯、签证官、科研人员、导演、媒体人、翻译、旅行社老板、旅客、外事人员、殖民者、犹太人、非洲人、屠夫、凶手、皮肤科医生、整形医生、血液科医生、精神病人、植发机构老板、宾馆老板、电子商贸从业人员、跨境贸易人员、物流人员、电子产品回收人员、维修工、手术医生、魔术师、电台播音员、卧底、拆弹专家、保密局人员、纳粹
                    在物
                    假发、护照、照片、摄像头、摄像机、邮轮、海港、 vr 、 ar 、智能科技产品、离婚证、门票、入场券、打印机、复印机、投影仪、电视机、电脑、电讯塔、无线电、电箱、变压器、核电站、化工厂、手机、翻译机、复读机、广告牌、显示屏、海市蜃楼、全息投影、3d打印、大头贴、仿真物、油画、照片质感画、肖像画、科幻小说／电影、渔网、捕鱼小镇、冲蚀地貌、殖民地、迷雾、雾霾、烤乳猪、熏制品、腊肉、风干肉、葡萄干、蔬菜干、水果干、泡菜、人造加工食品、致癌物、钻石、宝石
                    在事
                    拍照、拍摄、过关口、出国、出海、乘坐邮轮、变性、灭火、溺水、破译、翻译、鬼上身、画画、画肖像画、画油画、画3d图、看全息投影、钓鱼执法、拍戏、表演、看剧／电影／小说、雷雨、暴雨、潜水、抽血、打针、做手术、死亡、幻觉、植发、模仿秀、超级变变变、突破结界、乱伦、下毒、奸杀、鸳鸯浴、性交、观赏宝石、观看万花筒、织毛线
                    在观感
                    在物
                    流通中间突破关卡、复制粘贴、伪装诱捕、逼真仿制、制造幻觉、线条交织
                    """
                    print(tmp)
            elif(star == "廉贞七杀"):
                print("廉贞七杀\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """廉贞七杀于丑、未二宫同度，会合武曲破军、紫微贪狼、迁移宫天府，虽星曜
    强烈，但受对宫天府影响，却主其人虽勇于开创，然而却仍小心谨慎，尤其擅长理
    财，不致因一时之意气风发而误事，唯贪溺于享乐则仍不免。 
    廉贞受七杀的影响，多改变之心，所以不宜在一机构任职过久，否则心情苦闷。
    亦不能克享祖业，或守父业，甚至不喜继承父亲所从事的行业。由于多变的缘故，
    所以人生也就难免须经历艰辛。 
    廉贞七杀喜变动的性质，使人适宜于从事行政职位；由于廉贞的桃花性质受七
    杀影响，亦使人对文艺有爱好，尤其喜欢诗词音乐，所以若见昌曲加会，则亦可从
    事文艺工作。倘如煞忌并集，则难免多不良嗜好，文艺的色彩化风花雪月，易沉迷
    酒色。不过无论如何都仍有节制，不致因酒色倾破。 
    由于星系结构富改变性，虽擅理财，亦只宜与人合作创业经商，且不宜居领导
    地位，否则事业发展不顺。有一二煞曜会合，宜从事理工或工艺。 
    未宫安命，有昌曲，见禄，无煞忌诸曜，为[雄宿乾元格]，主经历艰辛而得富
    贵。若煞轻者，亦可储蓄勤俭致富。 
    廉贞七杀坐命宫主呼吸器官弱，若红鸾天喜同宫及对照，则易患哮喘。若化忌星
    且见陀罗同度，多脓血之灾；化忌更见四煞并照，而无化禄或禄存及昌曲解救，一
    生体弱，或竟致夭折。四煞并照且逢刑事忌者，血疾，如白血球过多、先天贫血之
    类。 
    廉贞化忌且见四煞并照，古人有[路上埋尸]之说，于丙干大限(如丙子、丙寅之
    类)或丙年须特别小心，不宜远行。 
    女命廉贞七杀，必貌美，不易受异性引诱，夫妻宫必为天相，不见煞忌，婚姻
    幸福，且宜夫唱妇随，共同必展业，但容易因无满意对象而迟婚。尤以丈夫年长八
    年以上者为宜。 
    大限流年廉贞七杀主有变动，会吉曜则升迁扩展，或加薪，主有积蓄，会煞曜
    则不宜变动。若刑忌并临，尤其是武曲化忌会廉贞化忌者，不见禄存化禄，尤须防
    血光之灾，不宜远行，切戒争讼。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 廉贞七杀天府
                    属性 电＋火＋金＋土
                    在人
                    仓管、酒店管理／前台、大堂经理、电子厂厂长、智能家居店老板、电路设计工程师、宿管、化工厂厂长、屠夫、养殖场老板、假发店老板、代理商、传销人员、宗教人员、道长、精神病院院长、狱长、卫生巾销售、电网从业人员、农民、凶手、熏制品销售、通讯入户专员、物业管理、园林设计师、园林工程师、修剪树木的人、集团公司老板、连锁店老板、穆斯林、犯罪团伙成员
                    在物
                    电路图、户型图、化工材料、血库、带血的行李箱、法院、法庭、卫生巾、陷阱、网吧、思维导图、电网、菜园、蜘蛛、电箱、变压器、电子厂、仓库、监狱、迷宫、毒药、 k 粉、床上的血、床上的手机、酒店、智能家居、电动床、电动沙发、工棚、植物园、花园、晾晒的腊肉、电线、插线板
                    在事
                    电路设计、巡逻、囚禁、上网、探监、被拘禁、发展下线、招代理、代理产品、屠宰、诱骗拘禁、剪断电线／电话线／网线、
                    在观感
                    网和仓库、支线收纳、剪断支线、发展支线
                    """
                    print(tmp)
            elif(star == "廉贞破军"):
                print("廉贞破军\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """廉贞破军在卯、酉二宫同度。三方四正星曜会合强烈，所以主不守祖业，亦无
    父母荫庇， 白手兴家自立。 
    在性格方面，从好来说是坚毅刚忍，既有冲击力，但仍顾全公益与正义，而且
    有理想抱负，是良好的创业人才；但从坏的方面来说，则嫌人生不够安定，无法安
    生，一生为开创而劳心劳力。 
    由于星曜的性质主变动，所以不宜经商，否则容易见异思迁，不守一业，而且
    可能因理想太高而致投机倾败。但虽然作为雇员，却仍主受雇主指派，时时担任开
    创性的工作。如机构之内一时无开创性工作，则容易被派负担领导多个部门。亦主
    兼职兼差，以致劳尽费力。 
    如命宫中桃花诸曜毕集，则容易成为领导异性工作的主管，或行业性质与异性
    有关。 
    但无论如何，凡命宮廉贞破军坐守者，幼年必多灾病，若父母宮会煞，则主幼
    年即与父母无缘，及至出身，办必饱历变动艰险，然后有所成就。所以从享受方面
    来说，本宮星系并不主福泽。
    最喜廉贞化禄或禄存会合，则虽辛劳仍能宝贵。遇文昌文曲则更能表现出高尚
    的业余爱好，而且减少人生路途的崎岖。 
    如果四煞会照，则是政府机构的中下层行政人员，但亦宜学习技艺，古人说，[廉贞破军逢四煞，主巧艺以安身。] 
    但如果煞曜太多且落陷，则一生多是非门争，而且易患神经衰弱及心脏疾患，
    亦常易有皮肤敏感等症。若煞忌刑曜并照，则有倾家之官非。 
    丙年生人廉贞人忌且煞曜，若命宮有天刑同度，须防交通失事。――廉贞化忌，
    遇破军天刑，这组星系结构即使不在命宫而在迁移宫，亦主在外地发生交通意外。
    若见擎羊于对宫(即星系在命宫时，迁移宫见擎羊；或星系在迁移宫时，于本宫或命
    宫见擎羊)，则祸尤烈。此性质以廉破星系在酉宫时更准确，不可不防。趋避之道，
    反宜投身军警，或作验血液研究等工作。 
    廉贞破军在酉宫，火星同度，因火星落陷之故，成为坝不同的星系结构。其人
    性格固少亲情，而且反叛性格奉重。若廉贞化忌，更见天刑者，则容易因事业失败
    而生自杀之心。 
    女命廉贞破军，丈夫有外遇者，反可白头廝守。故宙以事业为重，否则徒然橫
    生波折。如命宮或福德宫桃花咸集，则自身于婚后，亦易为人追求。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 廉贞破军天相
                    属性 电＋水＋水
                    在人
                    海关人员、游客、出国人员、宾馆前台、警察、消防员、海员、邮轮乘务员、程序员、秃头的人、头发稀少的人、植发的人、戴假发的人、混血儿、外国人、变性者、同性恋、双性恋、少数民族、游牧民族、诈骗犯、签证官、科研人员、导演、媒体人、翻译、旅行社老板、旅客、外事人员、殖民者、犹太人、非洲人、屠夫、凶手、皮肤科医生、整形医生、血液科医生、精神病人、植发机构老板、宾馆老板、电子商贸从业人员、跨境贸易人员、物流人员、电子产品回收人员、维修工、手术医生、魔术师、电台播音员、卧底、拆弹专家、保密局人员、纳粹
                    在物
                    假发、护照、照片、摄像头、摄像机、邮轮、海港、 vr 、 ar 、智能科技产品、离婚证、门票、入场券、打印机、复印机、投影仪、电视机、电脑、电讯塔、无线电、电箱、变压器、核电站、化工厂、手机、翻译机、复读机、广告牌、显示屏、海市蜃楼、全息投影、3d打印、大头贴、仿真物、油画、照片质感画、肖像画、科幻小说／电影、渔网、捕鱼小镇、冲蚀地貌、殖民地、迷雾、雾霾、烤乳猪、熏制品、腊肉、风干肉、葡萄干、蔬菜干、水果干、泡菜、人造加工食品、致癌物、钻石、宝石
                    在事
                    拍照、拍摄、过关口、出国、出海、乘坐邮轮、变性、灭火、溺水、破译、翻译、鬼上身、画画、画肖像画、画油画、画3d图、看全息投影、钓鱼执法、拍戏、表演、看剧／电影／小说、雷雨、暴雨、潜水、抽血、打针、做手术、死亡、幻觉、植发、模仿秀、超级变变变、突破结界、乱伦、下毒、奸杀、鸳鸯浴、性交、观赏宝石、观看万花筒、织毛线
                    在观感
                    在物
                    流通中间突破关卡、复制粘贴、伪装诱捕、逼真仿制、制造幻觉、线条交织
                    """
                    print(tmp)
            elif(star == "廉贞天府"):
                print("廉贞天府\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """廉贞天府于辰、戌二宫同度。二星遭到宫，其性质就表观一种默默工作，扁担
    重任的精神。最宜服务于财经机构，或担任企业行政工作，只需会禄存或化禄，即
    可藉年资升迁至领导地位。 
    但廉贞化禄却亦有一个缺点，当与天府同度之时，变得过份小心谨慎，因而开
    创力即嫌不足，人生的发展也就微嫌缓慢。最喜欢对宫的七杀带一点煞曜来照会，
    反可以产生激发的力量，可以使人早有成就。当然亦需要付出代价，那就是要费精
    神于交际应酬之上，同时要身心劳碌。 
    若见文昌文曲，廉贞天府守命的人亦可以成为一个学者，不过即使在学校任教，
    亦易同时兼任行政职务，如大学的系主任，中小学主任校长之类。 
    若天府化科，则其人在文艺方面，必有相当修养，同时容易成名。当科文诸曜
    齐集之吋，其人宜从事文化文艺王作，名利双收。 
    在戌宫安命，若禄文科曜并集，义不主从事文化文艺，反宜基于理想与抱负，
    在空中楼阁中成大事业，虽有成败，终有一层抱负。若同时会煞曜，则仍主于事业
    发展过程中有波折。――在夺宫安命者不是，此乃由于长宫会子宫的紫微，落于生
    地；而戌宫会合午宫的紫微，却为人庙之故。由这个结构的分别，可知星曜庙、旺、
    利、陷的影响。 
    女命廉贞天府，以迟婚为宜，早婚易受爱情打击。 
    大限流年命宮见廉贞天府，主收入有节余，事业有长足进步，会照巫则主升迁。
    见煞忌并临，则有灾病等凶事，或招是非官司，但终可转祸为福。此盖由于紫微及
    天相化解之力。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 廉贞七杀天府
                    属性 电＋火＋金＋土
                    在人
                    仓管、酒店管理／前台、大堂经理、电子厂厂长、智能家居店老板、电路设计工程师、宿管、化工厂厂长、屠夫、养殖场老板、假发店老板、代理商、传销人员、宗教人员、道长、精神病院院长、狱长、卫生巾销售、电网从业人员、农民、凶手、熏制品销售、通讯入户专员、物业管理、园林设计师、园林工程师、修剪树木的人、集团公司老板、连锁店老板、穆斯林、犯罪团伙成员
                    在物
                    电路图、户型图、化工材料、血库、带血的行李箱、法院、法庭、卫生巾、陷阱、网吧、思维导图、电网、菜园、蜘蛛、电箱、变压器、电子厂、仓库、监狱、迷宫、毒药、 k 粉、床上的血、床上的手机、酒店、智能家居、电动床、电动沙发、工棚、植物园、花园、晾晒的腊肉、电线、插线板
                    在事
                    电路设计、巡逻、囚禁、上网、探监、被拘禁、发展下线、招代理、代理产品、屠宰、诱骗拘禁、剪断电线／电话线／网线、
                    在观感
                    网和仓库、支线收纳、剪断支线、发展支线
                    """
                    print(tmp)
            elif(star == "廉贞贪狼"):
                print("廉贞贪狼\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """廉贞贪狼在巳、亥二宫同度。二星落陷，但星曜性质变化繁杂，运势格局的高低，往往相差一点即有天壞之别。 
    廉贞本喜会文曜，但在本宫，若见文昌文曲，反主人生性虚浮，更会一二点桃
    花，如红鸾、天喜、咸池、大耗、沐浴、天姚之类，则有可能成为浮华子弟；若廉
    贞化禄或女照禄存，则更浮荡不堪，多虚少实，有可能因此倾败家业。这时反喜见
    火星或铃星，构成[火贪]、[铃贪]的格局，甲为人虽风流自赏，却有奇才巧艺可以
    相济；更喜见贪狼严禄，則虽一生贫富无定，却可有丰足的享受。 
    廉贞贪狼又为艺术之星，令人对色彩有特殊敏感反应，所以可成为画家或设计家、
    摄影家。若文昌文曲与事业宫的武曲七杀同度，则可从事戏剧或表演。女命亦宜以
    化妆、时装、插花、烹饪为业。 
    在巳亥宫，廉贪二曜不逢煞曜者，主可成为政治人才，其人多政治见解，得经
    历艰苦而当重任。但若文昌与文曲及廉贞化忌齐会，则主人有飞灾橫祸，以不从政
    为宜；若昌曲及廉贞化禄齐会，则反使人蹭蹬，或稍有成就即不思进取，终致牢骚
    潦倒。或勉强经商，但终疏忽业务而失败。 
    巳亥两宫的廉贞贪狼，主人外表圆滑，但内心则少实际，不易感情用事。若见
    廉贞化忌或贪狼化忌，再见羊陀(不忌火铃)、天马、禄存者，则主人四海奔波，艰
    辛劳碌。以出外经商者为宜。若从事军政，则难免雨露风霜之苦。但若煞忌并集，
    不见禄而见天刑、大耗，则主客死他乡。 
    若煞曜轻，无昌曲禄曜化解，见天月拱照，则主染病他乡。 
    本宫星系，不宜廉贞化禄，亦不喜廉贞化忌，但却喜贪狼化禄，主多文酒之会，
    或花酒应酬；且能在应酬中生财；再见火铃，财源丰茂；贪狼化权，则其人有从商
    的欲望与理想，且具竞争性，同时亦易迷恋风月；贪狼化忌则易生感情纷扰。 
    女命廉贞贪狼，精神与物质生活并重，若不见吉曜，且煞忌刑曜相加，则易因
    追求精神的满足或物质生活而失足。若命宫有火星、铃星，但桃花诸曜毕集，则易
    因物质享受充足但精神困扰，宜从事文艺以纾解精神苦闷。 
    大限流年命宫见廉贞贪狼，不宜更变事业，即遇吉曜亦宜守成。若见煞忌刑耗，
    主灾病。若贪狼或廉贞化忌，见桃花，女命防生殖器官疾病，男女皆防血疾及毒病。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        if(len(star) == 4):
            if(star == "天府武曲"):
                print("天府武曲\n")
                if(dizhi == "子" or dizhi == "午"):
                    tmp = """天府武曲在子、午二宫同度，请参看[武曲天府]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """星曜组合 武曲七杀天府
                    属性 金＋火＋土
                    在人
                    检察官、军警、安保、银行经理、打铁工人、矿工、市场管理、工商管理、武术指导、金融教育、投资人、收藏家、银行行长、银行大堂经理、冶炼厂厂长、工厂管理、代理商、建材老板、铁艺家具老板
                    在物
                    工厂、仓库、保险柜、货架、金库、健身房、金属材料、矿物、铁艺床、铁艺家具、收藏品、兵器、武侠小说、军火、呼吸道、牙床、检察院、法庭、警局、工业学院、石墩
                    在事
                    健身、撸铁、采矿、制造、铸造、冶炼、打架、打仗、打官司、进警局、进银行、看牙齿、足球比赛、工业制造、压制
                    在观感
                    具有重量感的物体收藏、有价值的产品投资
                                        """
                    print(tmp)
                elif(dizhi == "丑" or dizhi == "未"):
                    tmp = """ 
    在丑、未宫独坐 
    天府在丑未宫安命，必有太阳、太阴相夹。在丑宫时，太阳在子宫落陷，不如
    在未宫时，太阳在午宫乘旺。所以当在丑宫安命之时，则反能打破保守，寻求突破，
    虽人生因此增加了波动，但却能有较大成就，而且运用钱财的能力亦因此增加。 
    天府居丑未宫，所会合的是迁移宮廉贞七杀、事业宫天相，以及财帛宫借人的
    紫微贪狼(图十五)。比较起来，尹业宫的星曜较弱，而财帛宫星曜则欠安定，所以这个星系很难构成上上之格，即使有辅佐诸曜并集，亦仅能于公职、财经界、企业
    行政岗位上出任首脑。必须是化禄、化权、化科会照，而无煞曜空劫，始能富贵兼
    佣。若更见禄 
    存天马，则宜经商，可以致富，并因财富带来社会地位及名誉。若逢地空、地劫，即使诸吉毕集，亦主其人孤立，虽仍为人尊重，但却感到空
    虚，若田宅宮或夫妻宫、子女宫不吉者，则易有刑伤配偶及子女之痛，或仅有女而
    无子，或须再婚始偕白发，人生难以完美。 
    若吉曜少而煞曜多，则人生更欠安定。四煞并照，则天府的优点全失，变为善
    谋好诈之人。更会合天姚，主权术阴谋。 
    女命在现代社会，亦可从政、从商，成为领袖人物；但婚姻多不如理想，喜欢
    在琐碎事务或家务中驾凌丈夫。若丈夫贴服，则嫌其才智不如自己。但这种缺点不
    大，可以克制改善。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 廉贞七杀天府
                    属性 电＋火＋金＋土
                    在人
                    仓管、酒店管理／前台、大堂经理、电子厂厂长、智能家居店老板、电路设计工程师、宿管、化工厂厂长、屠夫、养殖场老板、假发店老板、代理商、传销人员、宗教人员、道长、精神病院院长、狱长、卫生巾销售、电网从业人员、农民、凶手、熏制品销售、通讯入户专员、物业管理、园林设计师、园林工程师、修剪树木的人、集团公司老板、连锁店老板、穆斯林、犯罪团伙成员
                    在物
                    电路图、户型图、化工材料、血库、带血的行李箱、法院、法庭、卫生巾、陷阱、网吧、思维导图、电网、菜园、蜘蛛、电箱、变压器、电子厂、仓库、监狱、迷宫、毒药、 k 粉、床上的血、床上的手机、酒店、智能家居、电动床、电动沙发、工棚、植物园、花园、晾晒的腊肉、电线、插线板
                    在事
                    电路设计、巡逻、囚禁、上网、探监、被拘禁、发展下线、招代理、代理产品、屠宰、诱骗拘禁、剪断电线／电话线／网线、
                    在观感
                    网和仓库、支线收纳、剪断支线、发展支线
                    """
                    print(tmp)
            elif(star == "天府紫薇"):
                print("天府紫薇\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """天府紫微在寅、申二宫同度，请参看[紫薇天府]一节。 """
                    print(tmp)
                    print("\n")
                elif(dizhi == "卯" or dizhi == "酉"):
                    tmp = """
    在卯、酉 二宫独坐 
    天储在卯西二宫独坐，对宫为武曲七杀；财帛宫借入廉贞贪狼安星；事业宫为
    天相。于酉宮安命时，天府乘旺，所会的天相则人庙；而于卯宫安命时，天府天相
    不过得地。两宫垣性质比较，自以酉宫安命者为优。盖天府天相为斗效中的[对星]，
    当会合之时，彼此的力量可以互相影响。 
    本宮星系，主人喜安定保守，爱享受，但缺乏独特的品味。不过由于对宫武曲
    七杀的影响，则时有难于安定，或无事奔忙的现象。 
    天府化科，则主人有信用名誉，无论从商从政，均可在其行业及有关机构中享
    誉。 
    喜禄存同宮或会照，再得左辅、右弼、文昌、文曲、戈魁、天钺在三方四正相
    会，无煞曜，则事业可如理想，从商音在保守中求发展，而从事财经、行政、企业
    工作害三卯西宮守命的天府不足以担任高峰的重任，但却可肢汽二袖人物的辅佐。若煞曜并会，主人善权诈，且喜对比自己成就大的竞争者背面是非，若与地空
    地协同度，则一生孤立，虽达致高位，终少援助。 
    女命天府坐卯酉宫，因喜保守安定，所以即使有本身业，仍注重家庭的舒适，
    以及婚姻生活的稳定。但命宫若会桃花，则易先同居然后举行婚礼。若煞曜并集命
    宫，则易因种种原因而再婚。且主子息迟得。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    星曜组合 武曲七杀天府
                    属性 金＋火＋土
                    在人
                    检察官、军警、安保、银行经理、打铁工人、矿工、市场管理、工商管理、武术指导、金融教育、投资人、收藏家、银行行长、银行大堂经理、冶炼厂厂长、工厂管理、代理商、建材老板、铁艺家具老板
                    在物
                    工厂、仓库、保险柜、货架、金库、健身房、金属材料、矿物、铁艺床、铁艺家具、收藏品、兵器、武侠小说、军火、呼吸道、牙床、检察院、法庭、警局、工业学院、石墩
                    在事
                    健身、撸铁、采矿、制造、铸造、冶炼、打架、打仗、打官司、进警局、进银行、看牙齿、足球比赛、工业制造、压制
                    在观感
                    具有重量感的物体收藏、有价值的产品投资
                                        """
                    print(tmp)
            elif(star == "天府廉贞"):
                print("天府廉贞\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """天府廉贞在辰戌二宫安命，请参考[廉贞天府]节。"""
                    print(tmp)
                    print("\n")
                elif(dizhi == "巳" or dizhi == "亥"):
                    tmp = """ 
    在巳、亥二宫独坐 
    天府在巳、亥两宫独坐，对宫为紫微七杀，同时亦会照在事业宫的天相，因此
    便造成本宫星曜的独特性质。 
    由于对照紫微七杀，为南斗主星与北斗主星的相会加上紫微驾杀化梳，所以天
    府的保守力受到挑战，若会照辅、佐诸曜，或同度，主其人发展至一个阶段时，突
    遇上司或长辈提拔，于是从此飞黄腾达。 
    但由于天相落陷的缘故，基于[逢府看相]的原则，天相在事业宫无力，也就可
    能拖累命宫的天府，可使人感到烦忙，甚至在事业发展中遭遇意想不到的困扰。尤
    其是当天府独坐，魁钺、昌曲、辅弼无一同宮的时候，其人即使事业进展，仍然会
    慼葦。孤独，当空劫同度时，孤独感更强。 
    所以本宫坐命的人，不喜事业宫的天相有煞曜同度，刪写天相的力量，以致限
    制了自己的地位。因即使对宫紫微七杀及命宫天府有辅佐吉曜同度或会照，碰到天
    相落陷逢煞制的情形，亦难以成为领导人物，一生以不取机构中的最高位置为宜。 
    天府化科，使人有清誉，若更会文星，则更主多才高艺。 
    女命宜在亥宫立命，男命则宜在巳宮，因为亥宫较谨慎保守，擅长理财而不擅
    长运用钱财；而巳宮则较有发展力，较擅长对财帛加以运用。 
    大限流年 
    凡天府独坐，无论在任何宫位，若为大限命宫或流年命宫，在年限之内，均主
    事业缓缓发展，在安定中突遇发达的机会。从商者扩展业务，成为行业中的标青人
    物，雇员则可获升职，受上司委以重任。或结婚生子、喜庆齐来。 
    若逢煞曜，则易失机遇，多空想，多计划，而迟疑不决，事事落后。且多无事
    奔忙，心情苦闷。 
    若再逢化忌及大耗，则有疾病困扰，如胃神经痛、胃寒、胃热之类；否則常遭
    是非口舌，若煞忌刑耗子并逢，则有失业之处，以致无所事事，心情烦闷不安。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    紫微七杀天府
                    属性 土＋火
                    在人
                    经常暴怒的人、烟花爆竹厂商、会展从业人员、房地产开发从业人员、政客、校长、集团公司董事长、董事长秘书、百货商场管理、奢侈品店柜姐、空乘、机长、航空从业人员、鸟类养殖人员、猎人、跑酷运动员、吊威亚特效师、古装武侠演员、政府高官、高级领导、专家、班干部、队长、团长、导游、艺术品／古玩收藏家、拍卖主持人、古董商、瓷器商、发型师、装修师傅
                    在物
                    鹰、鸟、烟花、爆竹、百货公司、商场、火山、射击场、武侠剧、塔吊、高楼、公寓、别墅、城堡、弓箭、火箭、弹射装置、炮弹、飞机、飞行器、国家内务、瞭望台、城墙、地图模型、地形图、艺术藏品、画作、装饰品、瓷器、降落伞、爬梯、逃生装置、贵宾室
                    在事
                    跑酷、爬山、跳楼、爬楼、坐飞机、观看火箭、乘坐火箭、发射炮弹、射击、观看火山、逛商场、爬梯、 homeparty 、观看武侠剧、看武侠小说、打仙侠游戏、养鸟、逛鸟市、被鸟啄、打猎、开会、政治会议、国家党政事项、站在城墙上、站在塔上、观星、看云朵、探讨战术策略、画展、看展、拍卖会、翼装飞行、速降、打理头发
                    在观感
                    从下往上俯冲、从某个角度发射、往中间高处集中、在高处瞭望、重要的位置、一个队伍的最高领导人、提升指导、厚积薄发、俯视
                    """
                    print(tmp)
    if(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "子"):
            tmp = """天姬――太阴在子宫躓度。主人深思熟虑，善谋略，有内才，多权变。一般而
言，主男命富贵，女命荣华。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同太阴
            属性 水
            在人
            带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
            在物
            湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
            在事
            孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
            在观感
            暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
            """
            print(tmp)
        elif(dizhi == "丑"):
            tmp = """天库――太阴在丑宫躔度。在本宮太阳与太阴相会，主人性情豪爽，虽吋有忽
阴忽阳的表现，一时积极，一时消极，但仍得官禄。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳太阴
            属性 火＋水
            在人
            网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
            在物
            灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
            在事
            看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
            在观感
            日月同辉、光照、热度高、传播能力强、距离远 
                       """
            print(tmp)
        elif(dizhi == "寅"):
            tmp = """ 天昧――太阴在寅宫躔度。此吋旭日将升，太阴失辉，所以主人性多犹豫，进
退失据。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机太阴
            属性 木＋水＋气
            在人
            地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
            在物
            细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
            在事
            计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
            在观感
            线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物            """
            print(tmp)
        elif(dizhi == "卯"):
            tmp = """反背――太阴在卯宫忠躔度，古人认为反主大富，唯必须见禄权科等吉化者始
是。在卯宫 
少年不利父母，幼年即离乡背井，且可能过继异姓。见煞忌，男女皆易感情挫
折。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同太阴
            属性 水
            在人
            带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
            在物
            湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
            在事
            孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
            在观感
            暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
            """
            print(tmp)
        elif(dizhi == "辰"):
            tmp = """天常――太阴在辰宫蹭度，月失光辉，本主不利。唯若在本宮得与五行属金之
星曜同度或相会，如陀罗、天哭，更得化禄、化权、化科会照，名为[阴精入土格]，
可参智基础课戎行，握掌女权。在辰宫 
男女命皆不利女亲，若见擎羊同度，对女亲尤其利。见诸吉虽可致富，但只要
有煞忌刑耗诸曜混杂，则婚姻波折及病患与财帛齐来。  """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳太阴
            属性 火＋水
            在人
            网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
            在物
            灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
            在事
            看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
            在观感
            日月同辉、光照、热度高、传播能力强、距离远 
                        """
            print(tmp)
        elif(dizhi == "巳"):
            tmp = """天休――太阴在巳宫躧度，又名[失殿]，主有眼目疾，或近视散光。女命主丈夫
有名无实，常远离家室；或丈夫为人谋而不为家室谋。如有化禄、化权、化科则主
富厚。 
 在巳宫 
主幼年不利，或自身灾病，或幼年父母不全(太阴化忌多主丧父，因父死母亲自
然孤寡)。若会天机化忌或武曲化忌，更见蹭蹬。男命易流连酒色，女命宜迟婚。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机太阴
            属性 木＋水＋气
            在人
            地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
            在物
            细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
            在事
            计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
            在观感
            线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物
            """
            print(tmp)
        elif(dizhi == "午"):
            tmp = """天衣――太阴在午宫躧度，又名[寒月]。主人情感丰富，多幻想，或自作多情。
不利结发配偶，或因结发而受刺激。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同太阴
            属性 水
            在人
            带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
            在物
            湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
            在事
            孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
            在观感
            暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
            """
            print(tmp)
        elif(dizhi == "未"):
            tmp = """天圭――太阴在未宫踴度。虽忽阴忽阳，忽冷忽热，但性情豪爽。唯此宮生人不
利母。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳太阴
            属性 火＋水
            在人
            网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
            在物
            灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
            在事
            看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
            在观感
            日月同辉、光照、热度高、传播能力强、距离远 
                        """
            print(tmp)
        elif(dizhi == "申"):
            tmp = """天潢――太阴在申宫躔度。主为人福厚禄重，善应变、有权术、富幻想、有雄
心。事业发展伟大。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机太阴
            属性 木＋水＋气
            在人
            地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
            在物
            细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
            在事
            计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
            在观感
            线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物
            """
            print(tmp)
        elif(dizhi == "酉"):
            tmp = """天祥――太阴在酉宫躓度，能富能贵，唯不利婚姻。在酉宫 
主为人可得富足，虽少年刑克女亲，但仍可得志。如命主美容，但招惹蜂蝶。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同太阴
            属性 水
            在人
            带着孩子的妇女、产妇、孕妇、保姆、保洁、月嫂、护士、妈宝男、王思聪、张国荣、安保、占卜师、命理师、占星师、房产中介、房产销售、富二代、官二代、养殖户、妇产科医生、月子中心老板、水源保护人员、生殖／排泄系统医生、妇联主任、干洗店老板、服装店老板、陪玩、伴游、守陵人、殉葬人、殉情的人、守护灵、小眼睛的人、奶妈
            在物
            湖水、湖上小屋、圆镜、圆灯、灯泡、洗衣机、洗衣房、网购包裹、服装、夫妻墓、净水器、空气净化器、 wifi 路由器、满月、产卵的雌性生物、哺乳动物、圆形的乳房、窄小的阴道、卵子、蛋、雌激素、益生菌、肠道、尿路、脑垂体、房子模型、珠宝首饰、珍珠、护眼灯、卫生巾、床用品、电脑安全软件
            在事
            孵蛋、养殖、眼保健操、睡觉、陪睡、穿衣、暗中保护、女性维权、怀孕生产、清洗衣物、网购、喂奶、摸胸、做梦、催眠、佩戴护身符、ト卦、算命、晚自习、佩戴首饰、佩戴姨妈巾、上网课、网络授课、陪同看电影、洗胃、电脑杀毒、清理电脑、格式化内存
            在观感
            暗中的守护、安静干净的感受、一会黑一会白、圆形会折射光线的、保护女性、包裹阴柔的
            """
            print(tmp)
        elif(dizhi == "戌"):
            tmp = """  
天助――太阴在戌宫踴度，又称为[月照寒潭格]，主人聪明机智，感情丰富而
近于柔弱细嫩，可以富贵。在戌宫 
主为人重感情，倾向于文艺。宜早婚不宜晚婚，否则婚姻前必多感情困扰。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳太阴
            属性 火＋水
            在人
            网红、游客、灯光师、眼科医生、肠道医生、命理师、天文学家、看演唱会的人、旅行家、自媒体人、占星师、脑科医生、大小眼的人、卖买星空灯的人、使用天文望远镜的人、妇科医生、男科医生、生殖科医生、婚恋主持人、婚恋网站老板、相亲的人、相亲节目嘉宾、老师、网络教育平台老板、公证处人员、网络公益众筹人员、能源从业人员、饰品店老板、金银店老板／前台、热水器制造商、雌雄同体的人、太监、人妖、双性恋、受欢迎的人、社交达人、经济学家、财税人员、假小子、阴柔的男子、眨眼 wink 的人
            在物
            灯光、金、银、珠宝、热水器、内窥镜、男女生殖器、天文望远镜、眼晴、脑、宇宙、星空灯、婚恋网、社交平台、俱乐部、阳光下的湖水、温泉、显微镜
            在事
            看舞台剧、上网课、相亲、联谊、参加社会活动、婚恋主持公证、使用热水器、看天空、看天文望远镜、延时摄影、看风景视频、出名、火葬、女生洗澡、鸳鸯浴、泡温泉、占卜、算命、使用显微镜
            在观感
            日月同辉、光照、热度高、传播能力强、距离远 
                        """
            print(tmp)
        elif(dizhi == "亥"):
            tmp = """天朝――太阴在亥宫躧度，又称为[月朗天门]。主人多谋略，善计划，若化忌
星，反多建树。在亥宫 
加会占星，男女事业皆有成就。女命虽不免感情波折，但终能以家庭为重。男
命则较外向，或不顾家室。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机太阴
            属性 木＋水＋气
            在人
            地铁工作人员、网络运营、 it 从业人员、财务、财税人员、胳膊细胸大的女性、眼睛小四肢纤细的男人、单眼皮的人、韩国欧巴、 rain 、程序员、通灵师、足浴技师、阴柔的男性、抠门的男性、女人缘好的男性、网络工程师、女性产品设计师、扫地僧、家政人员、性工作者、洗浴工作者
            在物
            细雨、下着雨的路、通道里的灯、电脑、网线、水管、江河、小溪、湿地、搓澡刷、催眠怀表、夜晚的小路、路灯下的道路、网红桥、脑神经、视神经、肠道、阴道、内部线条、雨伞、乳腺、睡眠检测仪
            在事
            计算财务、算命、洗澡、洗手、清洗阴道、灌肠、采耳、足浴、睡眠检测、测网速、触摸乳房、性交、站在夜晚的街道上、淋浴、淋雨、看心理医生、催眠、通水管、过滤水源、计算费用、报账
            在观感
            线条灯光、内部线条、网络机械、理财、线条的水、通向内部的条状物
            """
            print(tmp)
        tmp = """ 
以上十二宫太阴的特性，属于一般性咱勺概括。以下为十二宫的通则―― 
凡太阴人命，成其是太阴独坐，男女命皆对女亲不利。男命妨母，母死妨妻，
妻死妨女；女命妨母，母死防自身（可能其实是对配偶不利），晚年妨女。日生人更
甚，夜生人较佳。
太阴人命，男女皆易得异性青睐，于入庙宫位尤甚；陷宫则未必然。夜生人尤
甚，日生人较不易感情用事。所以一般来说，婚姻或恋爱均易生波折。 
太阴在命宫，主人内向，但善用心计，温和耿直，聪明机敏；男命多优秀，女
命多端庄。会文昌文曲者，必有特长或专门技艺。有凤阁及天才同度，则喜书画琴
棋；得桃花诸曜会照，则博学多才，流连花酒风月，亦不失为风流文士。太阴主富，太阳主贵。凡太阴人命，须详所会合的太阳，视其全合星系性质，
而定其人的社会地位。另详命宮太阴，视其会合星系性质，而定其人的富裕程度。
一般来说，太阴守命宜从事公教职务，或文化文艺事业。 
太阴逢煞曜，落于陷宫者主背井离乡，或随娘过继。若落陷而四煞、化忌、天
刑、咸池、天姚、地空、地劫、天月并照，主为人酒色淫邪，又多阴谋，心术欠正。
更会化禄、化权、化科虽可富贵，但虽吉亦虚。 
女命入庙会吉，聪明端庄，重情感，温和而多思虑，可以相夫教子，是为美格，
若会文曜及桃花诸曜，则感情易起波折，甚且不安于室。若在陷地会四煞、空劫、
刑忌，则刑夫克子。  
读者可综合研究以上的叙述，多详所在宮位而定。若太阴有其他正曜同度，则
可参阅有关章节。"""
        print(tmp)
        print("\n")
    if(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """
凡贪狼在命，则身宫不宜见七杀或破军，否则易沉迷酒色，甚至贪花淫奔。即见吉
曜，亦主浮荡。 
女命贪狼独坐，多有嗜好。良好者为绘画、跳舞、美容、摄影、集邮，不良者
则好烟酒赌博。但均必有宗教信仰，唯紫微居对宫迁移，始能研究哲理。 
女命贪狼独坐入庙，见左辅、右弼、天福、天贵、天宫、天魁、天钺主贵；见
禄存、化禄、火星、铃星主富。皆智比丈夫，性情刚毅。若落陷宫，宜为人继室。 
大限流年命宫见贪狼独坐，无煞曜，主去旧更新，财业均有进益；遇化禄、化
权、化科，则有职位升迁之喜，或结婚添人口；见火星铃星，更主得意外财喜，有
突发表现；若见煞刑忌曜，又落陷宫，则主因交际而生灾；或赌博倾家；倘见咸池
天姚，则因色生灾。如妻子生产，则灾化为祥。"""
        print(tmp)
        print("\n")
        tmp = """
        """
        print(tmp)
        if(dizhi == "子"):
            tmp = """在子、午宫独坐 
贪狼在子、午宫独坐，对宫为紫微。由于午宫紫微入庙，所以对子宫贪狼的良
好影响便较大。而子宫紫微落于间地，因此对午宫贪狼的良好影响便较小。 
紫微对贪狼的影响，主要是減少其浮荡的性格，使贪狼坐命的人能倾心于文艺
或宗教哲理。但这种影响亦并不完全见得好，因为当贪狼受紫微钳制之后，亦同时
失去他那种擅长交际的能力，因此虽然志趣较为高尚，但是人生却可能较多波折。
坐子宮的贪狼，既然受紫微的影响力较大，因此反而喜会火星或铃星．以[铃贪
格]较佳，[火贪格]较次，只要不再会其他诸煞，则一生中必有一次暴发的机会，会
禄星更佳。若会空劫、丰陀．则宜以专门技艺谋生，同时时能纸醉金迷，沉埋于酒
色财气之中，而自鸣风雅。贪狼不必会喜曜，在子宫亦不嫌化忌，可以将桃花的性质转化为文艺方面的才
能；申子辰年生人，在子宫安命；
贪狼化权需不遇煞曜，若逢四煞，反主应酬破财。贪狼化禄需用同时见火星铃
星，否则虽主进财但数量不大，却同时易惹桃花。 
盖贪狼入旺，物质欲情欲均深，若煞忌并临，则人
品不足称道。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 紫微贪狼
            属性 土＋水＋木
            在人
            高级客户经理、金融预测分析师、舞蹈演员、演员、杂技演员、公关、高级酒水代理、时尚达人、名媛、上流社交活跃的人、投资人、国家外交官、竞赛冠军、竞标的人、竞拍的人
            在物
            滑梯、水上乐园、大型动物、巨型犬、高级酒水、高级茶叶、高级社交场合、赛事现场、拍品、滑翔伞、恐龙、龙、巨蟒、大蛇、眼镜王蛇、大舌头、长舌、昂贵的宠物、贵宾犬、蜜袋籍、电梯、渔具
            在事
            竞拍、竞赛、预测金融分析、在高处的动物、滑翔、玩滑梯、在水上乐园、看杂技表演、看画展、画画、宠物美容、宠物竞赛、钓鱼、参加酒会、看舞蹈表演、高空杂技表演、形体课、走台步、国标舞、钢管舞
            在观感
            高处滑行、高级情商、在高空柔软的、曲线往中间的 
                    """
            print(tmp)
        elif(dizhi == "午"):
            tmp = """在子、午宫独坐 
贪狼在子、午宫独坐，对宫为紫微。由于午宫紫微入庙，所以对子宫贪狼的良
好影响便较大。而子宫紫微落于间地，因此对午宫贪狼的良好影响便较小。 
紫微对贪狼的影响，主要是減少其浮荡的性格，使贪狼坐命的人能倾心于文艺
或宗教哲理。但这种影响亦并不完全见得好，因为当贪狼受紫微钳制之后，亦同时
失去他那种擅长交际的能力，因此虽然志趣较为高尚，但是人生却可能较多波折。
坐午宫的贪狼。受紫微的影响小，若三方四汇无煞。星恶曜，可掌财政大权，
具雄才伟略，称为《木火通明格》。会禄存或化禄更佳。若有煞曜，是为破格，只宜
经商。亦喜火铃同度，《火贪格》为上，《铃贪格》次之。亦主一生必有突发的机遇。
但[木火通明格]则不必见火铃二曜。 
 若不入[火贪]、[铃贪]或[木火通明]诸格：虽遇禄曜，亦不宜经商，可任职于
消费性行业，或从事文化文艺。倘见桃花诸曜，尤宜从事演艺、化妆、发型、衣饰
等。 在午宫化忌，则主为人夺爱，而且偏向于修饰及装饰方面的才艺。寅午成年生人，在午宫安命，谓之[贪狼]入旺乡，
主人贪小利，且易受感情困扰。
贪狼化权需不遇煞曜，若逢四煞，反主应酬破财。贪狼化禄需用同时见火星铃
星，否则虽主进财但数量不大，却同时易惹桃花。 
盖贪狼入旺，物质欲情欲均深，若煞忌并临，则人
品不足称道。 """
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 紫微贪狼
            属性 土＋水＋木
            在人
            高级客户经理、金融预测分析师、舞蹈演员、演员、杂技演员、公关、高级酒水代理、时尚达人、名媛、上流社交活跃的人、投资人、国家外交官、竞赛冠军、竞标的人、竞拍的人
            在物
            滑梯、水上乐园、大型动物、巨型犬、高级酒水、高级茶叶、高级社交场合、赛事现场、拍品、滑翔伞、恐龙、龙、巨蟒、大蛇、眼镜王蛇、大舌头、长舌、昂贵的宠物、贵宾犬、蜜袋籍、电梯、渔具
            在事
            竞拍、竞赛、预测金融分析、在高处的动物、滑翔、玩滑梯、在水上乐园、看杂技表演、看画展、画画、宠物美容、宠物竞赛、钓鱼、参加酒会、看舞蹈表演、高空杂技表演、形体课、走台步、国标舞、钢管舞
            在观感
            高处滑行、高级情商、在高空柔软的、曲线往中间的             """
            print(tmp)
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """在寅、申宫独坐 
贪狼在寅、申宫独坐，对宫必为廉贞，所以可以肌，人的傲气与机敏，同时亦
宜从事政治，或担任行政职务从与独坐子午二宫时受紫微的影响不同。 
贪狼在寅宫，若有煞曜会照，主人早年显达得志，明而志高气傲，但牢狱之灾
常与事业并来，发不耐久，须抑隐心志，戒行侥弄险，始可持盈保泰。 
贪狼在申宫，早年蹭蹬，一生事业由艰苦奋斗而桌，但常易于成功后沉溺酒色，
结果又归于失败。但若无煞曜、则由白手而成大业，虽受人指责，唯亦受另外一引
起人推崇；若煞忌刑劫并临，则亦有牢狱之灾，或辛霜酸露，流亡异地。 
贪狼在寅申宫，喜火星，为[火贪格]，见铃星则不成格。[火贪格]亦主突发，
见禄存、化禄最佳，不遇其余煞曜及化忌、空劫，可以经商，仍以美观及消费性行
为为宜，看见羊蛇，虽可突发，但不宜经商，宜以美观及消费性行业之技艺谋生。
倘见空、劫，反不宜从事上述行业，可从事设计或理工。 
贪狼不喜见昌曲，主作事多虚少实，不过力豪门貢客。在寅宫见陀罗，名[风流
彩杖]，主因色致祸。 
寅申两宮贪狼化权，女命宜迟婚，否则难得理想象；男命则得能干之妻，唯受
妻子控制财权。亦喜见火星同度，则主有意外财益。从事多与异性接触的行业。贪狼化忌，则桃花化为才艺但仍宜 
廉贞化忌正照，又见煞，主幼年多病，一生多心情苦闷，于运限不吉时不宜出
门远行。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 廉贞贪狼
            属性 电＋木＋水
            在人
            赌徒、嫖客、艺术家、画家、诗人、吸毒人员、缉毒警察、刑警、交警、烧烤店老板、咖啡店老板、夜宵店老板、赌场老板、鉴黄师、养殖场老板、毒贩、电玩达人、情色按摩店老板、情色邪教人员、烟酒店老板、茶楼老板、麻将馆老板、纹身店老板、巫师、通灵师、妖精、编导、舞蹈老师、美术老师、电网公司从业人员、电玩店老板、网吧老板、牧场老板、宠物店老板、宠物医院老板、加工食品厂老板、琴师
            在物
            博彩机、电子游戏、茶叶、烟酒、烧烤、咖啡、壁虎、变色龙、毒蛇、哺乳动物、带毛的动物、生殖器、肝肾、荷尔蒙、内啡肽、奶茶、苦瓜、南瓜、葡萄、狐狸、猫狗、麻药、迷药、蛊毒、颜料、涂料、油漆、化工品、磁疗仪器、香水、精油、蛊毒、毛虫、蜈蚣、烙印、陷阱里的猎物
            在事
            吃烧烤、喝咖啡、抽烟喝酒、赌博、嫖妓、玩电游、养宠物、看黄片、画画、喝奶茶、酒水里下迷药、下毒、绑架、 SM 、游泳、弹琴、吟诗作赋、写毛笔字、解剖、做实验、磁疗、电击皮肤、炙烤、刺青、纹绣、宗教仪式舞、性爱、下蛊、邪教双修、瑜伽、烙刑、越狱、玩电游
            在观感
            生殖器充血、网状曲线、炙烤的动植物、禁欲、诱捕猎物、扭曲分裂、有毒的、诱惑的
                        """
            print(tmp)
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌宮独坐 
贪狼在辰、戌宫独坐，对宫为武曲。武曲为财帛星主，所以最喜贪狼火星，或
贪铃星同度，为[火贪格]及[铃贪格]的最佳宫次，可成巨富，或握经济重权。 
但由于受武曲的影响，主迟发。由命宮起个大限始有作为，所以必须坚忍，抵
受半生的挫折。 
若贪狼化忌，则化桃花为才艺，但仍主有诸般嗜好。若见化禄与羊、陀会照，
主因财纷争，年限命宫贪狼坐辰、戌，见流化禄及流羊流陀者亦然。 
若不成[火贪]、[铃贪]格，有吉曜亦主先贫后富；无吉曜者平常，主技艺生涯；
见煞刑忌曜，则幼年多灾病，或需带病延年。 
本宫星系不宜女命，宜配年长之夫，始偕白首心痛苦，仍有待时间冲刷。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 武曲贪狼
            属性 金＋水＋木
            在人
            米粮商人、面馆商人、摊贩商人、酱板鸭商人、军警、瑜伽师、古典民族舞老师、杂技演员、酒吧老板、酒庄老板、酒店老板、投标人、销售、公关、酒水销售、巡警、刑警、酒驾交警、美杜莎、法海、捕蛇人、猎人、和尚、画家
            在物
            冰淇淋、蛇、屎、电梯、酱板鸭、警犬、水泥、面团、面条、大米、冰啤、滑冰鞋、溜冰场、推车、滑板、货车、麻将、骰子、弹珠、水晶球、玉石、沙包
            在事
            招投标、水泥施工、拉推车、查酒驾、溜冰、滑雪、看杂技表演、吃面、吃米饭、在推车摊贩买东西、搬家、搬东西、压腿、咏春拳、太极拳、乞讨、赌博、赌石、拳击、摔跤、举重、掐脖子
            在观感
            又硬又软、又硬又滑、又冰又滑、又直又曲、软和硬的接触、刚柔并济、直线和曲线同时在一个画面    
                    """
            print(tmp)
        if(len(star) == 4):
            if(star == "贪狼武曲"):
                print("贪狼武曲\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """贪狼武曲干丑、未二宫同度，请参看《武曲贪狼》一节。 """
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "贪狼紫薇"):
                print("贪狼紫薇\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """贪狼紫微在卯、西二宫同度，请参看《紫薇贪狼》一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "贪狼廉贞"):
                print("贪狼廉贞\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """贪狼廉贞在巳、亥二宫同度，请参看[廉贞贪狼]一节 """
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
                
    if(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """巨门在子、午宫独坐，对宫为天机。名为[石中隐玉]格。 
 [石中隐玉]的意思，是指人的才毕不外露，但却能于重要关头有所表现。一一
若为女命，初视之不甚美，但久视之始觉美艳不可方物。盖古人重[男才女貌]，故[石
中隐玉]的意义如此。 
同样是[石中隐玉]的格局，亦有高低的分别。以巨门化禄或化权者为上；禄存
同宫者次之：无化禄、化权、禄桃但加会左辅、右弼、文昌、文曲、天魁、天钺者
更次.若吉化、禄存、吉曜皆不见，而反见羊、陀、火、铃、空、劫者，是为破格。 
 [石中隐玉]的上格，宜从事法律、外交、传播各界，能以口才博取富贵。次格
及更次格局，亦利于从事发挥口才的工作，可以有所成就；若煞星混杂，并不影响
事业的成功，不过在发展时多费周折，而成就亦较次而已。 
 破格者，主人生境遇多困，即富贵亦不耐久。更见巨门化忌，命宫在子者不忌，
于发展时碰到周折，当解决后可更增光彩；但命宮在午则一生多口舌是非。 
 凡[石中隐玉]格，无论如何富贵，一生均以不走最高峰为宜。一旦坐上第一把
交椅，立即成为众人指责的目标，倘勉力周旋，反招更严重是非。不如稍韬光养晦，
吏可仅地位与财富。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机巨门
            属性 木＋土／气
            在人
            命理师、矿工、地道工、律师、快递员、外卖员、扒手、飞车党、小偷、侦探、穿越的人、穿越小说家、探洞探险家、司机、乘客、流水线工人、装箱工人、物流公司老板、消化科／呼吸科医生、无证经营的人、走私犯、管道疏通工人、托运部人员、偷车贼、空姐、飞行员、卧底记者
            在物
            隧道、下水道、地铁、高铁、火车、摩托车、车、山洞、蚂蚁洞、枪、电梯、缆车、索道、食道、呼吸系统、消化系统、行李箱、装着肢体的箱子、棺材、香插、香炉、邮件、包裹、卡丁车、矿车、货车、飞机、交通工具、条状的门、防盗门窗、百叶窗
            在事
            探洞、枪击案、掏肛、抠喉咙、插管、灌肠、开车、送外卖、点外卖、骑车、被偷、遭遇飞车党、争辩、捋思路、坐车、送快递、坐缆车、发邮件、传文件
            在观感
            线路穿梭、条状物与洞、传输、移动的条状物         
               """
            print(tmp)
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌二宫独坐 
巨门在辰、戌二宫独坐，对宫为天同。在这两个宫度，都各有一个奇格。 
巨门坐辰，化禄；与文昌同度，但文昌化忌，此为大富大贵的奇格。此乃藉躔
度戌宮的天同化解文昌忌星为用。――此格唯辛年生人有之。秘云：[巨门辰宫为陷
地，辛人命遇反为奇]，所指的即是这个格局。 
若巨门坐戌，有文昌同度，辛年生人亦各化禄、化忌，唯辰宮的天同，其化忌
为用之力略弱，所以不如辰宫安命的人。 
但戌宫安命，巨门化权或化禄者，亦为奇格(不必见文昌同度)，盖此时太阳在
午，日立中天，可以消解巨门的阴暗。一一此格唯癸年生人，或辛年生人有之。秘
云：[戌宫巨门为陷地，癸辛人遇反为奇]，即是指这种结构。 
辰宮安命者不是，因为所会的太阳落陷。 
除了这两个格局之外，由于辰宫及戌宫为贪狼巨门陷地，又为天罗地网，所以
其他星曜很难配合。煞曜可以生激发力，但落陷的巨门逢煞曜，主一生多是非口舌；
四煞并照，则官讼凶险连连。辅佐吉曜会合，可以减少是非口舌凶危，但却令人易
受羁糜，不能摆脱罗网，因此人生的发展也就有限。 
基于上述的因素，大抵见煞曜者利于从业推销，以期利用煞曜的激发力竞争；
会辅佐吉曜者则宜从事教职，以期保持安定。 
巨门化忌，最喜有一二煞曜同度或凑合，则亦可使忌星得用，人生反而安定。
若有煞曜，但却化权、化禄，则易进退失据，迟疑不决，反而自招困境。 
巨门坐命辰、戌二宫，一般主行至由命宮起计算的第四个大限，光芒始能有所
发越。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天同巨门
            属性 水＋土
            在人
            车保推销员、守门员、外卖员、快递员、4s店老板、导游、守墓人、车友俱乐部成员、副驾驶、把风的小偷、偷包贼、护士、幼师、图书管理员、宠物店老板、游乐园老板、牙医、律师、加油站人员、博主、文化教育咨询、小学老师、乘务员、园丁、同性恋
            在物
            蜂巢、快递箱、包裹、车保合同、学步车、小摩托、儿童车位、外卖、小吃、寿司、罐头、保险柜、小盒子、很小的洞、卡丁车、婴儿车、救护车、面包车、保姆车、小型车、洞中的卵、泡泡、气球、输卵管、幼儿园、书柜、衣柜、宠物笼、扭蛋机、蛋盒、小孔、传输的文件包、知识分享、加油站、喷壶、洒水车、厕所、莲蓬
            在事
            吃回转寿司、玩卡丁车、推学步车、买卖车保、吹泡泡、吃豆子、打开柜子、穿衣服、戴口罩、带牙套、朗诵、辩护、给车加油、输液、撒尿、洒水、看洒水车、上幼儿园、吹气球、肛交
            在观感
            守护黑洞、传送包裹、洞口传输液体 
                       """
            print(tmp)
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳、亥二宫独坐 
巨门在巳、亥二宫独坐，对宫为太阳。在巳宫时，太阳在亥宫为落陷；在亥宫
时，太阳在巳宮为乘旺，巨门藉太阳化解阴暗，所以巳宫的巨门不如亥宫的巨门。 
巳宫安命，由于对宫太阳落陷无力，所以童年即不利父母。见地空、地劫同度
更甚，可能南出生即遭父母遗齐即不然，亦主幼年伤父，须遇房把出始可避免；义
或自卑幼年多灾病，令父母担忧。 
巳宮巨门守命的人，虽少年灾病或坎坷，但仍可学习专门技艺跌谋生，能耐辛
劳，则仍可杀出一条血路。若有禄存同度，则主性情俭朴，亦可致富；倘化禄或化
权，则主为人开创力大，凭专业知识创出伟大事业，社会地位亦高。 
 亥宫巨门守命者，若有化禄、化权或禄存同度，古人认为[名震他邦]，主迁异邦
发福。在现代社会，由于交通发展，亦可以安居本土与异族人来往，得受异族人推
崇及助力。唯亥宫巨门受巳宫太阳对照，阳光强烈，故主人锋芒太露，以致招致是
非尤怨。巨门为是非之挠，固在所难免。 
巨门在巳亥两宫若见文昌文曲、左辅右弼、天魁天钺，可在广告、传播、公关
界发展。倘再见红鸾、天喜、咸池、沐浴、天姚等桃花渚曜，则可从事演艺。若辅
佐古曜与煞曜刑忌并临，则宜学习理工，或专门技艺。"""
            print(tmp)
            print("\n")
        tmp = """ 
 女命见巨门，人庙，得禄，及得化权、化科等占化者，屯富贵长寿。唯巳、亥巨
门仍多爱情烦恼。若落陷、化忌，则多背后是非，且易流为长舌妇人。再见四煞、
天刑会照，荊克甚重，以继室或不举行婚礼为宜，以仍多是非争夺。 
大限流年巨门人命宫，见化禄、化权或禄存同度，主事业发展，若遇是非挫折，
可以反击为凶，适足以助成名徘若会照四煞，主官非或刑克．或遭火灾、盗劫，殆
所谓易招无妄之灾。"""
        print(tmp)
        print("\n")
        tmp = """
        星曜组合 太阳巨门
        属性 火＋土
        在人
        名嘴、记者、经纪人、歌星、命理师、穿越的人、穿越小说作者、能源工程师、煤矿工人、盗墓贼、盗墓小说作者、老师、经济学家、政治老师、公益活动人员、义工旅行人员、肛肠科医生、品牌4s店老板、燃气公司员工、传媒公司人员、企业宣传人员、广告公司人员、被雪藏的名人、探洞探险家、外贸公司老板、跨境电商、涉外律师、公证处人员、吃火锅的人、吃辣食的人、被烫了嘴的人、埃及法老、外星人、牙医、看牙医的人、厨师、面点师、火把传递者、偷金子的人、知名大盗、侠盗、侠盗小说作者、名侦探、推理大师、评论家、支教、昭君、假小子、刁蛮公主
        在物
        壁炉、矿洞、火山口、火锅、亮光的皮鞋、火葬的棺材、埃及法老陵墓、不明飞行物、飞碟、带灯的飞行器、带灯的交通工具、闪光的无人机、陨石、太阳神鸟、凤凰、乌鸦、渡鸦、星链、探照灯、火炬、《名侦探柯南》贞德、进口商品、煤气罐、炸弹、流星
        在事
        灯光明亮的舞台上讲话／唱歌、接受采访、采访他人、使用取暖器、火葬、使用炉灶、烧冥币、传菜碟、下厨、吃火锅、看牙医、看路过的火车、看天上的流星、看陨石降落、运动会火炬传递、接力赛、与男人发生争执、辣评段子、义工活动、检举揭发。看侠盗剧
        在观感
        明亮的洞、传播光热、揭露黑暗、发光的移动物体、嘴毒心善
        """
        print(tmp)
        if(len(star) == 4):
            if(star == "巨门天同"):
                print("巨门天同\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """巨门天同在丑、未二宫同度，请参看[天同巨门]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "巨门太阳"):
                print("巨门太阳\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """巨门太阳在寅、申二宫同度，清参看[太阳巨门]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "巨门天机"):
                print("巨门天机\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """巨门天机在卯、酉二宫同度，请参看[天机巨门]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
    if(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """在丑、未二宫独坐 
天相在丑、未二宫独坐，对宫为紫微破军。但财帛宫皆会照天府。 
比较起来，丑宫所会的天府乘旺、未宫所会的天府则仅为得地，所以丑宫安命
的人较优；从性质一获洗、比较有独立性与上进心；从程度来说，则事业较钉发展，
可取较高的社会地位。 
最喜文昌文曲、左辅右弼问宫或会照，则其人虽从事任何行业，均主带几分文
艺气质。 
不喜煞曜照临。若四煞并照，更见空劫、天刑、天月阴煞、天虚等恶曜，则主
刑克、是非。重者则且致自身社疾。但如煞曜少者，则仍可藉工艺或手艺兴家。 
若吉曜与恶曜并临，不宜经商，恐多遭周旋挫折，但可从事政府职务，或文教工作。亦宜担任秘书、僚幕。 
凡天相坐丑未宫，邻宫必为天同天梁。若己年生入在未宮安命，另一邻宫巨门
与禄存同度，或辛年生人巨门仆禄，即构成[财荫夹印]的格局，主为人一生享受，
不逢波折，事业与财帛皆进步增益。(图十六) 
若天相在丑，则巨门在子，癸年生人禄存与巨门同度，或辛年生人巨门化禄，
亦为[财荫夹印格]。(同图十六)身宫遇[财荫夹印]，与命宫相同。 
 [财荫夹印]，以天梁为荫星，天相为印星，禄存或化禄为财。但禄存不及化禄，
因若邻宫有禄存，命身宫天相必百擎羊或陀罗同度，其吉较次。"""
            print(tmp)
            print("\n")
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 紫微破军天相
            属性 土＋水＋水
            在人
            游泳冠军、模特、广告代言人、演员、艺术团团长、二手奢侈品回收商、高级研究员、空姐、空乘、整形师、个子高的人、高级工程师、装修师傅、画家、冲浪的人、国家机要任务人员、国家间谍、典当人员、设计师、摄影摄像师、高级科研人员、跳水运动员。脑科医生、旅行家、高空坠落的人
            在物
            二手奢侈品、高级护肤品、高级化妆品、香水、高的浪、喷泉、海滩悬崖、典当行、设计感的作品、火箭、电梯、高处的泳池、 vip 通道、水上飞行器、双子塔、空中走廊、廊桥
            在事
            回收奢侈品、小资情调拍摄、录制广告、看模特表演、看剧、高级艺术表演、国画作画、拍卖、设计、整形、美容美发、装修、高级会议、摄影摄像、拍摄高级广告、拍摄国家宣传片
            在观感
            高级又表面的、注重外表的、高雅艺术感的、高处的通道
                        """
            print(tmp)
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """在卯、西二宫独坐 
 天相在卯、酉二宮独坐，对宫为廉贞破军，天相皆落陷宫，所会财帛宫的天府仅
为得地，所以不及在丑，未二宫安命命的格局。主人过于保守谨慎，且多思多虑。 
此种星系结构，命宫最喜见禄存或化禄，若会照廉贞化禄，则增强天相的理财
能力；若会破军化禄，则增强天相的管理及开创能力，都可以帮助事业发展。但天
相为佐贰之星，所以虽有发展，仍不宜独当一面。 
本宫星系结构，亦可构成[财荫夹印]的格局，但由于天相落陷，所以成就较次。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 廉贞破军天相
            属性 电＋水＋水
            在人
            海关人员、游客、出国人员、宾馆前台、警察、消防员、海员、邮轮乘务员、程序员、秃头的人、头发稀少的人、植发的人、戴假发的人、混血儿、外国人、变性者、同性恋、双性恋、少数民族、游牧民族、诈骗犯、签证官、科研人员、导演、媒体人、翻译、旅行社老板、旅客、外事人员、殖民者、犹太人、非洲人、屠夫、凶手、皮肤科医生、整形医生、血液科医生、精神病人、植发机构老板、宾馆老板、电子商贸从业人员、跨境贸易人员、物流人员、电子产品回收人员、维修工、手术医生、魔术师、电台播音员、卧底、拆弹专家、保密局人员、纳粹
            在物
            假发、护照、照片、摄像头、摄像机、邮轮、海港、 vr 、 ar 、智能科技产品、离婚证、门票、入场券、打印机、复印机、投影仪、电视机、电脑、电讯塔、无线电、电箱、变压器、核电站、化工厂、手机、翻译机、复读机、广告牌、显示屏、海市蜃楼、全息投影、3d打印、大头贴、仿真物、油画、照片质感画、肖像画、科幻小说／电影、渔网、捕鱼小镇、冲蚀地貌、殖民地、迷雾、雾霾、烤乳猪、熏制品、腊肉、风干肉、葡萄干、蔬菜干、水果干、泡菜、人造加工食品、致癌物、钻石、宝石
            在事
            拍照、拍摄、过关口、出国、出海、乘坐邮轮、变性、灭火、溺水、破译、翻译、鬼上身、画画、画肖像画、画油画、画3d图、看全息投影、钓鱼执法、拍戏、表演、看剧／电影／小说、雷雨、暴雨、潜水、抽血、打针、做手术、死亡、幻觉、植发、模仿秀、超级变变变、突破结界、乱伦、下毒、奸杀、鸳鸯浴、性交、观赏宝石、观看万花筒、织毛线
            在观感
            在物
            流通中间突破关卡、复制粘贴、伪装诱捕、逼真仿制、制造幻觉、线条交织  
                      """
            print(tmp)
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳、亥二宫独坐 
大相在巳、亥二宫独坐，对宫为武曲破军。由于武曲破军具开创力，所以本宫
安命的人、有坚忍不拔的性格，富开创性，能打开局面而致事业哲成， 
但另一方面。天相会照财帛宫的天府，事业宫借人紫微贪狼来会，在紫微天府两颗主早的照会下，天相使较缺乏独立性，所以不宜自行创业，仅宜为人策划筹谋，
为人开创。但若全左辅右弼、文吕文曲，则虽为人作嫁，们能独生一面。此时以不取最高
位置为宜，宁可权力独立而名义则屈居人下。 
若煞曜刑忌重垂。则宜以工艺谋生。吉煞并临，亦以从事工艺为宫，若从文职，
主多波折。 """
            print(tmp)
            print("\n")
        tmp = """
由于夫妻宫紫微贪狼借人事业宫会照的关系，女命婚姻下利，多感情困扰，宜
配较自已年长的夫婿；但若见武曲化忌，则少闺房之乐；男命亦宜娶年长之妻。但
男女皆主配偶能干。 
凡天相入命身宫，都可能碰到两个持別的格局；前在丑未二宫举[财荫夹印]，
仅为一例，事实上天相于十二宫皆可能成格。 
 另外的一个格局，亦十二宫皆可成格。即擎羊与化忌（绝大多数情形下为巨门化
忌）在左右夹持天相，而天相人命身宫。此称为[刑忌夹印]，盖擎羊化气主刑。遇
此格局，主人有牢狱之灾，或有刑克伤亡等事。 
女命天相人命，一般均主人聪明持重，可以相夫教子。若见化禄、化权、化科、
禄存、左辅、右弼、天马，则一生富贵双全；若会照文昌、文曲、化忌、擎羊，则
主刑伤孤独，以同居或继室为宜，否则易招生离死别。 
大限流年见天相在命宫，喜得左辅、右弼、化禄、化扒化科、禄存、天马会照，
主有喜庆及财禄，用有升迁喜。若与破军、七杀、武曲、擎羊、陀罗会照，则主是
非口舌及宫非，或受人阴损，以致破财，或事业倾败。更遇火星、铃星、天刑、地
空、地劫、大耗、天虛等恶曜，或有刑克，或主残疾。凶煞恶曜多会，则令人有自
杀轻生之心。无吉化及辅佐吉曜解救，甚至可招死亡之祸。"""
        print(tmp)
        print("\n")
        tmp = """
        星曜组合 武曲破军天相
        属性 金＋水
        在人
        园林工程师、建筑工程师、建筑工人、钱币铸造师、呼吸科医生、军警、矿工、玉石商、皮革商、雇佣军、焊工、铸造工人、海军、健身教练、拳击手、保镖、材料厂人员、钢材批发人员、工匠、雕刻师、战争片演员、模具制造商、水库管理、玻璃厂人员、加工厂人员、出版社人员
        在物
        玉石、皮革、铁管、水管、钢管、破碎的瓷器、破碎的玻璃、单面镜、山水摆件、模具、瓷砖、工艺画、工艺品、瀑布、都江堰、水库、水闸
        在事
        砸墙、检查、铁焊、健身、打拳击、照单面镜、玉石拍摄、开原石、打磨玉石、手工制作、模具制造、复印、盖章、复刻光碟、拧水闸、参观水库、切割
        在观感
        硬物的破坏、军事任务、检查通过、压制复印、石头和高低活水
        """
        print(tmp)
        if(len(star) == 4):
            if(star == "天相廉贞"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "子" or dizhi == "午"):
                    tmp = """天相廉贞在子、午二宫同度，请参看[廉贞天相]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "天相武曲"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """天相武曲在寅、申二宫安命，请参看[武曲天相]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "天相紫微"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """天相紫微在辰、戌二宫同度，请参看[紫微天相]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
    if(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午宫独坐 
天梁在子、午宫独坐，对宫必为太阳。天梁本身带孤克刑忌的性质，须藉太阳
的光和热来化解，因此天梁在子的人，较天梁在午者人生多一点温暖。 
所谓孤克刑忌，是指与六亲的关系都有缺陷，如与父母无缘，重则早失怙恃；
兄弟少，或无助力，重则反目防仇；感情有波折，重则与妻子生离死别；子女缘份
不佳，或受儿女拖累。 
 甚至在人际关系方面，亦易陷于落落寡合，甚或遭人指责。 
天梁亦不喜化禄，或见禄存，所以不宜经商。仪以太阳、天梁、禄存、文昌会合
的情况下，得成[阳梁昌禄]的格局，利于典试，故宜从事公教、司法、会计等事业。
喜左辅右弼、文昌文曲同会，可以增加人的地位；若见煞曜，则多遭谗忌。见
化禄同度或会照，则必因财而惹纷扰。幸而天梁有消灾解难的性质，所以终能雨过
天晴。 
天梁在子、午宫安命，切忌锋芒太露，目空一切，随意批评指责他人，若遇煞曜或见禄的星系组合，则必多怨十艮而致遭受报复，情况较佳亦主少人缘。惟若有
吉星祥曜会集命宮，如与文昌或文曲，及天才同度，更见左辅右弼、天魁天钺、三
台八座、恩光天贵、天福天官等吉星祥曜于三方四正，则主在官清廉，经商诚实，
且得人望， 于批评指责时始不招尤怨报复。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 太阳天梁
            属性 火＋土＋气
            在人
            教育家、教育局人员、政法机构人员、历史老师、生物医药老师、名医、脑科医生、心脑血管医生、慈善家、间谍、知名的老人、老男人、年代久远的能源、燃油、弹拉面的人、知名考古学家、地质学家、地震局人员、哲学家、农业／自然／社会老师、品牌金融证券从业人员、知名律师、李春平
            在物
            针织物、围巾、医疗器械、检察院、法院、纪委、沙漠、金字塔、金矿、光波、带灯光的氢气球、热气球、土耳其、甘肃、兰州拉面、硫磺、火山、琥珀、尼泊尔、地毯、地暖、热炕头、烤红薯、阳光下的庄稼／农田／梯田／稻田、历史纪录片、旅游宣传片、动物世界节目、求生节目、社区管理员、养老院、福利院、疗养院、心电图、摩洛哥
            在事
            乘坐热气球、爬坡、欣赏琥珀、法律科普、历史科普、测量心率、慈善公益活动、沙漠旅游、看发光的土、弹拉面、躺热炕头、欣赏大自然、烤红薯、公开批评
            在观感
            光热与波动的、公开引导矫正       
                 """
            print(tmp)
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """在丑、未宫独坐 
天梁在丑、未宫独坐，对宫为天机，且与太阴太阳会合。这种星系结构，宜[日
月并明]，而不宜[日月无光]。在丑宮安命，会巳宫的太阳及酉宮的太阴，日月都在
旺宫，是为[日月并明]，若更见太阴太阳化禄权科者，主人社会地位高超。但亦不
宜见煞忌同度或对照，主常无事生非，多招尤怨阴损。 
在未宫安命，所会亥宫的太阳，以及卯宫的太阴皆落陷位，是为[曰月无光]，
虽见禄权科会，及吉曜祥曜，其地位亦较丑宮安命的人减等。更见煞忌恶曜，亦不
可强自出头，或批评指责别人过失，否则是非阴损不免，须费尽心力始能化解。 
所以在丑宫安命的人，若遇昌曲、魁钺、辅弼，尚可从事司法、审核、监察工
作，若在未宮安命，则以文教或社会工作为宜。 
若天梁与擎羊、天刑同躔，则可成外科、妇科或儿科医师。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 天机天梁
            属性 木＋土
            在人
            桥梁工程师、纺织工人、裁缝、服装设计师、特工、间谍、医疗器械老板、显老的人、律师、打官司的人、命理师、金融行业人员、策划、旅游攻略博主、班主任、教导主任、老师、司机、旅行社人员、导游、文物修复师、流浪汉
            在物
            桥、纺织厂、秋千、巷子、古镇的街道、股市图、 PPT 分析、路线图、针织衫、沉香木、琥珀、氢气长条气球、打气筒、无人机、心电图、拐杖、批注、粉笔、炭笔、毛笔字、扁担、教鞭、古筝、琴弦、吉他、尤克里里、吊桥
            在事
            穿梭巷道、走在桥梁上、桥梁设计、制作 ppt 、炒股、制作旅游攻略、分析计划、织围巾、跟导航行驶、荡秋千、打嗝、开天然气、测量心率、批改作业、流浪、荡吊桥
            在观感
            线条起伏、计划路线、管道气流上升、年代久远的条状物、矫正的线条、弹动的条状物
            """
            print(tmp)
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """在巳、亥二宫独坐 
天梁在巳、亥二宫独坐，落人陷宮。对宫天同虽占，但却增加了天梁的惰性。
因为天同爱享受，而天梁本性是疏懒，因此两颗星曜相会，古人便有[男浪荡、女贪
淫]的说法。 
天梁在本宫所会合的是一明一暗的太阳，以及借人事业宫安星的天机巨门。这
就更加增添了天梁的[浪荡]色彩。若会煞忌刑耗诸曜，则自然流离浪荡，不守一业。
但若有魁钺、昌曲、辅弼、天贵、天福等吉星祥曜会合，则可转化为出国游历，游
学外国，或因公出国。 
若在命宫见天马，又见桃花诸曜，如红鸾、天喜、咸池、大耗、天姚、沐浴者，
始主为人风流贪色，闲荡无所事事，甚至有不良嗜好。更遇擎羊、陀罗同度或会照，
则有灾病，甚至牢狱之灾。与火星、铃星同度或会照，则有虚惊或火险。若煞忌刑
伤并临，且或主人生自杀轻生之念。 
天梁在巳宫安命，主漂泊，多居无定所，宜从事海上工作，或受遣派长居海外。
遇吉曜，则可从事医药或慈善工作。 
但凡安命于巳宫者，每多特殊使命、特殊任务，且多属秘密工作。如会占曜祥曜、则可成帮会领袖，或特工人员。若会羊陀及天刑，于丑年或酉年再会流羊流陀，
则是军必有九死一生之凶险，但终能保全性命。 
 女命天梁居巳、亥宫，易受异性引诱，唯可以后天人事避免。"""
            print(tmp)
            print("\n")
        tmp = """ 
如命宫天梁人庙，会辅、佐、吉化者，主生活享受优游，且多宗教信仰。若落陷
宫。全照四煞者，主人际关系欠佳，半生孤独；再会桃花及空劫、大耗，则宜戒浮
荡之性，否则晚年可能漂泊无依；如会文昌、文曲、天才、凤阁，则必有特殊才艺。
大限流年命宮天梁，必须会吉曜，始主事业发展，职缸歼迁；与禄存或化禄同
度，则防小人排挤；与四煞天刑会照，则丰刑克、灾病，或甚至柯牢批二二灾；若
与空劫、大耗会照，或与天同化忌会照，则可能破产，煞垂者可能残废或遭人阴谋
陷害。"""
        print(tmp)
        print("\n")
        tmp = """
        星曜组合 天同天梁
        属性 水＋土＋气
        在人
        老人与小孩、教书的老人、教授、老师、历史／生物／农业／地理／医药／玄学老师、命理师、农民、农业科研人员、生物医药科研人员、保险推销、金融信托人员、非物质文化遗产传承人、文物保护单位人员、国家栋梁人才、律师、陪审、护工、保护救助流浪小动物协会成员、老人养大的小孩、救助失独老人义工
        在物
        摇篮、儿童医院、儿童医药、养老院、敬老院、疗养院、少管所、石油、古老的微生物、国家保护动物、弹力球、孵化箱、学习工具、琥珀、盆栽、微生物、水藻、细胞、实验器皿、医疗器皿、弹力球
        在事
        推摇篮、上儿童医院／疗养院／养老院／少管所、逛博物馆、陪同出庭、陪同爬山、掩护特务、看谍战片、救助流浪动物、援助流浪者、陪伴旅游、陪伴流浪、陪同探险、保险赔付、使用信托、保护非物质文化遗产、保护文物、保护农作物、写研发医疗论文、玄学研究、培育土壤、救助失独老人
        在观感
        年幼与年代久远的、研发／保护／学习／包裹年代久远的、圆形的和波浪形的、圆形年代久远的
        """
        print(tmp)
        if(len(star) == 4):
            if(star == "天梁天同"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "寅" or dizhi == "申"):
                    tmp = """天梁天同在寅、申二宫同度，请参看[天同天梁]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "天梁太阳"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """天梁太阳在卯、酉二宫同度， 请参看[太阳天梁]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "天梁天机"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "辰" or dizhi == "戌"):
                    tmp = """天梁天机在辰、戌二宫同度，请参看[天机天梁]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
    if(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午二宫独坐 
 七杀在子、午二宫独坐，对宫为武曲天府。子宫的七杀，占人有[武破贪会于子
宫，投河溺水]的说法，虽然这说法尚有待验证，但据笔者的经验，子宮七杀会武曲、
破军、贪狼之时，抵抗煞曜的能力的确变弱，所以一般来说子宫独坐的七杀不如午
宫独坐。 
唯在子、午宫的七杀，仍属美格，主得人提拔，及得朋友协助。若有左辅右弼、
文昌文曲会照，更得对宫武曲化禄或化权相照，宜任武职，或主管财经，占人称为
文武全才。但若四煞并照，更兼天刑、阴煞、天哭、天虚会照，则主阵亡。 
若不会吉曜，亦主为人有谋略，宜从事实业，虽一生不免遭遇一次风波，但亦
必可重张旗鼓。 
若在子、午宫见擎羊、天利，则可作外科、产科或牙科医师。见武曲化禄化权，
必成名医。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 武曲七杀天府
            属性 金＋火＋土
            在人
            检察官、军警、安保、银行经理、打铁工人、矿工、市场管理、工商管理、武术指导、金融教育、投资人、收藏家、银行行长、银行大堂经理、冶炼厂厂长、工厂管理、代理商、建材老板、铁艺家具老板
            在物
            工厂、仓库、保险柜、货架、金库、健身房、金属材料、矿物、铁艺床、铁艺家具、收藏品、兵器、武侠小说、军火、呼吸道、牙床、检察院、法庭、警局、工业学院、石墩
            在事
            健身、撸铁、采矿、制造、铸造、冶炼、打架、打仗、打官司、进警局、进银行、看牙齿、足球比赛、工业制造、压制
            在观感
            具有重量感的物体收藏、有价值的产品投资
            """
            print(tmp)
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """在寅、申二宫独坐 
七杀在寅、申二宫独坐，对宫为紫微天府。当七杀居寅宮时，称为[七杀仰斗]；
若居申宫，则为[七杀朝斗]。二者比较，以申宫较寅宫者为佳。 
 凡[朝斗][仰斗]，皆属美格，主为人管理能力甚强，可以独当一面。所以无论在
何行业发展，皆为主管人员。尤其于命宫或迁移宫见禄存同度吋，更主一一生财帛
不虞短缺。唯若见煞曜同度或会合，则主人生的路径有崎岖起伏。反正七杀坐命的
人一生必有一次重大的波折，轻亦主事业发展停顿，性情苦闷，只要脚踏实地，则
终能渡过难关，所以即使碰到不好的年运，亦不必心灰意冷。 
 七杀[朝斗][仰斗]，一般皆宜出任政府职务，或大机构大企业人事管理、行政
管理人员，亦可以管理工厂，但如会照文昌文曲，或见对宫紫微化科，则亦可以从
事理工方面的学术研究；如见天府化科，则可研究经济或工商管理。只见文曜，则为人师表。 
若煞曜重，又见化忌及天刑、天马、禄存，更有左辅右弼、三台八座拥护，则
可于军警界立足，否则即为会领袖。 
七杀最喜见禄，因禄曜可化解七杀之刚烈。若不见禄而四煞并照，更见空劫、
刑耗，则一生刑克甚重，更主为人刚愎自用，凡处事皆出激烈手段，故虽富贵仍有
破败；且主眼界过高，孤芳自赏，因此生平难免孤寂。此性质可藉后天人事补救。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合
            紫微七杀天府
            属性 土＋火
            在人
            经常暴怒的人、烟花爆竹厂商、会展从业人员、房地产开发从业人员、政客、校长、集团公司董事长、董事长秘书、百货商场管理、奢侈品店柜姐、空乘、机长、航空从业人员、鸟类养殖人员、猎人、跑酷运动员、吊威亚特效师、古装武侠演员、政府高官、高级领导、专家、班干部、队长、团长、导游、艺术品／古玩收藏家、拍卖主持人、古董商、瓷器商、发型师、装修师傅
            在物
            鹰、鸟、烟花、爆竹、百货公司、商场、火山、射击场、武侠剧、塔吊、高楼、公寓、别墅、城堡、弓箭、火箭、弹射装置、炮弹、飞机、飞行器、国家内务、瞭望台、城墙、地图模型、地形图、艺术藏品、画作、装饰品、瓷器、降落伞、爬梯、逃生装置、贵宾室
            在事
            跑酷、爬山、跳楼、爬楼、坐飞机、观看火箭、乘坐火箭、发射炮弹、射击、观看火山、逛商场、爬梯、 homeparty 、观看武侠剧、看武侠小说、打仙侠游戏、养鸟、逛鸟市、被鸟啄、打猎、开会、政治会议、国家党政事项、站在城墙上、站在塔上、观星、看云朵、探讨战术策略、画展、看展、拍卖会、翼装飞行、速降、打理头发
            在观感
            从下往上俯冲、从某个角度发射、往中间高处集中、在高处瞭望、重要的位置、一个队伍的最高领导人、提升指导、厚积薄发、俯视
            """
            print(tmp)
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌二宫独坐 
七杀在辰、戌二宫独坐，入天罗地网，对宫为天府廉贞，星曜柔和，不能帮助
七杀冲出罗网，七杀只得独力挣扎。因此这种星系结构，便使人必须历尽艰辛，终
生以奋斗为人生目标；因而也就风波重垂。 
但虽然于艰苦中创业，其人却绝不满足已得的成就，不断追求理想，而理想却
愈来愈高，新计划亦愈来愈多，所以终生无安适的日子，但其人却以此为乐。 
在辰、戌二宫，七杀不甚畏煞曜，唯畏对宮廉贞化忌，更会重重煞曜，星盘命
宫遇到这样的结构，便须逐一检视其他宫位，看那一宫是他的致命伤。如财帛宮不
占，则一生多钱财方面的困扰纷争；如事业宫不吉，则一生多停业或倒闭；如疾厄
宫不吉，则一生健康不佳，多开刀手术，或多虚惊；如夫妻宫不佳，则生平自多感
情上的波折，或配偶遭逢不幸；如子女宫不佳，则子女或有灾病、夭折，或 
惹官非。 """
            print(tmp)
            print("\n")
        tmp = """
若财帛宫的贪狼化忌会煞曜，则生平多感财源缺乏，且收入永远追不上理想，
但却是由于理想太高，事业扩展过份之故，并不主贫穷。 
 贪狼化忌，必同时见破军化禄于事业宮，更主其人一生唯从事开创，不肯守成。 
若贪狼化禄于财帛宫，不会煞曜，其人则一生有财可供花用，但不事积蓄；若
会煞曜，则仅主手段阔绰，饮宴游乐，交朋结友而不知节制。 
七杀坐辰、戌二宫，皆主其人有所专长，且见解超卓。喜文昌文曲、左辅右弼；
化禄、化权、化科会照或同度，则宜武职文做，或文职武做。或主其人性喜文艺。"""
        print(tmp)
        print("\n")
        tmp = """凡七杀临命，若会煞曜，
人生必有缺陷。或不能富贵，或富贵而配偶刑克分离，或婚姻无缺撼但无子女，或
有女而无子，或有子而自身多疾病。若六亲无缺，身体健康，则又不能富贵。故应
全面检视十二宫以定其缺憾。于[辰戌宫独坐]一节，已举其大略。 
女命七杀人庙，会吉曜祥曜，如化禄、化权、化科、禄存、左辅右弼、天魁天
钺、恩光、天巫、天寿者，主富贵长寿，但志过丈夫。若居陷地，见化忌，会凶星
恶曜，如擎羊、陀罗、火星、铃星、地空、地劫、天刑、天虚、阴煞、天月等，则
半生孤独，或且灾病缠身，以继室为宜，旧居亦可以減轻对丈夫及子女的刑克。大限流年七杀人命宫，如入庙会吉星祥曜者，主事业有转变良好的机遇，受薪
者则主升迁或转换更佳工作。若落陷者，会煞星凶曜，则有刑克破败，应详视十二
宫而推断其事。倘会凶曜而见吉化，无论化禄、化权、化科，皆主先危后安。若既
落陷地，四煞并照，又见空劫、天刑，则有性命之虞。"""
        print(tmp)
        print("\n")
        tmp = """
        星曜组合 廉贞七杀天府
        属性 电＋火＋金＋土
        在人
        仓管、酒店管理／前台、大堂经理、电子厂厂长、智能家居店老板、电路设计工程师、宿管、化工厂厂长、屠夫、养殖场老板、假发店老板、代理商、传销人员、宗教人员、道长、精神病院院长、狱长、卫生巾销售、电网从业人员、农民、凶手、熏制品销售、通讯入户专员、物业管理、园林设计师、园林工程师、修剪树木的人、集团公司老板、连锁店老板、穆斯林、犯罪团伙成员
        在物
        电路图、户型图、化工材料、血库、带血的行李箱、法院、法庭、卫生巾、陷阱、网吧、思维导图、电网、菜园、蜘蛛、电箱、变压器、电子厂、仓库、监狱、迷宫、毒药、 k 粉、床上的血、床上的手机、酒店、智能家居、电动床、电动沙发、工棚、植物园、花园、晾晒的腊肉、电线、插线板
        在事
        电路设计、巡逻、囚禁、上网、探监、被拘禁、发展下线、招代理、代理产品、屠宰、诱骗拘禁、剪断电线／电话线／网线、
        在观感
        网和仓库、支线收纳、剪断支线、发展支线
        """
        print(tmp)
        if(len(star) == 4):
            if(star == "七杀廉贞"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """七杀廉贞在丑、未二宫同度，请参看[廉贞七杀]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "七杀武曲"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """七杀武曲在卯、酉二宫同度， 清参看[武曲七杀]一节"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "[紫微七杀"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """七杀紫微在巳、亥二宫同度，请参看[紫微七杀]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
                
    if(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午二宫独坐 
破军在子、午二宫独坐，对宫为廉贞天相。廉贞是利于从政的星曜，天相则主
为人作嫁，所以两颗星曜同宫，对照破军，便亦令破军守命的人有政治手腕，但却
为人谋而不为己谋。 
这种性质，可以比喻为拥戴政治首领的军事将领。自己很少主动变革，为一些
理想而奋争，但却因能受命巾肩负重任，虽艰险亦可完成任务。 
所以在于、午二宫安命的破军，人生虽少变动，而且不会主动去变，但一旦受
环境影响，非变不可之时，其变动之剧却令旁人乍舌。 
若无煞忌会照，命宫破军化禄、化权，或禄存在命宫同度(禄存在福德宫与紫微
天府同度亦可)，其人必宽宏大度，气魄雄伟。最宜武职，古人称之为[儒将]。现代
除军警之外，亦可服务于实业界，并宜于主持具开创性的工作。 
破军不喜文昌文曲，唯喜见天魁天钺，最喜左辅右弼同度会照，则主得朋友提
携、相助之力。若见昌曲而不见禄曜，反主人不良不莠，但有空想而缺乏实际行动。
宜加以后天人事补救，重视自己第一个念头，心念一动，即宜据此计划实行。 
不喜见煞曜来会或同度，令人倍感孤寂，若再见天虚，则更主人精神空虚；再
见天月，则一生必有慢性病缠身。 
女命破军人命居子、午二宫，最嫌见地空地动、孤辰寡宿，主半生孤寂，精神
痛苦。若夫妻宫武曲化忌，见天刑，则极可能无夫妻之实。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 廉贞破军天相
            属性 电＋水＋水
            在人
            海关人员、游客、出国人员、宾馆前台、警察、消防员、海员、邮轮乘务员、程序员、秃头的人、头发稀少的人、植发的人、戴假发的人、混血儿、外国人、变性者、同性恋、双性恋、少数民族、游牧民族、诈骗犯、签证官、科研人员、导演、媒体人、翻译、旅行社老板、旅客、外事人员、殖民者、犹太人、非洲人、屠夫、凶手、皮肤科医生、整形医生、血液科医生、精神病人、植发机构老板、宾馆老板、电子商贸从业人员、跨境贸易人员、物流人员、电子产品回收人员、维修工、手术医生、魔术师、电台播音员、卧底、拆弹专家、保密局人员、纳粹
            在物
            假发、护照、照片、摄像头、摄像机、邮轮、海港、 vr 、 ar 、智能科技产品、离婚证、门票、入场券、打印机、复印机、投影仪、电视机、电脑、电讯塔、无线电、电箱、变压器、核电站、化工厂、手机、翻译机、复读机、广告牌、显示屏、海市蜃楼、全息投影、3d打印、大头贴、仿真物、油画、照片质感画、肖像画、科幻小说／电影、渔网、捕鱼小镇、冲蚀地貌、殖民地、迷雾、雾霾、烤乳猪、熏制品、腊肉、风干肉、葡萄干、蔬菜干、水果干、泡菜、人造加工食品、致癌物、钻石、宝石
            在事
            拍照、拍摄、过关口、出国、出海、乘坐邮轮、变性、灭火、溺水、破译、翻译、鬼上身、画画、画肖像画、画油画、画3d图、看全息投影、钓鱼执法、拍戏、表演、看剧／电影／小说、雷雨、暴雨、潜水、抽血、打针、做手术、死亡、幻觉、植发、模仿秀、超级变变变、突破结界、乱伦、下毒、奸杀、鸳鸯浴、性交、观赏宝石、观看万花筒、织毛线
            在观感
            在物
            流通中间突破关卡、复制粘贴、伪装诱捕、逼真仿制、制造幻觉、线条交织
            """
            print(tmp)
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """在寅、申二宫独坐 
破军在寅、申二宫独坐，对宫为武曲天相。武曲为寡宿营，带孤克的性质，所
以宜注重星盘中父母宮的吉凶，若父母宫煞忌重重，或命宫禄马交驰而见煞曜，均
主人自小离家，乃浪荡天涯之命。
唯受天相影响，亦主为人行侠仗义，好打不平，所以虽然性情刚烈，亦必受人
拥戴。而且亦必有一技傍身，然后可以天涯流浪。 
若见禄存及化禄、化权、化科会照，又有左辅右彌、天魁天钺，则虽然浮荡不
安，但亦主事业有所建树，可远离出生地发展。一一若在出生地，则浮荡的性质便
变成不专一业，事业及职位时时变化，或至工作环境亦变动不居。 
安命在这两个宫垣的破军，若见文昌文曲，则为落拓文士；若见重重煞曜会照，
则一生孤独流浪。一见化忌、擎羊、陀罗全会于命宫，则主残疾在身，但好勇斗狠之性则不变。 
女命易堕落风尘，尤以在申宫命时为甚，又多终身无正式婚姻关系。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 武曲破军天相
            属性 金＋水
            在人
            园林工程师、建筑工程师、建筑工人、钱币铸造师、呼吸科医生、军警、矿工、玉石商、皮革商、雇佣军、焊工、铸造工人、海军、健身教练、拳击手、保镖、材料厂人员、钢材批发人员、工匠、雕刻师、战争片演员、模具制造商、水库管理、玻璃厂人员、加工厂人员、出版社人员
            在物
            玉石、皮革、铁管、水管、钢管、破碎的瓷器、破碎的玻璃、单面镜、山水摆件、模具、瓷砖、工艺画、工艺品、瀑布、都江堰、水库、水闸
            在事
            砸墙、检查、铁焊、健身、打拳击、照单面镜、玉石拍摄、开原石、打磨玉石、手工制作、模具制造、复印、盖章、复刻光碟、拧水闸、参观水库、切割
            在观感
            硬物的破坏、军事任务、检查通过、压制复印、石头和高低活水      
                  """
            print(tmp)
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """在辰、戌二宫独坐 
破军在辰、戌二宫独坐，对宫为紫微天相。破军一方面受制于天罗地网，另一
方面又受制于紫微，再加上二破军本身有[将在外，君命有所不受]的本质，对紫微
的掣肘会加以反抗，所以这个星系结构，便多矛盾的性格。 
所谓矛盾，可以具体表现为许多方面。志大才疏是其一；理想高而无实际行动
是其二；好投机弄险而决断力不足是其三；当有昌曲会照时，好文艺而身居与文艺
沾不上边的职位是其四；有一技之长，但却无法表现。到了应表现的时候，却又不
肯表现，是其五。 
这些矛盾，除非会化禄始可解救调和，次之者则为福德宫得化禄；更次者为福
德宫会化禄；尤化者为福德宫见禄存，则主人吝啬， 与破军的性格不合。 
 若无上述的调和，则主其人一生必有非常灾遇，或有慢性疾病缠身，如心脏病、
脑病、肾病或肠胃病。若武曲化忌会夫妻宮，更见天月、阴煞、天刑等凶曜，则主
不能人道，女命则嫁夫不能人道，或自身性泠感，或有同性恋的倾向。女命破军，唯以居于、午二宫时为佳，虽宜迟婚、二不见煞曜恶星，仍主白头
偕老，夫子俱全。在寅、申二宫若非偏房继室，则离克必多，且早离父母，甚或祀
出他姓，或落风尘无结局，唯亦多终身不嫁者，种种情形，须详各宫星系而定。在
辰、戌二宫，则易流为文艺气质，以致驾丈夫性格不合。
大限流年命宫见破军，主有去旧换新的机会，是否良好，须详下一大限，或以
后数年的流午而定。若破军化禄，则由旧业中生出新的机遇。若遇武曲化忌及煞曜
来会，则主破败，甚至事业停顿。 
唯破军独坐辰、戌宫为流年命宫之吋，若会擎丰，是年主生育子女，否则即为
血光、孝服之灾。"""
            print(tmp)
            print("\n")
            tmp = """
            星曜组合 紫微破军天相
            属性 土＋水＋水
            在人
            游泳冠军、模特、广告代言人、演员、艺术团团长、二手奢侈品回收商、高级研究员、空姐、空乘、整形师、个子高的人、高级工程师、装修师傅、画家、冲浪的人、国家机要任务人员、国家间谍、典当人员、设计师、摄影摄像师、高级科研人员、跳水运动员。脑科医生、旅行家、高空坠落的人
            在物
            二手奢侈品、高级护肤品、高级化妆品、香水、高的浪、喷泉、海滩悬崖、典当行、设计感的作品、火箭、电梯、高处的泳池、 vip 通道、水上飞行器、双子塔、空中走廊、廊桥
            在事
            回收奢侈品、小资情调拍摄、录制广告、看模特表演、看剧、高级艺术表演、国画作画、拍卖、设计、整形、美容美发、装修、高级会议、摄影摄像、拍摄高级广告、拍摄国家宣传片
            在观感
            高级又表面的、注重外表的、高雅艺术感的、高处的通道
            """
            print(tmp)
        
        if(len(star) == 4):
            if(star == "破军紫薇"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "丑" or dizhi == "未"):
                    tmp = """破军紫微在丑、未二宫同度，请参看[紫微破军]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "破军廉贞"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "卯" or dizhi == "酉"):
                    tmp = """破军廉贞在卯、酉二宫同度，请参看[廉贞破军]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
            elif(star == "破军武曲"):
                print(star, dizhi)
                print("\n")
                if(dizhi == "巳" or dizhi == "亥"):
                    tmp = """破军武曲在巳、亥二宫同度，请参看[武曲破军]一节。"""
                    print(tmp)
                    print("\n")
                    tmp = """
                    """
                    print(tmp)
def GongChu2nd(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """有兄长可依靠(或主受同事提拔)。或兄长富裕宽厚。加四煞空劫，则克害或欠
和，否则兄弟破败衰退落。 
兄弟近贵。会魁钺、昌曲、辅弼舌尤贵。但若会四煞、空劫、刑忌者，则主刑
克，或兄弟姐妹中有事业衰败。流煞及流忌入宫亦防大限或流年内兄弟姐妹刑刑真
伤破败。 
见四煞，倘父母宫有鸾喜，则可能兄弟各胞，且不同心。 
天马会照，兄弟姐妹各散东西。 
见天府，兄弟姐妹三人。 
遇天相，三至四人。破军会照，亦主三人。然有刑克，或析产分居。或异母所生。若父母宫桃花遍
集，又见右弼者。更可推断有异母兄弟。 
见左辅右弼，五人以上。
会昌曲，五或七人。加羊陀火铃七杀，则兄弟姐妹宜双数，否则刑事克。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇破军"):
                tmp = """紫破，三人，不和或不得力，亦主各胞。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天府"):
                tmp = """紫府，三人，兄弟各有主见。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，二人。见煞忌一人。主各有争权之心。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，三四人。加煞忌二人。感情易忽生破裂。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，三人，闲宫见煞忌二人。和睦。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """主兄弟姐妹寡少。唯见辅佐吉曜则可增添数日。 
人庙二人，会吉有显贵者。 
巨门或天梁或太阴会照，二人。 
天机落陷守兄弟宫，兄弟不和，各有主见。见天梁天刑，有争讼。 
若会四煞天刑天马，主刑克，分离。 
落陷见煞忌，孤身。有刑见克。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机巨门"):
                tmp = """机巨，二人，有口舌纷争。 """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，二人，易因环境而分离，然可重逢。"""
                print(tmp)
                print("\n")
            elif(star == "天机太阴"):
                tmp = """机月，二人。见煞分离。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙兄弟姐妹三人以上，见吉会，兄弟主贵。 
落陷及夜生人，兄弟多争不和，乖达无靠。倘见四煞、空劫、天刑，主兄弟有
刑克，或自身因兄弟而受意外的伤害。 
凡太阳落陷失地居兄弟宫，宜异居，不同居一地者更佳。 
 
 以上见左辅右弼、文昌文曲、天魁天钺者亦可增加兄弟姐妹数目。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """阳阴，五人以上。一般主感情融洽。"""
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """阳巨，兄弟多出国，见吉，则为创立事业人才。三人。 """
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """阳梁，二人。陷地欠和，见煞刑克。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲入兄弟宫，主不和睦，无助力。入庙二人。见吉得一人力。 
落陷一人。 
逢昌曲，三人以上。见辅弼，亦主三人以上。 
见七杀破军，仅一人，见煞孤身，或各胞。 
四煞空劫会，孤身。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，三人。见煞忌有克，或二人欠和。"""
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武贪二人，见煞一人。武相，二或三人。陷地见煞有刑。 """
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，一人，且欠和。 """
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，一人，且欠和，见刑易争讼。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙，四人以上。和睦但少助力。 
落陷，二人。兄弟软弱。 
 逢四煞、天府、空劫，兄弟姐妹刑克不和，以异居为宜。 
独居辰戌，有异胞兄弟，见辅弼昌曲，共六人以上。同巨，兄弟姐妹三人，有
口舌是非。 
 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同天梁"):
                tmp = """同梁，三人，有暗争。若在寅申宮遇煞，则多无兄弟。"""
                print(tmp)
                print("\n")
            elif(star == "天同太阴"):
                tmp = """同月，五人。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙，兄弟姐妹二人。一般主感情和洽。 
会左辅、右弼、文昌、文曲、天魁、天钺、天贵、天府等吉曜，兄弟姐妹五人
留三人。 
遇四煞空劫天刑，主刑克、灾病或不和。常见分居离居。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，二人。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉府，二至三人，见昌曲左右三人。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贪，稀少，有兄弟亦招怨，加煞则主孤身。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，一人。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉破，一人。感情易生反复。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """守兄弟宫主兄弟众多，五人以上。 
见昌曲、魁钺、辅弼，兄弟多才能，且彼此有助力。 
与武曲、廉贞会，有伤克。再见文曲则主兄弟姐妹多虚伪。见四煞、化忌、天
刑、空劫、大耗者，刑克不和，或兄弟姐妹仅得一二人，需自身予以资助。 
见七杀破军会合，招怨。再见四煞、空劫，兄弟只余二人。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙兄弟姐妹五人。 
陷地三人不同心。天机同度二人。 
遇化禄、化权、化科者，兄弟富贵多才。 
遇四煞、空劫、刑克不和，或分居不和。 
太阴化忌，会合天梁，见煞，主兄弟有阴谋。 
太阴与天同相对，兄弟中以女居长者为佳。否则易见刑克。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """会辅弼、魁钺，兄弟和睦，互相帮助。能保持生活水平上的来往，主有兄弟三人。 
会照武曲者孤单，或异母所生。 
贪狼落陷守兄弟宫，亦主有异母兄弟。 
会照火铃、羊陀、天刑者，孤单，或刑克不和；主兄弟有物质方面的争夺。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "贪狼紫薇"):
                tmp = """紫微同度者二人。 """
                print(tmp)
                print("\n")
            elif(star == "贪狼廉贞"):
                tmp = """廉贞同度者一人，或不和。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙二人。 
与太阳同度，兄弟姐妹三人。再与辅弼、魁钺、昌曲、恩光、天贵、天福等曜
会合，并有化禄、化权、化科同踞者，主兄弟皆有创业之才。
凡巨门守兄弟宫，与空劫、大耗会照者，多受兄弟之剥削。与四煞、阴煞、孤
辰、寡宿会照者，刑克是非纷争。化忌者，亦主是非口舌，且主灾病破耗。见天月、
刑耗则主因兄弟灾病耗而破财。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门天机"):
                tmp = """巨机，二人，各有机心，东西离散。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天同"):
                tmp = """巨同，有结拜兄弟，但凶终隙末。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙有辅弼会照，五人以上。紫微同度，三人以上，且兄弟好强好高。 
武曲或廉贞同度者，兄弟姐妹二人，而意见不合。 
见化禄、化权、化科及禄存者，兄弟秀发，有财有势。 
武曲破军拱照，有辅弼者，兄弟虽多，但有刑伤，或异母兄弟，及有年龄相差
甚多之小兄弟，约为八年或十二年以上。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """入庙临兄弟宫，会辅弼、魁钺者，五人以上，且兄弟姐妹和气。若入庙而无辅
弼，主有异母兄弟。 
凡人庙见魁钺而无辅弼，同胞兄弟仅二三人，有暗争，倾挤，或且分离。 
与太阳同度于卯西宫者，主争夺家产，或互生误会妒忌。 
与天机同度者或会照者，兄弟二人。 
与太阴，红鸾、天喜会照， 多姊妹。 
与天同同度者， 同居一地者二人，分居或居异地三人。 
与四煞、天刑、空劫等星会合，拦刑克不和，分离纠纷。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """人庙且会照禄、权、科辅弼者。兄弟众多唯有刑克。 
七杀守兄弟宫，而会照辅弼，或命宮会照辅弼者，亦主兄弟多而有刑克分离。
感情和洽， 怔少实际助力。  
若会照煞星化忌，仍七有灾病、刑克、分离。"""
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """寅申二宫，兄弟多才清高。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """巳亥二宫，兄弟能贵。"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """辰戌二宫，兄弟能富。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """主兄弟分居或刑克。 
凡破军守兄弟宫，自身常居长，或虽排行二三，但在各种情形下，虽非兄长而
形同兄长，如兄长逝世或继出；或长姊出嫁，或自身继出等。否則亦自身肩负长于
或长女之责任。 
与六吉同度或会照，主兄弟有依靠。 
破军守兄弟宫而与煞星会照者，刑克，孤独。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """紫破，三人。但不和或各胞。同事则易结党。  """
                print(tmp)
                print("\n")
            elif(star == "破军武曲"):
                tmp = """武破，二人。见煞一人。欠和。 """
                print(tmp)
                print("\n")
            elif(star == "破军廉贞"):
                tmp = """廉破，仅一人。 """
                print(tmp)
                print("\n")
    print("----------------------------------------------")
    tmp = """(附) 辅佐煞曜对兄弟宫的影响 
 禄存 
宜人生旺之宫垣，若不逢四煞空劫，主兄弟姐妹中有贵显者。 
若与长生同度，兄弟姐妹缘份好。 
与天马会合，兄弟姐妹有人在异地发达。 
 天马 
见辅佐吉曜会合，兄弟姐妹虽各散东西，但彼此仍有助力。 
如吉凶星曜并会，或主有异胞手足，或兄弟姐妹分成两党。吉曜有力，则仅主
部分疏远，部分多来往。 
左辅 
见吉曜，则主得力；若逢四煞、刑、忌则主受兄弟姐妹拖累。 
见空劫，又会煞忌，主感情本佳，但突生变化；或兄弟姐妹顿生意外灾遇。 
 右弼 
见武曲七杀，见煞，主有刑克。如父母宫见桃花诸曜，则主异胞。 
 空劫、化忌、煞曜多见，孤单。 
 文昌 
 见天府、左辅、右弼，兄弟姐妹得力。 
逢羊陀，兄弟姐妹有纷争。 
陷地见空劫、化忌、兄弟姐妹数目应较由兄弟宫失出者为少，且不和。
 文曲 
逢七杀，又见煞曜，兄弟姐妹不和。 
陷地见空劫，稀少，且有口舌。若擎羊，天刑同会，主争讼。 
 天魁 
主贵而不主富。会诸吉，主手足提携。 
 天钺 
同天魁。唯抵抗诸煞之力，不如天魁。 
火星、铃星 
不喜再见廉贞、七杀、破军，主稀少。 
若再见空劫、化忌，有刑克。 
见贪狼，或主兄弟姐妹有意外财。但亦可能主自卑有意外财。则若再见化忌、
大耗、煞曜，则不是。 
 擎羊 
见化忌、天刑，主争讼。见天梁，更的。 
遇空劫、大耗、火铃，兄弟姐妹可以倾家。不宜事业合作。 
 陀罗 
主兄弟姐妹彼此少来往，但非不和。 
见天马，主兄弟姐妹背井离乡。 
 地空 
主有异胞。或亦主彼此离别。 
更见煞曜。兄弟姐妹各怀己见。 
 地劫 
主异胞或离别。 
空劫夹兄弟宫，不利。夹廉贞化忌，主伤心。"""
    print(tmp)
    print("\n")

def GongChu3rd(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """配偶有统治欲，亦有责任慼，化权，主妻夺夫权。婚姻虽不如意亦不易言离。
遇吉，女主夫荣，男主妻有丈夫气慨。遇凶，仅内心痛苦，表面仍宽容。  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子"):
            tmp = """独坐子午，无吉，或聚少离多，或貌合神离，或志趣不同，或配偶隐疾。坐子
配偶内向，坐午则配偶从事特殊职业。宜妻小，女宜夫长。"""
            print(tmp)
            print("\n")
        elif(dizhi == "午"):
            tmp = """独坐子午，无吉，或聚少离多，或貌合神离，或志趣不同，或配偶隐疾。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "紫薇破军"):
                tmp = """紫破，多娶年长之妻，且主纳妾，或有外遇。女命夫宜年长。夫妻聚少离多，
或有波折。紫府，内心常有隐衷。主婚迟。但能偕自首。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，妻有男子志，刑克不免，宜迟婚。配偶多才艺有情趣。遇煞则风月。见
桃花，有外遇，终迷途知返。唯夫妻宫无正曜，对紫贪，而四煞并照夫妻宮，丰铃
又与紫贪同度，则反无家室之乐。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，为辰戌罗网，易突生意外之变。妻子虽可相夫事业，唯配偶薄情。利迟
婚，男命宜小配。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，配偶御夫有术，具开创力，健谈。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """配偶易适应环境。感情则起变化，不宜见左右火铃。其变化常由任性仁而来，
见吉限吉年，可以复合。唯配偶多才，男命宜小配，须相差三岁以上。妻子性情机
巧，持家有道。 
亲家易不和，遇煞忌尤的确。 
常有无正式仪式的婚礼。或主配偶好投机。天机独坐丑未，居丑宫昔主配偶外出离别：竹末宫者，夫易受诱惑。婚前有波
折。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """天机独坐巳亥，感情易变，恋爱屡受挫折。女命政工遇人不淑。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机月，必有一段时期波折，见左右火陀文吕化忌尤甚。见化禄化权及六吉，文
采风流。得聪明内助，小配为宜。 """
                print(tmp)
                print("\n")
            if(star == "天机巨门"):
                tmp = """机巨，婚前有波折。亦主半生漂泊，或早成鳏寡．轻则貌合神离。配偶或嗜赌，
或有外遇。  """
                print(tmp)
                print("\n")
            if(star == "天机天梁"):
                tmp = """机梁，婚前曾与人解约，或受家长反对。婚后有波折，或配偶灾病。但终能化
解。男命妻宜小六岁以上。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳会羊陀，初热终冷，非正式结婚为宜； 
女主配贵显。落陷平常，但亦热情。 
日陷化忌，妻多疑，夫多灾病。或易离。 
遇吉，男主因妻得贵。日破遇则非礼成婚。 
  
"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """子午宫，宜迟婚，男上得妻坚贞，持家有道；夫年长，淡泊自甘。纵有感情波折
终能化解。六吉多见，又见煞及桃花，则夫妻各有外遇。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """太阳独坐辰戌见吉，配偶忍让；见煞大宜年长，妻宜年少，宜迟婚。"""
            print(tmp)
            print("\n")
        elif(dizhi == "丑" or dizhi == "未"):
            tmp = """在丑未宫与月同度，婚前婚后有变化，災六煞化忌辅弼尤甚，配偶自私。亲家不
和。女命胜大，但宜作继室或偏房。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """日巨于寅中最利，无化忌右弼则莉门皆、亦主异族通婚。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """太阳独坐巳亥，巳宫优于亥宫。椅巳宫，仅主婚姻无正式仪式。居亥，早婚者
多主离异，一匪欠完美。又是主妻子性刚。"""
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """阳梁于卯酉，主离散重圆。或婚前有阴力；配偶险难，终能化解。女命，夫不宜
经商。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """主孤克。遇杀破，三度姻缘。入庙者迟婚可免。 
见昌曲化科，妻贤能。禄马遇，因妻得财。遇凶曜，则因妻破财。 
最嫌化忌，常因贫而离异，不因感情。 
会天姚，凭媒约者必克离，主恋爱成亲。 
 女命会煞破忌，再婚或偏房，或丈夫不能人道。若令武曲化忌见煞破，亦主有名
无实。 
武火遇，半生孤独。见化忌尤甚。 
武曲化禄，夫为财经界人才；化权则主政要之荣；化科为名利双收之士，见煞
减色。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，女孩子命易为有家室者追求。"""
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """
 武贪，妇夺夫权且带桃花，故妻宜年长。夫宜年长十岁以上。宜娱乐文艺事业。武相，波折。男娶美女，竞争则大。女若与夫年相当，则聚少离多。"""
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，见左右文曲天钺，易生畸恋，或橫刀夺爱。见陀罗，婚前波折。女命主
夺夫权。若煞忌重者，配偶有意外伤心事。"""
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，畏妻。女命则主会少离多。化忌或见空劫火铃左右，出墙红杏，或主丈
夫患不治之症，或不能人道。主再婚，或继室。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """见六吉，配偶秀丽、潇洒。 
女命夫妻宮天同会四煞化忌，有名无实，宜偏房，或离婚再嫁，或配偶病灾。
会巨门，口舌连连。 
男女皆须迟婚，已订婚者解约再娶为宜，或不举正式婚礼，否则三妻之命，小
配可免。会四煞亦有名无实。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "卯" or dizhi == "酉"):
            tmp = """独坐卯酉，卯宫宜早婚，酉宫宜迟婚女命夫缘不足，中年孤独。见桃花诸曜如
咸池、红鸾、天喜，主移情别恋。"""
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """独坐辰戍，恋爱屡遭挫折。婚后异地而居，志趣不授。戌宫尤甚。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，体型贵贱思想均不协调。一亲家不和。易有外遇。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天同巨门"):
                tmp = """同巨，坎坷，婚前波折。女命本宫言者可遇贵夫，但中年仍有风波，以无正式名
份为宜。"""
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """
 同梁，新婚期间及老年吉，中年聚少离多，或再婚，亦主离婚后可配美貌之妻，
或配多才之夫。男命主妻能持家；女命，主自身操劳。 """
                print(tmp)
                print("\n")
            elif(star == "天同太阴"):
                tmp = """
 同月，夫宜年长，
妻则能干，女命易生感情变化，唯终谐佳配。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """主刑克，见煞三克。 
男命妻美，见忌，离而再娶美妻。见桃花，妻有外遇。见杀破，不和。见四煞
刑克，因男女感事而有词讼。 
 女命会煞，徒有虚名。以不举行婚礼为宜。 
 见天府，配偶性刚免克。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """独坐寅申，聚少离多。男主妻清白，遇煞忌，仍有波折。女命时嫌丈夫无情趣。"""
            print(tmp)
            print("\n")
        
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，见左右六煞昌曲化忌，主离，或配偶不贞，煞重，主纷争不和。无子，有
女。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """
 廉杀，妻媚而淫，见吉则可免祸。见辅弼六煞化忌，婚姻不利。女命主夫善理
财。 
 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """
 廉破，见煞不和，无煞美满。亦有外遇。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """
 廉府，有感情纠纷，配偶善交际。见辅弼化忌六煞，主外遇。性刚无克。见桃
花，恋有妇之夫。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """
 廉贪，多艳遇。男主妻不淑，但善应酬。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """配偶有工作能力，亦善理财。
男主妻聪明年少，女主夫贵年长。
府陷见煞，宠妾减妻。会吉，但离不而离，仍藕断丝连。女命则多内心不满。
配偶家世或志趣相投。
 """
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """独坐丑未，妻贤，但仍有妾或有外遇。或主有妻再娶，第二妻聪明多才，持家
有道，女命吉。"""
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """独坐卯酉，见煞，主外遇，无煞，配偶温柔体贴。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，迟发、迟婚。见煞忌或命宫武曲化忌，婚变。见月马，生离死别。妇
夺夫杈难免，有吉亦然。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天府武曲"):
                tmp = """武曲同度，为有家室者追求。见煞刑空幼，以继室为宜，否则生离死别。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """男主妻年少聪美。加昌曲极美。亦主妻多。女主夫长且早嫁。
见四煞空劫忌不克，但主生离。 
见吉，主配偶富裕。 
女命夫妻宫太阴见三化，外则擅应酬，内则能怀柔丈夫。最嫌化忌，主配偶离
乡背井，或与自身六亲无缘。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """独从辰戌，婚前波折，婚后美满。 """
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """独坐卯酉，男优于女。主经多次爱情波折而后成亲。见辅弼化忌，夫有外宠。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，宜男不宜女，亥优于巳。见煞忌辅弼，夫长十年以上可偕老，否则
波折。于亥宫入庙，得贤妻，见魁钺，因妻得财。女命则不宜见左辅右弼同坐，主
夫有外宠，且貌不如己。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """见煞，男主三度新郎。入庙，迟娶免克。 
女命，夫宜年长婚迟。加四煞，主生离。 
贪狼独坐，见桃花，
亦主妻为风尘中人出身。 
女命夫宫贪狼，夫有外遇免刑。 
男女皆主配偶有才艺。 
见火铃，配偶发足迹变泰。化忌，少桃花。见空曜， 
 配偶沉实。
见擎羊，配偶有特殊技能。 
见陀罗，主配偶貌寝。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "贪狼廉贞"):
                tmp = """贪会廉贞，见桃花诸星，男命主有桃色纠纷，或宠妾减妻。"""
                print(tmp)
                print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """独坐辰戌，罗网，桃花减色。不逢煞忌，清白。女命则婚前多周折。 """
            print(tmp)
            print("\n")
        elif(dizhi == "寅" or dizhi == "申"):
            tmp = """独坐寅申，见擎羊空劫化忌，配偶为专门技术人才。见左右魁钺，配偶俊秀或
美艳，但恐有外遇。"""
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """独坐子午，最喜见禄，主配偶富裕。妻宜小配。唯[泛水桃花]主有外遇。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """主常有口舌，妻以长配为宜。 
见羊陀火铃，男克二妻或生离。又见天刑，女主三嫁，以不举行婚礼为宜。 
化忌，多无谓争吵。
 女宜夫长，否则移情别恋。 
男女婚前皆易与已婚者恋爱。 
初恋者必不能结合。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """独坐辰戌，见化忌，配偶幼年坎坷，且多惹是非。见左右，感情不佳。无煞，
配偶任劳。 """
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，命宫必会太阳天梁，与岳家或夫家不和。逢六煞，婚前婚后皆有感
情变化。男命，主妻贤美。"""
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """独坐子午，妻有男子之志，见魁钺左右禄科权，配偶名气胜己。女命有感情困
扰。见左辅右弼，一坐夫妻宫一坐命宫，主生离。见吉则聚少离多，异地分居，但
感情和睦。"""
            print(tmp)
            print("\n")
        
        if(len(star) == 4):
            if(star == "巨门天机"):
                tmp = """机同宫，见化禄、化权、化科主敏丽。"""
                print(tmp)
                print("\n")
            elif(star == "巨门天同"):
                tmp = """天同同度，美而刑克生离。 
喜见禄权左右。夫富贵多才，事业广大。"""
                print(tmp)
                print("\n")
            elif(star == "巨门太阳"):
                tmp = """日同宫，作事明朗。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """主配偶为人谋而不为家室谋。或聚少离多。 
男妇皆主亲上加亲，或旧情复燃，或旧相识重逢而恋爱。 
女宜长配，会吉，夫体贴温柔。 
见化禄及禄存同宫，得妻财。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天相紫薇"):
                tmp = """紫微同躔，妻志高，宜迟婚。"""
                print(tmp)
                print("\n")
            elif(star == "天相武曲"):
                tmp = """见武破，有灾，口舌。二婚之命，曾解婚约者可免。"""
                print(tmp)
                print("\n")
            elif(star == "天相破军"):
                tmp = """见武破，有灾，口舌。二婚之命，曾解婚约者可免。"""
                print(tmp)
                print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """独坐丑未，得内助。男命，稍嫌妻夺夫权。若命宫武曲化忌，主离。女得年长
佳配。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，男利于女，主有内助之妻，顺从大意。 
女命则嫌夫星不振，命带桃花，常怀外向之心。"""
            print(tmp)
            print("\n")
        elif(dizhi == "卯" or dizhi == "酉"):
            tmp = """独坐卯西，迟婚。夫妻志趣不投。妻主贤淑而性刚。 
 夫主内向，无煞可偕老。 """
            print(tmp)
            print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """男命，主妻子美容，但宜比自己年长三岁以上。 
月梁同拱照，妻美丽生离，但仍藕断丝连。 
男女命皆主婚前婚后有变化，或曾解除婚约，或遇尊长阻力，或因灾乱及环境关系致延误婚期，唯有情人终成眷属。婚后遇挫折，或祸乱，或误会而分离。不遇
煞则复合。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑" or dizhi == "未"):
            tmp = """独坐丑未，妻年长，有名士风。女命，夫清贵。丑宫优于未宫。"""
            print(tmp)
            print("\n")
        elif(dizhi == "巳" or dizhi == "亥"):
            tmp = """独坐巳亥，男女皆主困扰重重，婚前曾单恋，或失恋，或婚姻受家长反对。婚
后会少离多。女命或婆媳妯娌不和，或丈夫困滞，病患。男命则妻子体弱。见煞多
离，限吉则离而复合。"""
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """独坐子午，主妻夺夫权，或妻年长，视夫如弟。女命主配偶有名土风度。见陀
罗空劫，命宫左右独守，或梁与左右同宫，主生离。  """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天梁天同"):
                tmp = """天同同宫而化忌，则恐离而再克，克后再离。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """主异族通婚。见太阳、巨门于命宫者尤为的确。 
见四煞空劫，克三。无煞，孤而不克。 
男女皆主表面和谐，内心不满，有卞青无缘。女命，主夫有成，且责任心重。 
 """
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """独坐寅申，必迟婚。婚前花多眼乱。男宜妻小五岁以上，女宜夫长五至十年。
配偶忙碌。 """
            print(tmp)
            print("\n")
        elif(dizhi == "辰" or dizhi == "戌"):
            tmp = """独坐辰戌，为罗网，主不和谐。婚前有波折。见煞同，配偶有专门技能，尤宜
医药。会煞曜则宜军警。见廉贞化忌尤的。"""
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """独坐子午，婚前多波折，婚后和谐。见六煞，异地而居，或夫妻志趣不投。  """
            print(tmp)
            print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """男妇俱克，或生离另婚，宜迟婚。 
波折大，聚少离多，兴趣不合。 
易因意气用事而离，限吉可复合。 
不过六吉，欠情趣。 
或主妻较夫年长，或同居试婚，或婚后即分居异地。武曲同度主生离，再化忌
星，配偶有灾病；廉贞同度，则防有外遇；紫微同度，宜长配；若见禄存化禄，反
主家庭不利。 
妻御夫，夫亦主有支配欲。 
独坐子午，配偶性刚。妻夺夫权。化权，年龄相若。 
独坐寅申，女命，婚前或解除婚约，或恋有妇之夫。主配偶忙碌。男命则可行
贤妻。唯无论男女，皆主夫妻聚少离多。 
独坐辰戌，妻性刚，命宫或本宫见忌空左右易离。女命宜协助丈夫事业，配夫
有家庭责任感。"""
        print(tmp)
        print("\n")
    print("--------------------------------------")
    tmp = """(附)辅佐煞曜对夫妻宫的影响 
 禄存 
女加四煞，宜偏房继室。加火铃空劫见截空，孤单。喜三方有化禄，或会同天
马，则可解孤，且主进财。 
夫妻恩爱，但易受人欺。又主配偶善理财。见六煞、左右、破碎、劫煞、空忌，感情不和。 
 天马 
男得妻助，主得妻财，或妻有帮夫运。 
会禄，财气旺，富足。 
喜紫杀府相贪狼日巨武曲，尤喜府相。 
左辅 
主配偶婚姻曾经波折，或婚姻无正式婚礼。然若不见煞，主夫妻恩爱。见三化，
有成。加日月巨机火铃武杀，生离。右弼亦然。 
 右弼 
带桃花，主第三者介入；独坐尤的。 
主两女共事一夫。见机月尤的。 
见忌空劫，主离。 
 文昌 
主配偶心细如尘。机月同度，美容。 
喜与紫府阴阳相曲左右魁钺同宫。见三化富贵。不喜右弼廉破四煞空劫化忌。 
见廉贞有外遇。见破军，配偶劳碌。化忌，学识不足。 
有多次恋爱机会。见煞同，或命宫福德宫不吉，红杏出墙，男则有外宠。 
 文曲 
有口才。但带桃花。解同文昌。 
文昌文曲同，闺房多情趣。 
昌曲分居夫妻及迁移宫，配偶于海外扬名，但见煞则主外遇。 
成宫见昌曲，易离。曲独坐亦易招桃花。 
 天魁 
配偶家世不俗。喜府相紫武贪破曰月左右昌曲三化禄马。 
天钺 
带桃花，主得异性贵人。 
嫌昌曲桃花阎，易有外遇。 
解同天魁。 
魁锻一入夫妻宫。一入福德宫，见桃花，必有第三者介入。 
 火星 
最喜见擎苹。配偶命宫见之最吉，夫妻富见次之。 
落陷，配偶辛劳。 
入庙，聚少离多，或配偶事业有变。最喜见贫狼，主得财。无贪狼亦则必有一
段光辉。 
男女皆主配偶暴躁。见煞，易生困扰。 
 铃星最喜见化禄及食狼。 
火铃分居福德及夫妻富，主仓卒成婚，或与料想不到的人结婚。 
分坐夫妻寓及迁移宫，夫妇性刚。 
擎羊 
男英俊，女冷艳。 
独坐夫妻宫，配偶宜军警、或技术人员，或与异族通婚。 
独坐，配偶有一闪外伤，或动手术。 
见廉月桃花大耗，主离家出走。 
陀罗 
主配偶孤独，离乡背井。 
 主迟婚，拖延。婚后家务是非。 
 地空 
主婚后感情日淡。 
若与杀破同宫，无桃花，结识异性机会少，宜媒约。 
与旬空、天空会，知音难求。 
独坐午宫，于意料外成婚。 
宜与火羊独坐命宫或夫妻宫者配合。 
 地劫 
独坐，感情及钱财均不利。 
见劫，未婚者恋爱中途生意外之变。分离有反复纠缠。婚后仍多难言之隐。 
宜与陀罗入庙居命宫或夫妻宫者婚配。 
空劫同坐，对婚姻反少破坏力，唯特殊之处增多。 
夹夫妻宫不利，唯夹武曲化忌者吉。"""
    print(tmp)
    print("\n")
def GongChu4th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """得子女必性刚，志高气傲，但多秀发。 
会化禄、化权、化科必得佳儿。但以迟得为宜，主贵禄。 
会左辅右弼，五胎以上。同时会照四煞，则有刑克，虚花少实。或主子女因气
高而横破。 
会文昌文曲或化科、子女聪明；会辅弼，子女忠厚。 
会天马，子女远离；会禄存或化禄，子女能富；擎羊同度，子女破相或父子不和，
或不能享子女福。会魁钺，子女贵。 
紫微独坐，庙旺男三女二；加吉星如辅弼昌曲五人；加羊陀火铃空劫，二人，
或偏室或继室生子，或招祀子。空劫尤主庶出。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫府，三人，加左右昌曲五人，且贵。再见破军刑忌，见多得少。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，二人迟得，贪化忌防子倾家。加四煞刑忌则一二人，且主难产或小产。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，二人，加昌曲辅弼三四人且贵。父子感情始 
吉终凶，或煞忌并见，一则有志高倔强倾家之子。见吉，子 
得父荫。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，一二人，加吉三入。遇煞，子强横，加吉则可成大器，但亦先劳后逸。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """紫破，二人，加吉三人。见禄则子女有成，见四煞刑忌空劫，多克害，．主堕胎
小产。或长子有克，破相，或不足月生。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机入庙，主子女聪明机巧。天机入子女宫，主子女少。或迟生。 
天机落陷，最忌见煞忌空劫，无子，有亦不和，或子女品格不佳，多心机巧诈，
或克害。 
天机守子女宫，亦主庶出，或女招外子。 
天机独坐，庙旺二人。或庶出多。唯独坐酉宫，会红鸾天喜及大耗等，主女多
子少。 
 
若坐寅宫会照天梁，则子三人。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机阴，二女一子，若太阴落陷，则以先招祀子为宜。"""
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """机巨，一人，加诸吉者二人。唯须过继或分居，否则难养。"""
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，辰宫二三人，戌宫一人但多女。主小产。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳坐子女宫，巨门会照而太阳庙旺，子聪明能创业，见禄杈科或昌曲，有语
言天才或辩才。 
太阳落陷于子女宫，不利长子。 
太阳化忌，子多病痛。见四煞空劫刑，子多克，只一子送终。 
太阳独坐，庙旺无煞，八胎以上。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """阳阴，四五人。见煞余二三人。 """
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """阳巨，三人。季子难养。化禄子贵显，巨门化禄而 
 太阳化权，反宜小心教养，否则子女气高横破。"""
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """阳梁，卯宫三人，酉宫二人。见煞主小产流产。子女易与父母分离。见昌禄，
子女学业均佳，且原则性极强。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲入子女宫，宜继室偏房产子，结发者多虚花。子女刚耿，但落落寡合。 
武曲主克，见七杀及化忌，主流产。
凡子女宫会照武曲七杀，均主开刀生子。 
武曲入子女宫亦主外子得力，或贤婿佳。 
四煞刑忌空劫迭见，绝嗣。 
武曲见辅弼昌曲、独坐，子聪明，仍主子少。若避鸾喜耗等，有女。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，二人。加煞一人。  """
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武贪，四十后得子，可见二人。"""
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武相，先招外子，后亲生一子。"""
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，无子。有一子亦防伤残，见煞尤的。宜继室或偏室生子。见吉得子极迟。"""
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，主有破相之子。亦主刑，刑至一二人。加昌曲辅弼则三人。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """凡天同坐子女宫，首胎以见女为佳。 
 天同坐巳独守，对宫天梁，得子可能弱智，唯以见煞忌始是。天同主子女软弱怕事，且易安于逸乐，少斗志，难经风浪。为人情绪化。 
天同坐子女宫，会天机，有子女二人，但迟得。 
天同化禄，不宜见煞，否则子女破家。此盖由于耽于享乐之故。 
天同落陷见煞，一子送终。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同巨门"):
                tmp = """同巨，三人，加四煞、空劫则一人。再加化忌、大耗，得子多病多灾，破耗钱
财后仍见刑克。宜祀出或分居。  """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """同梁，以先女后子为顺，子女二人。 """
                print(tmp)
                print("\n")
            elif(star == "天同太阴"):
                tmp = """同阴，子宫五人，女多子少为贵；午宫二人，亦宜 
先见女，有天刑同，破相或远离。见煞，以祀子为宜。且主子女内向。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """最喜与天府相会，主得贵子三人。
廉贞化忌，子女多灾病，或破相。 
廉贞会杀破狼，子女有刑伤。 
会四煞空劫刑，主招祀子。 
廉贞落陷守子女宫，见吉亦有刑伤。 
廉贞独坐庙旺，一子独秀，平宫一人，苗而不秀，陷宫主克。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天府"):
                tmp = """廉府，三人且有贵者。子谨慎忠厚文秀，见昌曲益增其秀发。但不主富。唯曲
府同度则刑克。   """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贪，子少，加吉亦仅二人。见昌曲，聪明敏感。见煞体弱。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天相"):
                tmp = """廉相，二人。子女忠厚，可以守成。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，主孤，化忌加吉，得一人亦多灾病。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉破，一人，见煞有克。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """一般情形下主子女多。 
会昌曲魁钺，得聪明且多才之子。子孝。 
天府坐子女宫见煞刑忌，子女倔强，或破相。 
天府独坐庙旺，五人见四煞空劫，三人。会左右，五胎以上。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天府廉贞"):
                tmp = """天府廉贞文曲同度，必有刑克。   """
                print(tmp)
                print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """庙旺，一般情形下主子女富有。先女后子为宜，否则女多子少。 
落陷得子软弱，或刑克。先招祀子为宜。 
加四煞空劫子少，会鸾喜则多女。 
太阴落陷，则先知外予为宜，则亲子可免
刑克。 
太阴庙旺独坐，女三男二，加煞劫二人，见昌曲聪明，见辅弼能克家守成，见
魁钺则子女贵。见禄存化禄主子女富。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阴天机"):
                tmp = """天机同度，加吉，亦仅二子女送终。   """
                print(tmp)
                print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼会咸池天姚，主女多子少。亦主先女后子，否则偏房继室生子。 
贪狼入庙，会左右、魁钺、天贵，子女二三人，且有贵显者。 
 贪狼化禄居子女宫，见吉，子善经营，见煞主子女骄奢。 
贪狼化忌，子女坎坷，或浪费。有理想而不能成就。 
贪狼见四煞，主小产或难产。见天开刑，子女难养。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "贪狼紫薇"):
                tmp = """紫贪同度，子必迟得。  """
                print(tmp)
                print("\n")
            elif(star == "贪狼武曲"):
                tmp = """武贪同度，见左右昌曲三人。否则迟得二人。  """
                print(tmp)
                print("\n")
            elif(star == "贪狼廉贞"):
                tmp = """廉贪，子女二人。子则一入。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守子女宫，以迟得子为宜，否则长了难养。巨门主孤独，必见太阳始解其
暗；得化禄、化权、化科或禄存，方有祥和之气。 
天同辅弼同寓，则主亲子得力，庶子送终。 
巨门独坐，入庙二人，落陷或见煞一人，再见空劫绝嗣，唯可有女。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门太阳"):
                tmp = """巨阳，见左右、魁钺、三化者，主三人以上，且必属佳儿，能富能贵，聪明多
才。见诸吉拥护，可为外交人才。见昌曲同度，宜法律界。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相坐子女宫，见武曲破军拱照，主刑克，迟得为宜。首胎有小产流产，或有
损伤。以先生女为佳。否则主偏房继室生子。 
天相与四煞会，又见辅弼，前三胎有损，须偏房继室生子，唯第一胎仍小产。 
天相见权禄科三吉化，及魁钺、辅弼及天府会照，则五胎以上，且子女仁慈孝
顺。 
天相最怕见煞，招祀子或庶出为宜，先招外子后裔生一二。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁入庙居子女宫，会照辅弼、三吉化曜、天巫、恩光、昌曲、魁钺者，主子
女聪明多才，做事有原则，且耿直心慈，能富能贵。 
庙旺二人。陷地一人。 
天梁在子女宫，多主先得女。 
遇辅弼昌曲天同，子庶出者一人。 
天梁守子女宫不宜见煞，主早子克。再见空劫删总，有绝嗣之虞。化忌会照，
子女多灾病。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天梁天机"):
                tmp = """梁机，必小产，主二人。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守子女宫，入庙或乘胜旺，见辅弼、魁钺、昌曲，皆主子女可以兴家。 
七杀守子女宫主孤。以先女后子为宜。 
庙旺会吉，一子。平间宫纵得一子亦主强横破家。陷地见煞者绝嗣。 
七杀守子女宫，父子感情有代沟。 
七杀独守，见四煞空劫刑忌者无子，亦不宜招外子，主不得力。 
化忌会照，煞少者，有子女，唯多灾病。 
空劫会照，钱财因子女而破耗。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀紫薇"):
                tmp = """七杀唯喜与紫微同度，子女三人，且佳。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军入子女宫，酋胎刑伤，多流产小产。须偏房继室生子，先立祀子亦可。 
入庙三子，性刚强。见禄则为兴家之才。 
破军守子女宫见四煞，一子，且不得力。 
 见羊陀相生有制则有一子，难依靠。 
 见火铃空劫，一子，难依靠。 
破军入子女宫，长子易破相，或口吃，或不足月生。"""
        print(tmp)
        print("\n")
    print("-------------------------------------")
    tmp = """(附)辅佐煞曜对子女宫的影响 
 禄存 
主庶室继室生子始得力，且可成器。 
子女性谨慎，善守财。见煞则主吝啬。 
 天马 
主子女远离。会化禄、禄存，宜出国发展。再见三化吉曜，子女必秀发。 
会四煞刑忌，子女不雇父母。再见天刑，多灾病。 
左辅、右弼 
主子女得力，可以兴家。 
亦主子女数目比正曜星系所显示者为多。 
文昌、文曲 
主子女聪明秀发。学业成绩佳。 
会吉曜，化禄化权化科，主贵显。 
遇四煞，主子女易为虚浮。 
天魁、天钺 
主子女可贵。 
 性格忠厚，老年可靠。若会煞刑，则子女好走偏锋。 
 火星、铃星 
主孤独。 
性急。但入庙则主忠厚。 
刑忌重恐伤残身体。 
 擎羊、陀罗 
主刑、主孤。与浮荡的星曜会合，主性格易流于虚诈。 
煞忌重主不孝。地空、地劫 
 若地空、地劫与化忌同会子女宫，恐绝嗣。有吉解，有子亦恐夭折。偏房或继室
生子吉，亦宜先招祀子。"""
    print(tmp)
    print("\n")
def GongChu5th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守财帛宫，一般情形下主富厚。 
会照破军，须先经波折然后得财，唯得财后仍何波折。会煞则防得后破败。 
横发暴发的情形，是紫微会照七杀，且何吉祥星曜会合，最喜会左辅右弼，则
丰财源由多方面而来。 
另一种情形则是，紫微会照擎羊或陀罗；紫微会照火星或铃星。尤其是当紫微
或火铃羊陀人庙时，更主横发，唯恐不耐久。但若见刑忌、空劫，则纵然横发，但
恐破后更贫。 
紫微守财帛宫，不喜地空、地劫、大耗川迂或会照，主受人欺凌侵剥以致破耗。
纵有吉曜同时会照，亦主财来财去无法积蓄。 
紫微喜与禄存或化禄同度或会照，则主财帑能储蓄，亦主人擅长理财。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫府，主财帛充盈，一生富裕，唯善枳财未必善于运用钱财。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，宜以本身才艺求财，虽经历艰难一不会煞忌亦能富裕。见火、铃，因有
紫微克制火铃的力量。反不如[火贪格]、[铃贪格]之能骤发。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，如命宫为七杀之[雄宿乾元格]，不会恶煞，主财帛丰盈。若会恶曜，则财帛有成亦何破。须详每大限财帛宫而定。唯一生必有意外财源，因之骤发。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """紫破，见煞反能横发，但恐不久。不见煞，主可得财，但仍有成败。见吉亦主
可得意外之财，或财源极其特殊，但以未宫较丑宫为佳。  """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，有吉星祥曜扶持可以横发。但晚年仍防破败。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守财帛宫，主有财难储。即使入庙，亦不过财来财去，无缺乏之虞。 
人庙，与禄存、天马、化禄会合：定富裕，财帛丰足。若天机化禄，则主由旧
业中生出新业得财。单见禄存，小人觊觎。 
若落陷地，则财源多变化周折，且主人劳心劳力。再会煞曜，历艰辛而后得财。
唯最嫌与巨门会照，必须费尽唇舌，劳神思虑然后得财，尤主凡事引起竞争。 
与天梁会照，则主人巧计谋财，临事多机变。 
最忌四煞、空劫、大耗会照，则难多发财机缘，唯聚而后散。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机月，主白手兴家，或不藉父母余荫而自身创业得财。 """
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """机巨，劳神费力，竞争多端。凡事未插手时，则无人注意，一旦进行，则引起
别人追随争夺。且凡得财必须费尽唇舌。  """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，主机关巧计以谋求。若会煞忌，则机关赞尽亦主贫穷。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳入庙，通常皆主财帛丰盈。但太阳本身有一特性，即是[施而不受]，因为
阳光普照是施出，太阳从未向任何物体接受过光和热。由于具有这种本质，所以太
阳坐财帛宫即使人庙，亦主一生的负担极重，或因家累，或因资助兄弟、朋友甚至
下属，而致开支甚大。 
如果太阳落陷，由于太阳本身不发光，所以不会像入庙的太阳那样有沉重的负
担，亦不如其有乐善妤施的品格，删主人一生劳心费力，然而亦不过财来财去始终
难以积蓄。 
最喜会照禄存天马，则虽劳心思虑，仍亦可成大富。著会煞刑忌耗诸曜，则劳
而无功，为人作嫁；或甚至自己掘井，别人饮水。 
若见巨门会合，财必由竞争而米，主劳心赞冲。但其人必能因创业得财。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """日月，财帛先散后聚。喜见左辅右弼会照，与太阴太阳各成[对星]，扶助有力，
主得人提携带挈以发财。更见化禄、禄存及诸吉，发财万金。  """
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """日巨，太阳巨门于寅中二酉同度，寅宫主庸旺之乡，自比申寓为佳，所以在寅
宫者可以白手创业，虽劳碌竞争、中年以后仍有所获，叉主得人信任．在已成基业
下扩充发展；或主受外国人提拔推崇。 """
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """阳梁．在卯寓太阳为旭日初升，可以消解天梁的孤忌性质，所以虽征财帛方面
常起争夺，但仍主可以丰足，唯必须加诸吉曜者始是。在酉宫太阳西沉，争夺更重。
见擎羊、天刑，主因财生讼。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲为司财帛的主星，人庙主财帛丰足，而且得财顺利。亦主其人有管理财帛
的能力。 
如入庙更会化禄、禄存、天马者，更为巨富之格。唯如无其他吉曜会合，仅得
禄能上能下，则主在劳心劳力中进财，或在竞争中得利。 
武曲不喜会照破军。虽会吉曜，亦主财来财去，有波浪起伏，唯终能积蓄；如
凶星恶曜并会，则终无积财之望。 
武曲亦喜紫微、天相同时会照，主财源丰足。 
 见[火贪]或[铃贪]。会照，主有意外之财。但若同宫，则反不如拱会。 
最不喜擎羊、陀罗同度，主因财生灾。 
见化忌，主周转困难。武曲自身化忌，周转更加困难。 
见地空地劫，主人忙碌求财，且少成多破。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，武曲财星，遇天府财库，若会照左辅右弼、禄存化禄，更为大富者的格
局。倘见煞忌，亦主温饱。格平常者，则主富足。  """
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武贪，会照火星或铃星，见禄存、化禄，主暴发；唯不见火星而见桃花诸曜，
则主因色破财；倘见羊陀、空劫、大耗，主因赌博或投机而破产。独见武贪，主中
年始可发达。  """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武相，二曜同宫，必与紫微会照。以寅宫者为优，申宫较次，因寅宫所会紫微
在午，较申宫所会在子者庙旺。武相紫三曜相会，财源茂盛。唯见煞曜，则主巧艺
或专门知识生财。  """
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，如不见煞曜，主白手兴家生财。见禄或禄存，主富足，晚年亦有积蓄。
但有煞曜，则主横得横失，暴发暴破。倘煞曜、天刑会照，主因财生灾。擎羊同度，
或火星同度，则主有争夺、劫掠、偷盗等情，更不宜见阴煞或劫煞。  """
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，主财来财去，虽有禄存、化禄、天马，亦难积储。但天府坐夫妻宫，故
夫妻宫会合众吉者，可藉配偶之力储财。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """凡天同在财帛宫，必主白手兴家，或以微资发家。所以多主人中年以后安定，
晚年始有积聚。 
与禄存、化禄、天马会照者，定主富足。 
 若见擎羊、陀罗、火星、铃星、地劫、地空等煞嘲会照，而见龙池风阁，则丰艺
术巧技兴家，且为人有名士风致，但不能富有。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """同月，二曜同宫，见吉曜，虽白手兴家，但主有意外收获。这种意外收获跟[火
贪]、[铃贪]不同，少竞争或暴发的意味，仪主有意料之外的机遇。倘见煞曜，则难
枞聚。 
同月，一般情形下主财源得失无定，难积聚。若见吉星祥曜，则仍主丰裕，唯
仍主以专门知识技能致富，尤宜医药、法律。  """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """同梁，二曜会太阴天机，若再见诸吉，仍主一生衣禄丰足。见擎羊、天刑，则有纷争，唯从事医药、法律或社会工作者可免。见煞，亦主技艺谋生；无煞，可担
任公职。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞入庙居财帛宫，主竞争中生财。 
若入陷宫，则主于艰难中得财，且财来财去聚散无常。 
廉贞化忌，主因财而致生烦个商，或因感情困扰而破财。煞曜刑忌并见，主因
财生灾。遇空劫、大耗，防洛贼窥劫。 
最坏的结构是化忌、羊陀、空劫并遇，主因官非而破财。 
 
廉破，喜见命寓武曲贪狼会合本宫的火星铃星，则可横发，但恐发后横破。若
见禄存、化禄诸吉，亦丰劳碌 
中生财，但亦有破败。但若见煞忌会合，则主人破败多端，一生穷困。再见大耗，
贫无立锥。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，得紫微天孵、武曲会照，最宜从商，见吉曜，主富足。逢擎羊或火星同宫，
反主可威巨富。但再见煞曜，则反有破财。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，二曜同宫于丑未，以居未寓者可成大富，丑宫次之。唯均主于竞争中生
财。若见煞忌，则主贫寒。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉府，若见禄马，更见昌曲、魁钺，主一生富足，若无吉曜，中人之产，见煞
忌则有倾败。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贪，最喜火星或铃星同度，会照者亦吉，丰有意外财源。否则亦主横发横破。
再见煞则破败尤甚。但若见化忌，从事军警、或以外科手术为业，或作牙医，下格
者宜作屠宰，则可免凶危，见吉会且主富裕。唯一生不宜投机，亦须防因色破败。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府为财库，守财帛宫，主人可积聚，故多一一生富足。 
若会左辅右弼、禄存、化禄．更见紫微、武曲者，则为巨富之格。 
 天府居于平闲宫度，先经艰难而后得财。 
见地空、地劫、大耗，亦不主破败，仅主每进财必同时有损耗。 
若会照羊陀、火铃、天刑，始主因财招惹纷争，或且牵涉争讼。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴主富，守财帛宫主富裕。 
入庙宫，与禄存、化禄、右辅右弼、文昌文曲相会，为富奢之命。 
入陷宫，有吉曜，富足；无吉曜，则须凭运限而定其财帛聚散。 
若会照四煞，劳心劳力而求财。否则主因财而生纠纷。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守财帛宫，最喜火星或铃星同度，则主横发，或主得意外之财。 
亦喜禄存、化禄会照，则主财禄丰盈。 
若见煞再与成池、大耗、天刑、天姚、红鸾、天喜、阴煞同会，则主因争倾家。廉贞会照，亦不宜见煞，否则亦主因色而财帛耗损。 
会照四煞，再见空劫，主因赌博投机破家；或主染不良嗜好而至破败。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守财帛宫，主劳心费力，于竞争中生财。或主凭脑力思虑，或主凭口才，
费尽唇舌而得财。 
巨门在财帛宫，亦主人白手兴家。 
巨门会照吉曜，或化禄、化权、禄存同度，皆主富裕。唯防发财后气焰带逼人，
或理想太高，不量力而为，则主受人排挤。 
凡巨门守财帛宫，皆伏破败之机。若自身能收敛锋芒，不生破败，则须教育子
女，防子女败散。 
 若见擎羊、陀罗同度，主因财纠纷涉讼。 
 倘火铃、空劫、大耗同度或会照，则主有盗劫或火灾。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门天同"):
                tmp = """天同巨门，白手创业，且宜忌专业谋生。"""
                print(tmp)
                print("\n")
            elif(star == "巨门太阳"):
                tmp = """巨门太阳，利与外国人交往，可受推重，因而致富。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相在财帛宫必与天府会照，印星与财库相会，若得禄存、化禄等吉星照会，自
主财帛丰足，即居陷地，亦主人可以白手成家。一一如与廉贞同度，则可从商，主
长袖善舞；若与武曲同度，则以专门技艺兴家。 
与紫微会照，一生必有突然发达的机遇。 
与武啦破军拱会，则主得失无定，或主破尽祖业而后生财。 
武曲破军会拱、再逢空劫 、大耗，则家无恒产，或甚至透支，若与煞曜、天删
会台，则因财纷争，煞重且见化忌者，可至倾家，否则即为牢狱之灾。无苦星解救，
且或有性命之虞。 
无武曲破军拱照而见煞曜刑忌，刚主忽得忽失，败难积聚。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁最喜与太阴会合。若入腼会照太阴、化禄、禄存，则主可以发达。再见天
巫。则主可以承受遗产，或垂手而得现成财帛。 
与化禄、化极、化科会合，古人称为[白屋公卿]，即富裕而无功名。 
天梁不喜居子宫为财帛宫，主虽有财源，但耗散亦多。 
若与化忌照会，主因财而生是非口舌纷争。或因败而敢精神痛苦。 
若与羊陀、火铃、空助、人耗、天刑会照，则主有破产的危险，或因财而生巨
变，或涉讼而招巨大破损。得吉星祥曜，如魁钺、昌曲、辅弼化解，则主历尽艰辛
而后得财，但仍不免有支绌之苦。 
生财。 
武曲破军会拱，再逢空劫 t 大耗，则家无恒产，或甚至透支。若与煞曜、天删
会合，则因财纷争，煞重且见化忌者，可至倾家，否则即为牢狱之灾。无吉星解救，目减致有性命之虞。 
无武曲破军拱照而见煞曜刑忌，则主忽得忽失，财难积聚。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀入庙，会照化禄、化权、化科、神通存者，主财源丰厚，能得意外财源。 
喜居辰、戌二宫，人天罗地网反能发达致富。较居卯、酉二宫之武曲七杀为传，
盖武杀难能暴发，亦能暴败。 
七杀居财帛，若与煞曜、天删会照，主因财生灾，或遭抢劫偷盗。 
与空劫、大耗会照，则常感困乏，须凭劳力求财而多感不足。且破耗机会极多。 
七杀居财帛宫，无沦在何宫度，皆主一生必须经过一次危机，轻则周转困难，
重则倾家破产，但览化禄、禄存及诸吉者，可以于短期内翻身。落陷，再见煞曜、
空劫、大耗会照而吉曜全无，则时感穷困。再见刑忌，一生奇贫。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军在子、午宫独坐，会化禄、化权、化科，主富贵。在辰、戌天罗地网者次
之。 
破军不喜独坐寅、申宫，主人祖业倾败。 
破军与地空、地劫同度，入不敷支。 
擎羊、火星同度，暴得暴失。 
陀罗、大耗同度，则生纠纷烦扰，破耗极重。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """破军与紫微在丑、未二宫，主得意外之财，或生财之道非常特异。末宫为胜、
丑宫次之。唯流年再行丑、未宫，购虑有破耗。"""
                print(tmp)
                print("\n")
    print("-------------------------------------------")
    tmp = """(附)辅佐煞曜对财帛宫的影响 
 禄存 
加众吉，财源丰茂。 
加煞曜，劳中生财，终可积聚。
遇空劫同度，会煞忌，虽有亦如无。或一生多钱财争讼。天马 
与禄存或化禄会合，可以增加财帛收益。 
文昌 
最喜与巨门同度，主富。 
入庙见诸吉，可得贵人财。 
若煞忌刑耗并见，一生寒士。 
 文曲 
亦喜与巨门同度，主费口舌可以生财。余如文昌。 
天魁、天钺 
主人近贵得财。亦主人因政府条例或公司企业规例原则之改变而得财。 
左辅、右弼 
主得人助力，或得人提拔推崇而生财。 
 擎羊、陀罗 
一般均主竞争。 
加天刑、化忌、大耗，主因财耗散，而至一生奇贫。唯擎羊遇火星，反主有得
有失。 
火星、铃星 
一般主是非。 
入庙，亦主横发横破。落陷，则主劳苦求财。 
再见煞曜会合，更见空劫刑忌，贫无立锥。"""
    print(tmp)
    print("\n")
def GongChu6th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守疾厄宫，一般均主脾胃病。常见的情形，是腹泻、呕吐、气痛、气胀。 
脾胃有病，有时亦表现为脾土不运化而致吸收不良，或胃纳不佳而致胃寒。 
见属土的星曜多，如天府、左辅、禄存、化禄、三台、八座、恩光、天贵、天
官、天福、台辅、封诰，则主有肾病，或主生殖系统病。亦主患色痨。 
与火星铃星同度会照，主湿火、湿疹、皮肤病、胃热、消化不良。 
与空劫同度会照，主眼目昏花、青光眼、胃痛胃寒、胃神经痛。   
凡紫微入疾厄宫，见煞曜会照，又见天刑，主因病动手术。 
紫微会桃花诸曜，再会廉贞化忌，主性病。尤以紫微破军同居丑未，会廉贞贪
狼者，患性病的可能更大。疾厄宫有此结构的人，宜戒沾花惹草。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇破军"):
                tmp = """紫微破军，主妇女暗病。会擎羊，主手术或破相。亦主口吃、神经紧张。见属
火的星曜重，防神经系统有疾患。再加四煞并照，或为神经过敏、心肾不交、血气
不和。若煞忌刑曜重重，则主神经分裂。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫微贪狼，主好色。会照天姚、咸池等，有手淫、遗精、色痨等病。若会擎羊，
男主包皮过长；女主外阴皮长，或有妇女暗病。会红鸾、天喜者，经期不准、赤白
带、子宫暗病。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫微天相，主患皮肤过敏、或者胆石、肾石、膀胱结石。加煞则为盲肠炎，加
火铃，营养吸收不佳。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫微七杀，主大肠乾结或虚泻。气虚阴亏、气痛。见煞曜，则主外伤。若会廉
贞化忌，防意外伤损。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天府"):
                tmp = """紫微天府同度或会照，亦主胃病。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守疾厄宫，一般主患肝病、胆病。或主人于婴儿时多灾病，易患惊风。――
风属木，故天机亦主惊风。 
肝胆有病，表现出来为肝气胃痛；肝旺脾虚以致吸收营养的机能欠佳；或主肝
阳上亢，出现头晕目眩、眼风等现象，女命则主经血枯少，此乃阴分亏损之故。 
 女命天机守疾厄宫，更见太阴、红鸾天喜、咸池、天姚同度，主经期不准、
经痛，或子宫有暗病如子宫不正之类。
天机与擎羊、天刑、大耗同度，主需动手术。 
天机若与属水的星曜会合众者，如太阴、天同、文曲、右弼、化忌、天姚、
红鸾、天喜等，谓之[母慈灭子]，木受水生太过，反主木病，可影响至内分泌失调，
或致有热毒、湿火、筋骨之疾。于病理上，皆谓由阴虚引起。  
天机与煞曜会合，蜚廉同度，肝虫。 
天机与属火的星曜，如天魁、天钺、地空、地劫、孤辰、寡宿等会合，主眼炎。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机巨门"):
                tmp = """天机巨门同度，为肝木克脾土的疾患，表现为肝气郁痛，或肠胃多气。见煞曜、
天虚、阴煞，则主患阴疽。若煞、忌、刑、耗并照或同度，则有患胃癌的可能。 """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """天机天梁同度，亦为木克脾土，主胃纳不和、消化不良。见羊陀，则湿火伤筋，
再见天刑，则主盲肠炎。若见火星、铃星、化忌、天刑并照，再与阴煞、劫杀会合
或同度，则有乳癌、胃癌的可能。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳守疾厄宫，一般均主血压心脏有病，如血压高、血糖高，或血管栓塞。故亦有
头痛、头晕、眼花等现象。太阳在午宫守疾厄宫，或落陷遇羊陀，主患目疾，或眼
睛常露红筋。更逢化忌，则眼目伤损。 
 太阳守命或疾厄宫，一般均主患近视、散光。亦主易中风。 
 太阳亦主肝阳上亢、大肠燥结等一切阳明疾患。亦主便血、痔漏等。 
 太阳守疾厄宫，与属木的星曜会合，反主内分泌系统有病。  
独见天刑，亦主吸毒。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """太阳太阴同宫，主心肾不交，阴阳不和，故主易得神经系统疾患，轻者为失眠，
见煞忌星曜会合，防胁痛、心脏病。再见天刑、天伤、空劫，则易见破伤风。  """
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """太阳巨门同宫，主血压病，但陀罗同度，则主半身不遂。亦主患偏头痛、头风。"""
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """太阳太梁同宫，为火士星曜会合，故亦主内分泌系统及循环器官疾病。见火铃，[母慈灭子]，天梁反主因受生太过而致病，再见刑忌，主患乳癌、胃癌。 
内分泌疾患，则为甲状腺分泌亢进之类。亦主易生湿疹、风斑等疾。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲守疾厄寓，一般均丰肺部及呼吸器官疾病。 
若见天马及火铃，为属火的星曜，伤克武曲阴金，咳嗽、吐血。为肺结核的现
象。更见天刑、化忌，则主有肺癌的危险。 
武曲亦主鼻衄、声哑。或支气管炎、气管炎等疾患。 
由于武曲亦主小肠痛症，故可表现为大便燥结，或阳明喉痛。 
武曲与文曲同度，见火、铃，主白喉、鹅喉。 
倘武曲守疾厄宫，见火、铃、羊、陀、空、劫、天刑，则一生多灾病，且主开
刀手术。武曲天府同度，一般情形下灾病轻。但武曲化忌，再见煞曜，则有胃病；
武曲化忌，防胃癌、或肺癌。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲贪狼"):
                tmp = """武曲贪狼同度，或会合照，主手脚易伤。若煞、忌、刑曜会照，武曲更化为忌
星，则主易患肝癌、肝硬化。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武曲天相同宫，有破军拱照，主易破相，或面上有瘢疮。破军化禄拱照，主整
容。若见煞刑诸曜重者，则有暗病，或主受损害，须动植皮、重植等手术。"""
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武曲七杀，一般均主损伤，若会陀罗则手足相残；见空劫，金受火克，则有呼
吸系统敏感诸疾。 """
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武曲破军，一般情形下主牙痛拔牙、补牙、牙周痫等。若武曲化忌，更见诸煞，
则为瘤肿癌症之灾。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同入疾厄宫，一般情形下主灾难少。在疾病方面，则表现为肾脏、膀胱、尿
道、输精管或输卵管的疾病。 
天同见煞曜，则主子宫病、前列腺病。或主淋病、疝气、痔疮。 
天同见天虚、凤阁、天月，则主寒热风邪，或见腹痛水泻。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同巨门"):
                tmp = """天同巨门同度，或会照见煞，主骨质增生、骨剌、骨膜退化等症，以致影响手
足神经，而生麻痹、疼痛。煞忌多会，易因骨病或小儿麻痹、骨痨等得残疾，可致
瘫痪。 """
                print(tmp)
                print("\n")
            elif(star == "天同太阴"):
                tmp = """天同太阴同度，则主胸隔胀闷、水肿、鼓胀、脚气、维生素乙缺乏，及四肢
无力、身体怠倦等湿气疾患。若煞忌多会，亦可主人瘫痪麻木。亦主眼目疾。亦主
神经衰弱。 """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """天同天梁同度，主肝胃气痛。若见煞曜，则主心气痛、心肌栓塞或血管疾患。
落陷更见煞忌刑耗，女命肾病或妇科缠绵；男子亦主肾病，或生殖能力不足。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞在疾厄宫，多主虚火上升或心火急燥，此乃以廉贞为阴火之故。 
廉贞在斗数中又为[血星]，故主便血、咯血、心血、亏损、心肾不交而致血份亏少失眠、贫血等疾。女命亦主经血不足，经期不准。化忌者，见煞曜刑主血癌，
或先天性贫血。 
廉贞为次桃花，守疾厄宫，故又主手淫、意淫、遗精、淋病、梅毒，及诸般性
病。 
廉贞守疾厄宫，亦主人易患流行性感冒。见天月，则感冒缠绵，以致鼻过敏、
气管过敏。 
若廉贞化忌，见煞曜、空劫，则有血光之灾，见天刑者尤的确；若无天刑，恐
亦主有脓血之病，轻者为易生暗疮。
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞贪狼"):
                tmp = """廉贞贪狼同度，男命主梦遗，女命主经痛，或子宫疾患。见煞忌刑耗及空劫，
则可能生殖器官崽癌病。煞忌轻者，女命则主子宫倾斜，或妇女暗病。独见火星，
男女皆主腰痛、肝气痛。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天相"):
                tmp = """廉贞天相同度，主糖尿病，或膀胱、肾脏结石。若见桃花诸曜，如红鸾、天喜、
咸池、夫姚等，则有淋病、白浊等性病。男子亦主遗精，女子则有阴虚诸病。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉贞七杀同度，主人幼年多病，有肺痨、咳嗽、咳血等疾。若会擎羊，则主便
血，见化忌、天刑、煞重，或肠癌，或意外受伤而有血灾。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉贞破军同度，亦主有肾石、膀胱结石等症。若遇化忌及见煞，则可能须动手
术，或主面上多瘢痕。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守疾厄宫，一般主胃病，及有脚气浮肿、湿气麻痹，以及鼓胀等疾。 
若会照华盖、天才，则为土被木伤，主有反胃、怔忡等病。 
由于胃痛，若见属火星曜，主胃热，亦主口臭牙疳、舌疮等症。若见属水星曜，
则主胃寒、胃下垂。 
天府与廉贞会照，主湿火。 
天府与天相、右弼会照，主胃寒、胃痛。 
天府与七杀、天刑会照，则主有伤损。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守疾厄宫，一般皆主阴虚亏损。表现为泻痢、脚肿、阴瘘、或脾胃及小肠
湿热。 
见桃花诸曜，如红鸾、天喜、成池、大耗、阴煞、天虚，男子主肾虚精冷。女
子主冷感。蒋见煞曜、刑忌，则阴分极亏，可致因气血不和而生之诸般恶跃，如糖
尿、水肿、恶疾、鼓胀以及瘫痪。 
太阴会天同，主眼病，如飞蚊癍之类。亦主任何有斑点之疾患，更会文曲化忌，
则主麻诊。 
太阴会天机，亦丰妇女暗病。若太阴化意，则反主肝旺致成固疾。若天机化忌，
更见煞曜及天虚、阴煞，男主阳痿，女则阴痿。一般情况下，亦主神经过敏。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼在疾厄宫，一般均主有肝胆病。主肝旺、脾虚、胆分泌失调。幼年则主肝
风抽缩。 
贪狼与擎羊、陀罗、火星，主有痔疮。若更会廉贞，则主肝气痛，或头晕、头
风、贫血等症。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "寅" or dizhi == "申"):
            tmp = """贪狼独坐于寅、申宫时，必与廉贞相对，主阴虚、腰痛。见煞忌刑曜，及天虚，
则主亏损、肾病、生殖机能病。 """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "贪狼紫薇"):
                tmp = """贪狼与紫微同度，见煞曜，主多欲。贪狼化忌，则主手淫，并主阴亏损、虚阳
上亢。中晚年则主阳痿。  """
                print(tmp)
                print("\n")
            elif(star == "贪狼廉贞"):
                tmp = """廉贞与贪狼同度于巳、亥宫，则主梦遗，性欲亢进。女命更主经痛、腰痛、子
宫不正、赤白带、及妇女暗病。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守疾厄宫，主脾胃病及消化杌能病。但由于土能生金，若脾土虚弱，则金
亦少生助，故亦可能牵连致呼吸器官疾病。
故巨门在疾厄宫，见禄存或化禄，则主暴饮暴食而致生胃病。 
若见擎羊、陀罗、化忌、天刑，则主有生胃癌、食道癌的可能。
由于胃病，或消化机能不佳，亦主人消瘦、阴损。更见天虚、大耗，则为阴疽
或肺病，再若煞曜刑忌并见则为肺癌。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门天机"):
                tmp = """巨门与天机同度，主肝胃不和，表徵为嗳气、嗳酸、反胃等。或心气郁结、胸
膈闷积。 """
                print(tmp)
                print("\n")
            elif(star == "巨门太阳"):
                tmp = """巨门与太阳同度，则为高血压。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天同"):
                tmp = """巨门与天同同度，则为坐骨神经痛之类骨病；或为湿疮、癣疮、汗癣。若煞忌
刑耗并会，且天刑、擎羊与天梁同度于卯酉宫，则为食道癌，或骨癌。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相在疾厄宫，主膀胱、尿道疾病、有时亦主胆病。 
亦主由肾水失调引起之疾患，如糖尿、肾石、膀胱结石等。 
 由于湿毒，亦引起皮肤病，如皮肤过敏、湿疹、湿癣之类。更会红鸾、天喜、咸
池、天姚，则为白浊、淋病、梅毒。见煞曜，则为难治之性病。 
与擎羊、陀罗、天刑会照，主风湿骨痛、心脏衰弱，及手足瘫痪、麻木不仁。 
天相与火星、铃星、天月会照，则主感冒、疟疾。亦主皮肤湿毒。 
天相坐疾厄宫，对宫紫微破军拱照，而破军不化禄，亦不得禄存同度，则主人
先天不足。若中晚运见此星系。则主人后天亏损。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守疾厄宫，多可使疾病转危为安。但有煞总会照，则必先见重症然后得愈，
始见天梁消灾解难的能力。 
天梁主肠胃病，消化不良。在寅、申两宫，则主胃冲经痛。 
擎羊、陀罗、天刑同度或会照，则主手脚外伤，或筋骨受伤。亦主胸腰有伤。亦主盲肠炎，或急性肠炎。 
火星、铃星同度主疮瘤肿毒。亦主乳癌、胃癌。见化忌、天刑者尤的确。 
天梁与地劫、地空、大耗同度或会照，则主风湿痹痛。 
与天月、阴煞同度，则易患时疫、流行性感冒、虚亏性之晕眩等。 
太阳天梁同度，见煞耗，亦主内分泌失调。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀临疾厄宫，主人幼年多灾病，且易暴怒，伤致肝肺。  
有紫微或天府拱照，主肠胃不和，胃纳不佳。紫府同时拱会，又见擎羊，亦主
瘤肿之灾。轻删为盲肠炎，肠胃炎。见天马、天刑、天魁、天钺，刚差便血、咯血。 
七杀火星同度，主目疾，为阴虚所致。 
七杀龙池同度，主耳聋，为金不荞水，肾阳受损所致。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀武曲"):
                tmp = """武曲七杀同度，主受伤，会陀罗则丰手足受伤，煞重则可致残疾。 """
                print(tmp)
                print("\n")
            elif(star == "七杀廉贞"):
                tmp = """与廉贞同度，多扭转、跌伤、撞伤。煞曜及化忌会照，则为瘤肿之灾，或为血
疾。 
 廉贞同度，亦主肺瘸，咳血。蔷更见红鸾、天喜，则为哮喘。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守疾厄宫，主人幼年多脓血之灾。见天虚、大耗、阴煞，主人不足月生，
需受特殊照料。 
破军与擎羊同度，主开刀或手术。 
破军为阴水，故主人有生殖机能疾患，如遗精、阳痿、女子经痛、赤白带。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """紫微破军，主腹泻。 """
                print(tmp)
                print("\n")
            elif(star == "破军武曲"):
                tmp = """武曲同度，主牙痛亦女口牙周病，故主牙科手术及拔牙。并主日疾，及男亏损
诸般疾患。 
武曲同度而化忌，主癌症，亦发痫于生殖器官。 """
                print(tmp)
                print("\n")
def GongChu7th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守迁移宫，主出外得人敬重。 
更会照左辅、右弼，出外得人助力。亦主交游广阔，或所交多益友。 
若会天魁、天钺或化禄、化杈、化科，则主有贵人助力而得益。倘命宫星曜不
吉者，应考虑离开出生地发展。 
紫微会照禄存、化禄、天马，则主出门得财，亦宜外出。但若同时会照煞曜、
空劫，则虽出外得财，但却与人竞争及交恶。 
倘紫微与禄存同度，虽主能出外发财唯主受人排挤。应避免出锋头。 
 擎羊、陀罗与紫微会照，主少人缘，亦主心绪不宁。火星、铃星、地空、地劫、
大耗、天刑会照，则在外多是非口舌，煞重者更主官非、破财。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫府，出外得人尊重或提拔。离出生地经营或就业，可以得利，且提高社会地
位。见禄存、天马、化禄者，出外财气尤丰。  """
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """紫破，出处可得人扶助，但同时亦必有小人妒忌是非。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，出门得人敬畏，或出门遇贵人。但煞曜与天刑同会，则主在外受人连累
或陷害。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，无煞会照，出门常受人欢迎尊敬，且交际应酬愉快。有煞，仅主劳心劳
力而成事业；倘煞曜、化忌、零劫、天刑多见，则主被盗窃或抢劫。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，有煞则成败参半，得人助力，亦遭人破；若无煞曜会照，则在外如愿，
亦主可发。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机为浮动的星曜，主活动，主变化。所以凡天机坐迁移宫的人，离开出生地
发展反而有利。若居于出生地，反主心志动摇不定，见异思迁，且易生是非口舌。 
但若天机在迁移宫会照擎羊、陀罗、火星、铃星、空劫者，则出门不利，主有
是非口舌、破财、惊险以及意外之灾。 
倘天机在迁移宫与太阴拱照，则圭出门可以得财，与禄存、化禄会照者，亦主
出门有财气，同会天马者更主于远方发达。一但禄马交驰而遇煞曜，则主一生奔忙，
煞重者甚至流浪天涯，虽然可以得利，但劳碌奔波异常。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机月，与天机、太阴对拱相会，亦主出门得财，加吉曜者尤佳。若禄马交驰，
更主出门或徙移可成巨富。  """
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """机巨，天机无论会照巨门，或与巨门同度，均宜出外创业。唯主费尽唇舌。但若同时会照煞曜，则主在外有是非口舌侵扰，若见化忌及天刑，则主有意外或官非。  """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，主出外有机缘，且多为现成的机会，垂手可得。或主贵人助力。见煞曜仅
一两点，又见文昌文曲，则为落拓江湖的文士。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳亦不是宁静的星曜，虽浮动性不如天机，但亦利动不利静。故凡太阳坐命
宫的人，不宜静守，宜出外发展。若出门或徒居外地，可以得近贵人以成事业。 
唯若太阳落于陷地，则主出外奔忙，劳心键力。虽近贵人，亦仅主受贵人东差
西遣。 
若太阳化忌，则东奔西走终无成就。倘化忌又见煞曜，则在外且主有灾或有病。
太阳在福德宫见羊、陀、火、铃四煞及空劫者，出门 
必有是非破耗。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """日月，出外必忙碌奔波。见文昌、文曲、左辅、右弼、天魁、天钺则必多贵人
助力，可以发达，但千万不能与人争斗，否则虽不逢煞曜，亦主破耗。  """
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """日巨，太阳巨门同度，在寅宫者优于中宫。见化禄、化权、化科或禄存者，主
出门事业可以大成-且能以言词取信于他人。又主得异方人欣赏及捉携，有意外收获。
符巨门化忌则主口舌；太阳化忌，则奔波劳碌而无成。  """
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """阳梁，太阳天梁居迁移宫，最利出外求名，宜出门求学。若阳、梁、昌、禄四
曜同会于迁移宫，定主在异地名成利就。太阳化忌，则仍多是非口舌。唯若于异地
教学，从事学术研究，或执业律师，或从事推销，则虽化忌亦无妨。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲守迁移宫，在一般情况下不利出门或徙移。因武曲为财帛星主，宜静不宜
动。 
所以凡武曲居迁移宫，出外必劳心费力，即有吉曜扶持，亦主劳碌奔忙然后发
财。若会照擎羊、陀罗、火星、铃星、地空、地劫、天刑、天虚等恶煞诸曜，则在
外虽奔波仍无结果，到头一场春梦，故引起悲观消极；又或诸事多昝多吝，时生纠
纷，往往功败垂成，亦足令人悲观失望。 
倘武曲化忌，更遇刑忌诸煞，则主于异乡有灾病，破耗甚大。   
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，主出门发财致富，远涉重洋者更佳。但逢陀罗、火星、阴煞，则防遇小
人阴谋，更见天刑、空劫，因阴谋而生灾病，更会擎羊，主有词讼官非。 """
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武贪，武曲贪狼同度，主在异邦发富，但不宜更见火星、铃星，不主暴发，只
主是非及纠纷。喜见禄存、化禄、化权、化科，名利双收。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武相，主在外名利双收，得意外财。唯见四煞及天刑会照，反主在外乡孤独。
煞曜刑忌重者，则主遭小人陷害以致遭祸。"""
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，武曲七杀同度，主人在异乡有甚强活动能力，交游广阔，并因此而获财
利。但若武曲化忌，在异乡有灾病，或事业失败。若在外邦定居，则一生中必有官
司，煞曜及刑忌多见者，且主有牢狱之灾。"""
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，武曲破军同度，主在异邦以技艺或专门知识，或以艺术谋生。见吉亦有
成，但仍主人心神不宁。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同在迁移宫，主人动静咸宜。若见禄马交驰于迁移宫，主在他乡可以致富。
否则亦主出门得福。 
唯天同落陷会照擎羊、陀罗，主在外多纷扰及灾祸。火星、铃星及天刑会照，
在外有斗争。地空、地劫会照，主旅途财物失窃，或因事破耗以致滞留于异乡。 
若天同入庙，见四煞、空劫，仍主不宁。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """同月，主远涉重洋，出门致富，唯奔波难免。若太阴落陷，则主艰辛。 """
                print(tmp)
                print("\n")
            elif(star == "天同巨门"):
                tmp = """同居，最喜禄存、化禄、化权同度，远涉重洋，白手创业，唯多烦恼是非口舌。 """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """同梁，出门发展稳定。见左辅右弼、天魁天钺、文昌文曲则多逢助力提携。唯
天同化忌则多口舌纷扰，不得安宁。见煞，主小人阴谋侵害。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞坐迁移宫，不宜在出生地留恋，以外走他乡为宜。喜得诸吉会照。最嫌化
忌，次则嫌见煞。 
廉贞为次桃花，故若廉贞化忌，主在外因酒色招灾。更见煞曜、天刑、大耗于
三方四正，无吉星祥曜化解，则主客死他乡。若煞刑轻，有吉曜扶持，但见天月，
则主于他乡染病。
廉贞最喜见紫微、天相，则可化解其凶，且主在外乡得贵人助力。
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，得天相同度，气质转为祥和，主人出外坚忍刚毅，终能创业，尤喜见三
吉化及禄存，则终有名利，即遇煞忌刑耗，亦可转危为安。但亦主在外少人缘，即
得左辅右弼扶持，仍难免孤独。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，此两星曜同度，吉凶变化甚大，有禄存、化禄会照，则主在外发达；但
若会照煞星、化忌，则主在外因财生灾，或因酒色而生祸，或有血光之灾。故遇此
等星曜结构居大限流年迁移宫者，不宜于此年限外出远游。若已离出生地者，则安
处异邦，不再作远行。待此年限过去，始可移动。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉破，星曜结构与廉贞七杀同度者相同，故可参考前节所述。唯廉破守迁移宫
者，遇吉曜，虽可发达，亦主凡事劳心费力，不如廉贞七杀者成就大。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贪，廉贞贪狼于迁移宫同度，主人在外擅长交际，人际关系甚佳，多应酬，
见吉曜，则能因此发福，见火、铃同度，更主异乡暴发，若见贪狼化忌，则凡事不
如理想；若廉贞化忌，则主在外因酒色而生灾危。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉府，在外交游广阔，遇吉，可作富商巨贾；遇煞曜，则作事多费精神。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府坐迁移宫，主人动静皆宜。 
若出外或徙居，可以遂心，且得入尊重，有助力，创业或经商，皆可富裕。尤
以会照武曲或武曲同度者为宜，利远涉重洋致富。最嫌天府落陷，逢陀罗、火星，更逢阴煞，则在外须．防小入阴谋。 
若与擎羊、天刑同度，则主小人损害。见大耗者主破财。 
倘擎羊、天月同度，则主染病他乡。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴在迁移宫入庙，主为人人缘极佳，在异乡有贵人扶持。 
若落陷地，则多招是非口舌阴谋。更见擎羊、陀罗、天刑、阴煞，则更多小人
阴损。即有吉星祥曜会合解救，亦主奔波而无结果。 
太阴化忌于庙旺之宫，主人犹豫不决。或受引诱投资而招致损失。见煞更主多
是非口舌。 
太阴与地劫、地空同度，在外必有破耗。 
凡太阴坐迁移宫，无论在何宫度，即使吉星遍集，亦不宜与人争强斗胜。凡事
退让三分，反成福泽。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼为正桃花，主酒色财气。故凡贪狼在迁移宫，会化禄、化权、化科或禄存，
主在异乡多酒色的应酬。多赌友、饮友，或花酒风月之友。最佳者则为有宗教信仰
的人，多宗教中的朋友。 
若会文昌文曲，则多诗酒应酬之乐。 
贪狼在迁移宫会照擎羊、陀罗、大耗、空劫，主出门遭盗贼窃掠。加会咸池、
天姚，主因色致祸。 
 凡与廉贞同度而遇煞，落陷或化忌，除酒色生灾外又主遭人陷害。倘吉星祥曜同
时会照，则虽有灾祸，但仍主其人能在外享乐。 
贪狼化忌，主为人夺爱。 
廉贞化忌，防脓血之灾。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "贪狼廉贞"):
                tmp = """唯与廉贞同度，则应酬固多，为人却主无事劳碌，但却无法偷闲。见煞，主因
色招灾。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守迁移宫，最喜有化禄、化权，或禄存同度。若巨门入庙，则主其人以讲
学、辩论名扬异域。故宜为外交人员。 
 倘巨门化忌，则出门多是非口舌纷扰，令人心神不宁，且劳碌奔波而少成。 
 若太阳在巳宫或午宫照会，由于阳光强烈，反易遭小人所忌。 
巨门在迁移宫遇擎羊、陀罗、火星、铃星、天刑、大耗会照，出外易遭灾屯。
且主人缘不佳，多是非。更遇流年化忌及流煞并临，则有牢狱之灾，或六亲刑克。 
故巨门在迁移宫会合星曜不吉者，以不离出生地方为宜。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守迁移宫，最喜化禄、化权、化科、禄存、左辅、右弼、天魁、天钺、天马
等吉星祥曜会照。主人在外有意料不及之机遇，一且得贵人提拔，友人助力，及当地人士摧崇拥护，可以发富或发福。 。  
武曲与破军拱照，则主欠人缘以致成败不一，唯宜以忍耐及毅力创业守业。 
不宜与地空、地劫、大耗、劫煞会照。否则主在异地多风波挠折。若与擎羊、
陀罗、火星、铃星、天刑等会照，则主在外易遭横祸，受小人陷害。有吉曜同时化
解，亦主少人缘。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天相紫薇"):
                tmp = """紫微同度，更主地位崇高，得人仰慕  """
                print(tmp)
                print("\n")
            elif(star == "天相武曲"):
                tmp = """武曲同度，则主在异邦得意外财源。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守迁移宫，在外为人敬畏。   
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """若在巳、亥二宫独坐，或在申富有天同同度，在出生地仅主奔波劳碌，不如远
涉他乡反为发福。更喜得化禄、化权、化科会照，在异邦可以成名立业。 """
            print(tmp)
            print("\n")
        elif(dizhi == "午"):
            tmp = """在午宫的天梁守迁移宫，亦喜远渡重洋，唯在此宫会的天梁，容易招小人妒忌；
以不强自出头，及不批评别人错误为宜。 """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天梁天机"):
                tmp = """天机天梁同守迁移宫者，多出门的机会，但在外多受化，令人不安，不如株守
家乡为宜。 """
                print(tmp)
                print("\n")
            elif(star == "天梁太阳"):
                tmp = """太阳与天梁同度，主人在异帮成名。尤宜从事医药、法律、会计、或理科研究。
若天梁与化忌同度，则出外主多是非口舌，更见四煞会照，出外有灾，且主遭
小人阴损。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀在迁移富，一般均主人在外乡有权势，可以威福，及令当地人士敬畏。 
 若与天刑同度，则主人在异乡有灾。若七杀落陷，则主受人连累。或在外受人压
力。再见煞曜，则主受威协。 
 擎羊、陀罗同度，最宜在异乡担任武职。或从事工程、技艺，否则主少人缘，且
必须历尽艰辛然后始能安定。 
 喜火星独与七杀同宫，则主有意外之财。若铃星独与七杀同度，财主人以武职，
或技艺立身，且事业可得成就。 
 七杀若与地空、地劫同度，则以投资工业为宜，否则反主流荡无依。 
 武曲化忌与七杀同度，则在外乡有灾，或事业失败，且主牵涉官非。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀廉贞" and dizhi == "丑"):
                tmp = """廉贞七杀在丑宫同度，出外难吉亦主必生是非口舌。  """
                print(tmp)
                print("\n")
            elif(star == "七杀紫薇"):
                tmp = """唯紫微七杀同守迁移宫，出外主为当地人士推重敬畏，最为吉祥。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守迁移宫，若离出生地。皆主以技艺谋生，或靠专门知识、专门技能以兴
家。若会吉星祥曜，则技艺为人敬服景仰。 
凡破军在迁移宫，皆主出外人缘不足，唯紫微破军为例外。 
破军亦不喜与文昌文曲会合，主为天涯寒士。若与文昌武曲同时照会，则主其
为优伶，穿州过府，远涉重洋以谋生。 
若破军与廉贞天相拱照，见文昌文曲，则主在外邦以曲艺或文艺求财。"""
        print(tmp)
        print("\n")
        if(dizhi == "子" or dizhi == "午"):
            tmp = """破军在子、午两宫守迁移，最宜出外远游，或定居异域。会吉曜则能发达。  """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """最喜紫微破军同守迁移宫，主得人助力，可以创兴事业。  """
                print(tmp)
                print("\n")
            elif(star == "破军武曲"):
                tmp = """若武曲与破军同度，则其人必有能文能武之技艺才能，可以在异邦立足。擎羊、陀罗、火星、铃星同度，出外多破败，不如在出生地发展，否则徒然奔
波劳碌。"""
                print(tmp)
                print("\n")
    print("---------------------------------------")
    tmp = """(附) 辅佐煞曜对迁移宫的影响 
 文昌、文曲 
遇吉曜则发达，加煞曜则欠安宁。 
文昌、文曲化忌于迁移宫，有可能失窃，或在外破财。 
左辅、右弼 
遇吉曜则主多助力。 
加煞曜刑忌，则反主小人竞争，是非口舌。 
天魁、天钺 
 在外主遇贵人扶助。 
 或主因异乡风俗、异乡法例适能投入之宜而致发福。 
 遇煞忌刑耗诸曜，反主凡事费力。且宜入境问禁。 
 禄存、天马 
 遇吉曜，则在外可以经营致富。若见恶煞凶曜，则少人缘。 
擎羊 
 主招竞争，主人缘不佳。亦主是非，更见天刑、大耗，注灾病，或主官非词讼。 
 陀罗 
主拖延，以致虽有良机出外亦不成行。 
见恶曜凶星会合，主少人缘，遭人妒忌。 
 火星、铃星 
一般主出门是非，见化忌、天刑则主出门有官非口舌。若见诸吉，则反主在异
乡发迹，唯仍劳心劳力奔波。 
 地空、地劫 
一般均主挫折。见擎羊、天刑、化忌，则在异乡倾败。"""
    print(tmp)
    print("\n")
def GongChu8th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守交友宫，星曜太强，一般情形下，主下属难以控制。若入庙，且有左辅、右弼等辅佐诸曜同度或会照，则星曜更强，虽在平辈交游
中主可得益友，但朋友必胜于己，而下属则必更难控制。但若自己能心胸宽广，提
携后辈，则可将人际关系改善，而且能得朋友及晚辈的拥护。 
若紫微落陷，无辅、佐吉曜会照，则主虚有其表，可能朋友众多，但却少知己；
又或主虽得结交有社会地位人士，但却关系疏远。亦主下属众多，但各有主见。 
 紫微最不喜于交友宫会照破军，若会照，又见空劫，则主受手下人连累，或因朋友
而破财。 
若紫微既会破军，又会陀罗，则主自己为手下人出头而招惹纠纷是非。 
紫微若会照四煞，则主手下人容易误事。在交游方面，则主难交益友，易近小
人，或为有地位人士所误。 
紫微若与化忌及擎羊相会，则主手下人薄情无义，得自己提携反以怨报，又或
受其出卖。在交游方面则主替人卖力，或予以帮助，但反受怨报。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇破军"):
                tmp = """紫破，主下属无情无义，以致自己遭受损失。或事业受到打击，或钱财受到损
失，或地位受到动摇。在朋友方面，主得能以忠言相谏之友，但若会照煞曜，则主
因友破财。倘煞忌刑耗并照，则主因朋友或下属连累而遭官非横祸。但若有吉星祥
曜会合，则因得交畏友而受益；下属虽无情义，但下属众多，且亦有一个时期可成
助力。又或主受有社会地位人士关照的机遇。唯关系易趋平淡。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天府"):
                tmp = """紫府，一般情况下主可交结有社会地位人士；下属众多，但意见不一。若紫微
化杈、化科，则下属多主见，能成为得力助手，若加以提携扶掖，则将来可成益友。
若天府化科则不宜更见禄存同宫，主下属虽可守财，但却不善经营，仅可守成。吉
曜会集，怨恨；或主下属有阴谋；若见空劫、大耗，则因友破财，或为下属偷盗。
若会武曲似 
忌，则主自己的上司为自己的下属所欺；若会廉贞化忌，则提拔下属反为所累。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫杀，最嫌紫杀同度，主受友人与下属排挤，纵会吉星祥曜，亦主受剥夺财帛
或权力。更见空劫、天刑、大耗，则主友人及下属以怨报德。火星、天刑同度，则
友人与下属多刚暴之人。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，主为人交游广阔。若见左辅右弼、天魁天钺、天巫、恩光、天贵、天福
会照，则到处得友人欢迎；若会化禄、化权、化科者，则因财富、权力，或名誉受
友人拥护；倘若见桃花诸曜，又见陀罗、阴煞，则受友人陷害，或为下属连累；或
因在风月场所交游而惹是非口舌。若禄存同度而见煞曜，删主与友人争财，或友人
多财而吝啬。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，主下属及友人有助力，若见吉曜及吉化会照，更主受有地位人士提携助
力。唯多为畏友，或友人与下属多正义之士。但若会煞曜，则主因友人或下属而破
财，更见空劫、大耗，则主代人受过。四煞、天刑、大耗会照，则多交损友，或受
下属盗窃。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守交友宫，会吉曜则主交游广阔，入庙亦然。但下属虽佳，却主时时变换。
得力助手难以长久。友人亦时更换。所人生虽不孤寂，但却难得下属长期助力。若
落陷，或会煞曜，则友人虽多，结怨者亦多；下属流动大，而且心怀不满。 
 以煞曜的性质来区分，擎羊、陀罗同度者一般主受友夫或下属之累，更见天刑，
则主受陷害。火星铃星同度，则主多争多夺，若天机化禄，更主因财争夺。见空劫、
大耗，随友破财，或凼更变下属而致财帛受损，或惹纷争而破耗。 
天机化禄见煞者，为交友而钱财耗散。更见化忌、天 
刑同会，主与友人或下属争讼。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机月，若入庙则交友广阔；但若落陷者，则须防友人或下属阴谋。若会天同化
禄，于大机构工作或担任公职者，主下属众多。交友宫同时会煞曜者，则防下属侵
吞，更见天刑，主受手下人累。"""
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """机巨，一般情形下主与友人多无谓的是非口舌，或虽宽厚而仍受下属埋怨，亦
主交浮滑之人。巨门化忌，不宜更见天刑，若见者则因纷争而致官非口舌。见煞曜、
羊陀主受累、争吵；见火铃主受陷害；见空、劫，主因意气是争而破财。"""
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，主能交益友、畏友，但友谊关系不长。若见吉曜者，则得友人助力，或
主得耿直之下属。唯下属仍多更换。所以交友宫若见天机天梁同度，必须善待下属，
始能扭转先天运势。若命富有禄存同度者，更宜注意调整下属的待遇。见煞忌刑曜，
因友人或下属而受拖累，或至裔官非，更见空劫、大耗，则主因拖累或官非破财。
但若有吉曜同会，则仅属虚惊。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳居交友宫，一般情形均主受友人或下属埋怨，若父母宫星曜不吉，更主时
受上司责成。这是因为太阳将光和热贡献普施，万物因而得益，但万物却不但没有
反报太阳，往往反而对太阳多所埋怨之故。 
若太阳化忌，则上述的情形更甚，常常代别人受过。 
若太阳与巨门会照，巨门化忌，则主更多冤枉的纷争。甚至为下属出头，反而
招到上司与下属两方面的埋怨。所以交友宫若值此星曜组合，必须凡事开诚布公，
而且绝不牵入任何交涉或纷争的漩涡。――例如代员工争取福利，或代老板调解工
潮等，皆有所不宜。 
会文昌、文曲、天魁、天钺、左辅、右弼者，若太阳入庙，则主可交有助力且
豪爽之友，下属亦多助力，但受埋怨责成的性质则不变，若会四煞、空劫者，下属
必以怨报德。化解之道为坚持原则，而且预早订定制度，交打专人负责执行，自己
尽量置身事外。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """日月，此为太阳入交友宫最吉利的星曜组合，主人缘佳，时得益友，下属助力
亦大。仅会煞刑诸曜，然后才有受下属、友人埋怨或受上司责成的性质，但人缘仍
好。太阳化忌主是非，太阳化忌见擎羊陀罗，则防手下有阴谋。日巨，太阳巨门同度，主是非口舌。见煞者更不利，详见上述。唯化禄、化杈、
化科，则主得能言善辩之友，或友人多法律界与传播界。亦唯跟这类行业的人交往，
然后才可改变是非、受怨的性质。"""
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """日梁，主多交政界人物或社会闻人，但若见擎羊、天刑、大耗，则主因交游而
破耗，甚且惹上官非。若见天魁天钺、左辅右弼、化禄、化权、化科者，则得正直
的友人或忠心的下属，且因友人而受益，得下属之助力，唯仍主受友人或下属埋怨。
所以交友宫逢此星曜，最忌因友人卷入政治漩涡，尤以在酉宫落陷为然。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲入交友宫，一般情形下主朋友少，下属亦不多。人缘亦欠佳。 
但若会左辅右弼、文昌文曲、及化禄、化权、化科者，始主友人及下属众多及
有助力，但仍难得心腹朋友或心腹下属。 
最忌见桃花诸曜，又会贪狼，则一生多酒肉朋友；亦不宜会破军再见化忌、大
耗、天巫、阴煞，主为友破财，资助别人，反受别人怨恨；亦不宜会照七杀，又见
煞暧，主受友人或下属出卖。总之，武曲居交友宫，与[杀破狼]会合者皆有所不宜。
武曲唯喜与天府相会，若武曲入庙，见吉曜会照，则不唯朋友众多，且主受朋
友及下属拥护，而自身亦有豪爽结交的个性。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武府，主朋友或下属众多，而且得力。为武曲入交友宫之最佳星曜结构。即使
会煞，亦不过主受小人怨恨。唯不宜武曲化忌，更见羊陀、天刑，则主自身财帛受
友人下属克剥，甚且引起极大争端。"""
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武贪，主交酒肉朋友。见桃花诸曜，主交色友；见空劫、大耗，则主交赌友。
若更见煞忌诸曜，则受友人或下属之引诱，以致破耗倾家。惟吉星祥曜会合，或武
曲化权、化禄者，始可将性质改善，但仍主需慎择交游、慎选下属。"""
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武相，一般情形下主友人或下属无义，若见煞曜同度，则主于重要关头遭出卖。
唯吉星祥曜同度，则仅主友人或下属与自身争财。逢此星曜结构，不宜与奉承自己
的友人深交，亦不宜倚重甜言蜜语、唯唯诺诺的下属。 """
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，为武曲坐交友宫的最坏结构，主受友人或下属出卖。若见吉噬会壤。更
见化禄、化权、化科者，则主友人及下属虽少，但尚 
可得力，若广事交游，或下属众广，则仍有受背弃的情形出观。武曲化忌，见煞耗
空劫，则主因友人拖累而破产，程峦破财；或受下属所累而有破耗。禄存同度，则
主受人排挤，以怨报德。  """
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，武曲破军同居交复宫，主下属多阿谄谀媚者，友人亦口是心非。逢占曜
会合当可不受损失，或友人与下属尚可利硐，但若逢大耗，必因友人或手下而破财。
见地空、地劫，则主受友人或下属于重要关头背弃。化忌，更见煞、刑、阴煞，受
出卖而惹官非。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守交友宫，交游广阔，且不拘于一个阶层。若左辅右弼、文昌文曲、天魁天钺并见者，更主其人广交五湖四海。在下属方面，亦主众多而且得力。 
唯天问若落陷地，则朋复或下属陷害虽多，但益友或能助己者卸少。 
喜与太阴或天梁会照，主得益友、畏友。下属能助已，或耿直刚介。 
不喜与巨门会照，主易受友人或下属误会。 
天同落陷更遇羊、陀，则遭友人拖累，或下属害。入庙则仅主不和，或下属无
助力。 
 天同落陷而见火、铃，受友人间气，或为下属顶撞。入庙则程度减轻。 
天同落陷与地空、地劫相会，主因友人或下属而破财。更见擎羊、陀罗、天刑、
阴煞，则受拖累而牵涉官非，以致破耗。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """同月，一般情形下主得交益友，或下属多助力。唯若四煞并见，又见天虚、阴
煞，则主因友人而受害，或下属有阴谋，宜加提防。 """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """同梁，主多耿介之友，或下属能忠于职守。若四煞、刑、耗并见，又见阴煞、
蜚廉，则易遭手下人陷害，而致事入词讼，见空劫者，主破耗。 """
                print(tmp)
                print("\n")
            elif(star == "天同巨门"):
                tmp = """同巨，主跟友人或下属多误会，或且反目成仇。与羊陀会照更多是非争讼。见
空劫、阴煞，则因友人或下属而破财。若四煞、刑忌、耗虚并见，则交友虽多，不
过点头朋友；下属虽多，不过徒具名份。人生不免孤寂。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞坐交友宫，主朋友或下属众多，但未必有助力，需详入庙落陷及会照星曜
而定。 
最喜见禄，无论为禄存或化禄，均主受友人助力而得财，或下属能生财。即使
廉贞落陷，亦不过打折扣而已。 
 但若廉贞落陷化忌而又逢煞曜，则反主因友破财。会文曲化忌，主借债不还；会
贪狼，主受友人或下属引诱，参加投机、赌博而致破财；若更见咸池、大耗、天姚，
则受引诱而因色破财。 
廉贞若与破军、七杀会照，更会羊、陀、火、铃、天刑、大耗、地劫、地空者，
主受友人或下属拖累而生官非。廉贞若再化忌，易生牢狱之灾。见阴煞者，须防下
属陷害。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，若廉贞化禄，或禄存同度，更见吉曜在三方四正扶持，主得友人助力兴
家，或下属可以助己生财。化忌者，虽见吉曜，亦防友人或下属虽可助己，但亦有
破财牵累。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，主友人多刚暴，下属与自身感情不洽。廉贞化忌，更见恶煞，古人称之
为[恶奴欺主 J。亦主为下属偷敝侵吞。必得廉贞化禄，且左辅右弼、文昌文曲、天
魁天钺并照，更喜见兄弟宫天府化科，廉贞七杀始化为祥和之气，主友人及下属刚
毅。一一唯廉贞化忌，而不逢煞刑者，亦主易结交军警界与医生。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉府，若天府化科，则友情厚重，下属诚恳忠直；廉贞化禄，则主因反人或下
属助力而得兴家。见吉曜者、更主有友人或下属拥护，亦主自身上司事业鼎盛，自
身因而获吉；见化忌、刑煞，则恩反成仇，或提拔下属，而下属反而背义。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉破，廉贞破军于交友宫中同度，若会煞曜，则易招下属反叛背弃，或主受友
人陷害，或友人反目成仇。见天刑、大耗、空劫，更主因之牵涉官非。唯可借长辈或自己上司的助力化解。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府坐交友宫，主交游广阔，但慎于择交。唯此性质与天同之交游广阔不同，
天同交友，不拘出身地位。亦与廉贞之交游广阔不矧，廉贞易交损友。 
天府守交友宫，主下属众多但天同之下属众多，同时必有感情成份；廉贞之下
属众多，则兼主自身常易跟下属打成一片，且多私人生活交往，而天府守交友宫，
主得下属尊重，视自身为长辈父辈。 
若天府化科，会化权、化科，或得吉星祥曜全照，则友人与下属皆对自己忠诚。
四煞同度或会照，则友人或下属聚散无定。或爱友人、下属欺凌。 
倘天府所会之天相落陷无力，更见空劫刑忌耗煞者，主受友人或下属阴谋陷害，
或吞夺、盗窃财物。 
天府独坐，与地空、地劫同宫，无其他恶隧会蝌，则主有友人或下属无情无义，
诚厚待人，反凶终隙末。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴入庙守交友宫，主生平多益友，亦易得何助力之下属。 
但不宜见天机会照，虽主交游广阔，下属众多，唯易时时改变，难得深交朋友，
亦无永久得力助手。 
 太阳同度，则为人好广事交结，挥霍豪爽，唯亦主感情忽厚忽薄。 
 太阴落陷守交友宫，则易交损友，或易误信手下小人。见恶曜煞星会合，尤主受
阴谋陷害、侵吞。 
 见空劫、大耗主为友人破财，或手下人犯错误而自身遭受损失。 
 见擎羊、陀罗，则易为自身引为知己者所害，或对下属施以恩惠，反受怨报。 
 见火星、铃星。主为人谋而劳碌。 
 见天刑同度，主受友人或下属威胁。 
 见阴煞、天巫，主受友人或下属阴损、侵吞财务、或下属对自己的上司进谗。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守交友宫、入庙，见左辅右弼、天魁天钺、天福、恩光、天巫会照者，主
为人交游广阔，人际荚系活跃，深受友人欢迎，口碑宣传社交圈内。但实际动力则
不足。 
若更见化禄、化杖、化科会照，则为社交界中锋头人物，受人尊敬。 
在上述星曜组合情形下，却主下属少实干之士，而自身亦常易忽视实干派的属
员。应加注意改善，否则对自身事业有妨碍。 
一般情形下，贪狼守交友宫，必以嗜好结交，或书画琴棋、或医卜星相、或酒色财气、或风花雪月、或宗教信仰，视所会照星曜性质而定。最喜见天刑同度，则
主为人虽多嗜好，但却能自律。亦喜见华盖同度，主喜研究哲理宗教。不宜见咸池、
大耗、红鸾、天喜、天姚、陀罗、劫煞、天月，见则多酒肉朋友。更见煞曜，主因
滥交生灾，或误听下属谗言而惹是生非，甚至因之破败，或遭暗算阴谋。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守交友宫，最喜化禄、化权、化科、禄存、昌曲、魁钺、辅弼会照，主得
交能言善辩、多智多谋之友，且得友人助力；下属亦有忠谏之士，能助自身兴家创
业。 
尤喜太阳同度，主得仗义之友。古人则认为[主招义仆报恩]。 
唯虽值上述星系结构，仍主与友人或下属有口舌争吵，不过与善人交，不致反
目。  
若巨门化忌，则多是非口舌纷扰，且无友人及下属助力。更见四煞，则主友人
或下属背信弃义。见阴煞、天月，则主阴谋陷害，或甜言蜜语施以诈骗。再见空劫、
大耗，则破财耗损，或遭侵吞财物，或损害自己应得之利益。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门天机"):
                tmp = """唯天机巨门同度，则友人或下属多浮滑之士，难寄以心腹。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天同"):
                tmp = """天同与巨门同度，多是非口舌，友人及下属心口不一。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守交友宫，一般情形下可视为最佳之星曜，因天橱具有正义感，且主热心为
人，所以主得交能助己兴家、为己效劳的真正朋友，同时亦主得下属支持，且忠诚
可靠。 
 若见左辅右弼，亦主自身交游广阔，或下属众多。 
 若见化禄、化权、化科、禄存会照，因友人及下属可对自己有极大帮助。更见紫
微会照，则主得畏友，及忠谏干练下属。见天府带吉曜会照，友人或下属诚朴，有
助力，于自身出现困难时可加援手。 
不宜与武曲同度或会照，主得无信无义之友，亦主为下属背弃。 
与廉贞会照或同度，见煞曜刑忌者，反易交损友，或受亲信下属拖累、损害。 
武曲破军同时拱照，则施恩反易遭怨。 
空劫、大耗会照，则交游虽广，但无知己；下属虽多，但无得力。更见煞刑诸
曜，则主自身代人受过。 
若煞、刑、忌、耗诸恶曜多来会照，则友人或下属皆多居心不良之辈；或因友
人、下属而致自身损耗甚大。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守交友宫，一般情况下主友人不多，下属不众。唯与天机同度，然后始主
友人或下属众多，但仍时时哑换下属、换友人。 
若得会左辅右弼、天魁天钺，或化禄、化权、化科会照或同度，始主下属拥护，
且忠诚有助力，并得交耿商有助之友。更得天同同度，交游广阔，益友多，有助力之手下亦多。 
若吉星祥曜并会，而太阳同度者，则主得交贵恩之友。且主受友人提拔。下属
则多才干之士。 
擎羊、陀罗、火星、铃星同度或会照，主因交游生灾。故若太阳同度，无吉、
见煞，不宜因友人而卷入政治圈内。亦不宜参加其竞争势力。 
地空、地劫同度，则主友人及下属无助力。更见大耗、劫煞、阴煞、天月，防
遭受阴谋暗算，或因手下人锘浮而招致自身损失。 
若天梁与擎羊、天刑、大耗同度，则主与友人或下属发生词讼。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀入交友宫，所结交者每少敦厚之士，下属亦多竞争是非。故凡值此星曜者，
宜勿听闲言挑拨，凡事皆应慎重查察。兼听则明，偏听则暗。 
若遇左辅右弼、天魁天钺、文昌文曲，不过主结交广泛，虽争斗是非之性质得
以改善，但仍主不宜。若禄存与七杀同度，则更主受人排挤倾轧。 
武曲化忌同度或会照，见煞曜虽轻，亦防因友人拖累，或下属倾陷而致破产。
或因手下人误事而致事业失败。或如古人所言[强奴压主]。 
 七杀守交友宫，若无吉曜化解，即不遇煞，亦主有人妒忌、陷害，或遭下属背弃，
或为下属偷盗、侵吞。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀紫薇"):
                tmp = """唯紫微同度。始可化解其不良性质，反主有助力。唯如无众吉拱照，又见煞忌刑
耗，则终生受剥削侵夺拖累。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守交友宫，一般情况下亦主因友人而招破耗，或因下属之背弃而致事业受
损、财帛破散。 
若更见煞曜照会，则招怨背弃更甚，以致生灾涡。与擎羊、陀罗、火星、铃星、
劫煞、阴煞、天刑、大耗会照，则主因友人而惹官非横祸。或受下属阴谋损害，或
侵吞盗夺。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """紫微同度最佳，主得益反，及耿直忠谏的下属吉星祥曜化解，则友人与下属仍
不利，唯拖累较轻。 """
                print(tmp)
                print("\n")
            elif(star == "破军武曲"):
                tmp = """武曲同度，主友人及下属口是心非。  """
                print(tmp)
                print("\n")
    print("-----------------------------------------")
    tmp = """(附) 辅佐煞曜对交友宫的影响 
文昌、文曲 
一般主友人及下属众多。但文昌或文曲化忌，则主下属办事欠才干，友人少助
力，不宜倚之以创立事业。 
文昌化忌见煞，主因友人或下属而致文书失误。文曲化忌见煞，则主因受友人
的影响，而致投资失误。 
左辅、右弼 
一般主友人下属众多，且得力。唯必须遇吉曜会合者始是。若与天虚、阴煞、天月会合，则虽多无益。宜远离小人。 
 天魁、天钺 
一般主友人助力，又为下属众多之兆。但见煞、忌、刑、耗及空劫同会，反主
友人及下属寡情。 
 化禄、化权、化科 
一般主得交社会地位高尚人士；又主手下人众多得力，能助己兴家创业。若更
加会吉霍祥曜，则彼此提携之力更大。 
若见煞星恶曜，则虽交权势，亦防因之招损。或于下人反易凌驾于自己之上。 
 禄存、天马 
主出外可以得人助力生财。 
若仅得禄存同度，且正曜不占，反主受人倾轧。更见煞曜尤凶。 
 擎羊、陀罗 
 一般主受拖累。 
 见刑忌，则有官司连累之厄。 
 再见空劫、大耗，主受累破产。 
火星、铃星 
 一般主受人所误。 
 更见阴煞、劫煞、地空、地劫，主受人暗算而招损失。或主遭人偷盗、侵吞。"""
    print(tmp)
    print("\n")
def GongChu9th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫徽守事业宫，入庙者，若不见煞曜刑忌会合，而与天府、天相、左辅、右弼、
天魁、天钺、三台、八座、恩光、天贵同度或会照，则可从事政治，当官高禄厚。
即使从商亦由商入政。 
 若再与化禄、禄存、天马会合，则可予掌财权，或善雷理财，宜为财经领袖、金
融银子，或为财赋之官。 
 现代社会，未必人人皆有兴趣从事政治，若会吉曜、凭煞，如上述者，亦可从事
实业或贸易，贝皤必为社会闻人、商界领袖。会禄马者圆宜从事金融，唯亦可经萤
外贸，可碍巨发。 
 凡紫微守事业宫，即使无吉星祥曜会照，有煞曜会合或同度，亦主其人有领导才
能，擅长组织、策划。唯与破军会照，无论从政从工从商，则一生事业有成，多风
波挫折。但破军化禄，则多才多能，可经营多种事业，或身兼数种行业，或亦政亦
商，需经波折，而绔底有成。 
 若武曲在庙旺之地，与擎革、天刑会暇守事业真的紫微，则其人宜从军警立业，
唯亦可经营军火、防盗器材、保安行业。 
凡紫微在事业宫化科，则最宜在政界发展，否则亦必需参与公用事业、公共服
务行业为宜。 
紫微守事业宫不忌四煞，唯若与地空、地劫、大耗间度或会照，则多于发展中
横生枝节，唯宜于幻想成就事业，不过仅宜从事工业，不宜从政从商。工业家将幻
想付诸实行，变成新的产品，最为理想。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇破军"):
                tmp = """紫破，唯宜从事工业、商业，不宜从政。一生事业成中有败，事无全美。破军
化禄，虽事业能成，唯仍未如理想。若禄存同度，则主招人妒忌，引起竞争。若紫
微化科，则主名大于利。倘有昌曲文曜同会，不如从事文化艺术工作，反得其宜。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天府"):
                tmp = """紫府，紫微天府同在事业宫，必须见辅佐诸曜及吉化，得[百官朝拱]然后可成
伟大事业。若无吉曜朝拱，则仅为一般主管人才。若有禄存、化禄同度或会照，则
宜主管财经机构。若有禄马交驰于对宫，女命则宜匡助丈夫发展商务。男命主得妻
财，或经营岳家事业。若不然，则宜外贸。  """
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫贪，见化禄、化权、化科、魁钺、辅弼、昌曲，及百官朝拱者，必为政界红
人，擅长交际，艺术，若有煞曜同时会合，则宜从商从工，亦必长袖善舞、八面玲
珑。唯与空勘、大耗同度，则必须从事工业，若投机则必失败，唯事业发展仍生波
折。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫相，见吉曜及[百官朝拱]，亦宜进身政界。唯若见空劫，则宜从事工业，见
煞曜，则为工程人员，主有专门技能。若从事政治则必有颠覆，更不宜投机。紫杀，二曜同居事业宫，若见煞曜，或廉贞化忌者，宜从事军警武职为宜。或
可从事工业，或以特殊技艺起家，见龙池风阁者更确。不宜从政从商，恐有风波。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机入守事业宫，一生从事多种行业，不以专守一业发福。 
 若与左辅右弼、天魁天钺、三台入座等吉曜会照，更主事业有多方面的发展，或
主身兼数职。见昌曲、化科会照，宜从事文化事业，或从事与公众有关的事业，利
于成名。
唯与化禄、化杈、化科会照，更见辅弼、昌曲、魁钺，若天机居于入庙宫位，
则宜从事政治。但若天机落陷，或同时见煞曜者，则只宜在大企业、公用服务待业
工作。 
天机化碌、化科居事业宫见天巫、天梁、巨门者，可由星相起家。再见华盖，
可从事宗教。 
四煞会照者，增加天机的动荡性，主人常常转换一作或职业。或从事流动性行
业，或工作岗位时时调动。 
天机在事业宫与地空、地劫、大耗同会，宜从工业。投机必然倾家破产。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """机阴，在事业宫，增加了天机的流动性，使人事业多变动。若[机月同梁]同会，
则宜从事公职，或在大机构、大企业服务。倘见吉星祥曜同会，又见化禄、禄存者，
则可组织财团，经营多项业务。见昌曲、龙池凤阁，则宜文化事业。唯[机月同梁]
而见化禄、化权、化科齐备而无煞曜者，则以从事军警治安工作为宜，同时见煞，
则亦宜工业。  """
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """机巨，凡天机巨门人事业宫，虽有吉星祥曜，或有天才、龙池、凤阁等星曜，
仍主人虽有专门技能，而仍不守一业，或文或武，变动多端。但虽多幻想，倘能加
以后天努力，则仍能由幻想变成事实。若煞忌并见，则流荡江湖。再见地劫、地空、
天刑、大耗，则多官非口舌破耗。  """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """机梁，凡天机天梁同守事业宫者，主人常身兼数职，但多变动。无论是否[机月
同梁]格，均不宜自行经商，以任职于大机构，或从事社会工作、公众服务为宜，亦
可从事医药行业工作。见煞忌刑耗，则易因事业而涉及官司争讼，可考虑从事法律、
司法工作。煞曜太重，命宫不吉，则为江湖落拓文人。"""
                print(tmp)
                print("\n")
           
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳在事业宫人庙，以在午宫者事业最为广大。但必需见左辅右弼、天魁天钺，
或得文昌文曲，而不逢煞曜空沏者始为上格。若吉曜不见，而见空劫刑耗，则事业
虽大，仍主空虚，易见崩败。
 太阳入庙，见众吉拱照，不见煞星恶曜，可以从政，亦可以从商，均主事业鼎盛。
或主其人地位崇高，或主其人桃李满天下。
 太阳入庙，见吉星拱照，更见化禄、化权、化科会合，并有文昌同度，为最佳结
构，主人无论从政从商，均为领袖人才，能富能贵。居午宫，无煞，有[百官朝拱]，则为国家栋梁，政界要员。有煞，则成中有败。太阳最喜与巨门会照，见吉曜为外
交人才、司法人才。 
若太阳落陷，虽会三化吉曜，或[百官朝拱]，事业则始终空虚，更见太阳化忌，
则事业一有进展，是非尤怨随来。不宜从政，以从事司法、法津为宜。亦宜担任教
职，见昌曲，可从事传播界工作。见龙池凤阁，则宜从事科学研究。若见空劫，更
宜于空中楼阁起家，为发明人才。 
 太阳落陷，煞曜又重，则奔波劳碌而少成变。 
  """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """日月，若见占星祥曜拱照会合，则其人能富能贵，可从事政治、商业。见煞噬暂
则事业、职业多变。宜为僚幕人才，或从事公关、传播、社会服务工作。"""
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """日巨，二曜同宫，以居于寅宫者为宜，无煞星者大富大贵，为外交要员；有煞
忌，宜从事法律、司法、教育。见碌马亦可从事外贸，主受外国人推崇。见禄马而
同时见煞，则宜从事商业推销。若昌曲文曜会合，则为传播、文化工作人才。最喜
无煞曜而化禄、化权、化科并见，则为国家高级政要。若同时见煞，从商亦为一行
一业之领袖，或为社会知名人士。居申宫者较次。 """
                print(tmp)
                print("\n")
            elif(star == "天梁太阳"):
                tmp = """日梁，太阳天梁同居事业宫，见诸吉，亦仅宜从事监察、审核工作。若有煞曜，
则宜以技艺起家，或从事科学研究。见擎羊、天刑，可为医疗、医药人才。唯见太
阳、天梁、禄存或化禄、文昌或文曲同会者，则宜参加资格典试，成为专业人才。
若仅见文曜，或天梁化权、化科，则以从事社会公众事务为宜。但无论如何，均不
宜独资经商。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲入事业宫，古人认为宜从事[武职荣身]，其实于现代化社会，以武曲为财
帛宫主星之故，亦可从事财政金融行业，经商亦利，则以带金属性质者为宜。 
武曲入庙，更见化禄、化权、化科同会，或见禄存天马者，从政可为财经要员，在
商亦事业发展。更见文昌文曲、龙池凤阁，则可成为经济分析人才。 
 唯武曲与破军会照，又见天刑，则，芝、须由军警治安单位出身，然后始免波折
是非。更见七杀会照，有左辅右弼、天魁天钺、文昌文曲同会，必为武职文做，或
文职武做之要员。古人认为此乃[领百万雄师镇守边疆]的格局。 

 若武曲化忌，则经商必主一生多遇周转困难，故宜受雇为宜，唯在事业发展过程
中，仍多波折，或进退失据。 
若见四煞、空劫、刑耗，则主人一生多挫折，有是非困扰，多谋少成，多劳少
获。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲贪狼"):
                tmp = """武贪，武曲贪狼同度，见吉则宜从商，以经营消费性行业、装饰性行业为宜。
若会命寓廉贞化忌，则一生事业财帛仍有挫折的机会。不宜投机；有谋取暴利的本
性，亦宜审度形势，否则主破败。与贪狼同度，以从商为宜。若从政则多贪婪，不如经商，虽性近谋取暴利，亦
不陷于凶险。火星铃星同度者，格局不如[火贪][铃贪]之纯，经商则主横发，但亦
有横破的遭遇。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天府"):
                tmp = """武府，子宫较午宫为佳，可从事财经、会计工作，为理财专业人才。若吉星会
照，又见三化吉曜，则为财经领袖，掌一方财杈。见禄马亦宜经商。见煞曜会照，则可为设计、科技、艺术专门人才。有昌曲及龙池凤阁同度或会照者更主秀发。  """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武相，二曜同度，主人文职武做、威武职文做。盼从事政治，或从事军警保安
工作为宜。若经商，则有理财不善之弊，于事业发展时进退失据。但若有众吉会合，
刚可从事金融行业。 """
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武杀，二曜同守事业富，若见天魁开钺、左辅右弼、三台八座、台辅封诰诸曜，
宜军警治安人员出身，可横立功名。若见煞曜，则宜从事带金属性质的工业，见天
府同度或会照，则可从事饮食、食晶行业。 """
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武破，古人认为此星系亦宜武职，在今目，则亦宜经营工厂，但所费入力必多。
见天府会照，亦可经营饮食、食品业。但无论从武从商，一生必多风险挫折，故宜
脚踏实地。煞忌刑曜重者，更不宜昌险扩展或投机。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同守事业宫，主其人白手兴家。
 一般情形下，天同守事业，--宜从事美观及享受性行业。如旅游业、首饰业、装
修业，及化装、美容、烹饪之类。
与化禄、化权、化科会照，或禄马交驰者，则事业由小至大，逐渐亨通，以致
成为行业中领袖人才。 
 天同落陷，不宜从商，只宜受雇，或任公职，或在大企业任职。
 若与陀罗、天马会照，则一生事业多生变化，一或主职业多生变动。
 若与擎羊、天刑会照，则多因事业引起的纠纷。或遭人恶性竞争。 
 若与火、铃同度，则主人事业多逆境，以受雇为宜，不宜自行经营。
若会地空、地劫，则主由才艺白手兴家。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """同月，天同太阴同居事业宫，只宜在已成的局面下发展。故最宣得人提拔，继
承其工作事业。亦可考虑承顶别人的生意经营。唯必须会照禄马始可经商，若与昌
曲文曜会合，则宜从事文艺。无昌曲亦可从事公职。 """
                print(tmp)
                print("\n")
            elif(star == "天同巨门"):
                tmp = """同巨，天同巨门守事业宫，纵见吉曜，亦必经艰苦奋斗然后成功。若无吉曜，
三方四正见煞，则主人做事欠毅力，不能坚忍，以致事业中道而废。 """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """同梁，天同天梁同守事业宫，无论从商、从政，均主宜为幕僚策划人才，见吉
星祥曜，可担任机要秘书之职，或为财务监管人员二若见煞曜，则宜在医院、社会
服务行业工作。若见天马及桃花诸曜，则宜从事流动性的行业，如航空、海员等业。
但见吉曜，又见擎羊、天刑同会，则可担任医疗卫生工作，或海关关员、邮局职员。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守事业宫，入庙，一般均宜武职，化忌者尤宜。若从事其他行业，则挫折
变化甚大。有昌曲、魁钺、辅弼拱照或同度，紫微会照，则由文职而掌武权。若见武曲与文昌文曲同会，均宜从政从军，或纪律部队，主人文事武做，或武
事文做。为文武兼资人才。 
若从商，则宜详所会照星曜而定行业。如会照贪狼，可从事设计、公关、广告。
会照七杀，见天厨，可从事饮食、食品行业；会照天府，可从事金融；会照天相，
则为商业策划人才或经济计划人才。昌曲同度，则从事艺术为宜。
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天相"):
                tmp = """廉相，见吉星祥曜者，宜从事军警、海关工作。从政也必文事武做。见煞刑忌
耗诸恶曜会合，则有撤职或失业，倒闭的危险。见煞曜轻，从商从工者，可凭技术
起家。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉破，廉贞破军同守事业宫，是比较差的结构，若从商从工，均主人一生至少
有一次失败与挫折，所以应详大限流年，踏实应付。若从政，则为文员之职，见吉
星祥曜，亦可积资历而升迁。见煞则久处僚下。若从商，亦以血肉、饮食行业为宜，
或从事带凶险性质的行业。从事军警、保安、海关工作亦可。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉府，见吉星祥曜会合者，事业成局面。由于天府保守谨慎的性格影响，不宜
从事武职，可从事金融、财经行业。若见煞曜，则事业多变迁波折。见化忌，则经
营不顺，不宜投机。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉杀，廉贞七杀居事业宫，最宜纪律部队出身，如军警、海关、治安单位等。
若见文昌、文曲，或龙池凤阁，亦宜为技艺人才。倘更见天月，有文科二曜拱照或
同度，则为外科医师、跌打医生。若有天厨同度，则可从事饮食。若廉贞化忌，虽
以军警为宜，但亦可从事与血液有关的工作。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贪，最宜从事交际应酬、或消费性行业，亦宜娱乐、艺术事业。见昌曲、天
才同会，则以文艺工作为宜：若见咸池、天姚、红鸾、天喜，则宜从事演艺。见天
马则为旅游业人才。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守事业宫，得吉星祥曜拱照者，入庙主事业发展有成就。若居陷地，会昌
曲，古人认为不过是[刀笔吏]，即主理文书的政府文员。 
若天府在事业宫，见禄存、天马，可以经商致富，但不宜创新，仅宜在已有的
局面下渐进。 
天府化科，则宜在财政金融机构任职，或自行经营，至少亦独当一面。但不宜
投机。 
见煞，宜从事工业。空劫同度，则反主其人于工业发展中表现出惊人的毅力与
魄力。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "丑"):
            tmp = """天府在丑宫，禄存在酉宫来会，无煞，见吉曜，亦主大贵。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天府武曲" and dizhi == "午"):
                tmp = """武曲天府在午宫，紫微天相在戌宫相会，于寅宫得禄存。无煞忌，见吉星
祥曜扶拱，主大贵，宜政界出身。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守事业宫，性质变化多端，须详所会星曜而定。 
【机月同梁】格者，不宜经商，以从事政府职务，或大企业机构职务为宜。最
宜任职于公用事业。纵会化禄、禄存、天马，可以经商，亦必组织有限公司为佳，
不宜独资经营。
 [机月同梁]格见三吉化并照，无煞，则宜职掌军权，更见辅佐诸曜会照，则为
军政两界要人。 
得文昌文曲会照，宜从事文化工作，或传播界工作。 
左辅右弼会照，以从政为宜，更见禄存，乃财经人员。从商亦宜从事财经行业。
 若太阴与天梁相会，见大耗、一天巫、劫杀，宜为赋税官吏。 
有两个格局应该从事工业――  
太阴与文昌文曲、龙池凤阁、天才同度或会照，主为人有艺术天才。可在艺术
行业发展。更见红鸾、天喜、咸池、天姚，可从事娱乐行业，或在演艺界成名。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阴天机" ):
                tmp = """天机同度，得化禄、化权、化科会照。一为与地空、地劫同度。唯前者发
展顺利，后者则多变动。但却宜从事科技发明，或凭专门技艺兴家。太阴与天同或天机同度，均宜从事无根本基础行业，否则事业多变。 """
                print(tmp)
                print("\n")
            elif(star == "太阴天同" ):
                tmp = """太阴与天同或天机同度，均宜从事无根本基础行业，否则事业多变。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守事业宫，宜外务工作。如营业、推销、公关等工作。必须以应酬交际为
工作重点者为宜。 
亦可从事娱乐、演艺工作。尤以见文科诸曜，或桃花诸曜者为宜。 
但若于三方四正得化禄、化权、化科会照，无煞忌刑耗诸曜，而辅佐诸曜，更
得天官、天福；恩光、天贵；三台、八座；台辅、封诰；天巫会照者，则可为政治
圈中红人，为不同政治集团人物倚重，交际折冲，八面玲珑。 
若有武曲同度或会照，更见火、铃同会，则宜从事武职荣身。 
紫微同会，有辅曜，亦可从政。但如同时会煞，则仍以从商为宜。若地空、地
劫同度，则应从事工业。唯地劫、大耗同度，则仍有风波挫折。 
 若贪狼与火星或铃星同度，更不见其余煞曜及刑忌劫耗者，可从事投机；或主一
生必有特殊幸运遭遇。 
 若贪狼化忌，则事业发展不如理想，倘见吉曜，则主理想虽然失败，但却可获意
外成就，犹之[无心插柳]。 
但若化忌而更见煞曜群集，则横发横破，暴起暴跌，必注意持盈保泰，始可避
免。[火贪]、[铃贪]二格，可得意外成就，虽不化忌，或不见其余煞曜，但亦应克
己自勉。 
若见煞忌，更见刑耗空劫，则易生突变而倾败。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守事业宫，入庙，主人白手创业，尤宜以专门技能或专门知识兴家。如就
业医师、法律、演艺、外交、公关、传播界等行业。会天机，则为电脑、会计人才；会文昌文曲，可从事艺术、或星相。 
巨门见化禄、化权、化科，及得辅佐诸曜会照，则必能以口才或专门知识成名。
同时见煞曜、天刑者，则为帮会领袖；若见华盖，则为宗教宣传人才。无煞忌刑曜，
则为军政要员、商界闻人。    
 巨门守事业宫，煞忌重者，见天马，为江湖流浪之客，更见文曜，亦为落拓文人。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门太阳" ):
                tmp = """太阳同度，主名大于利。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天机" ):
                tmp = """天机同度，则事业变动，不守一职一业。为人重物欲，多空想。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天同" ):
                tmp = """天同同度，则凡事有头无尾。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守事业宫，喜会照化禄、化权、化科、禄存，及辅、佐诸曜，必为政界要
人、工商业巨子。 
天相会照紫微，宜政界立身。 
天相会照诸吉，而无煞曜会照者，立身政界亦利，但不宜谋取机构之最高位置，
否则立成众矢之的，于年限运程不佳时倒台。所以天相是[二帮花旦]命。 
若有武曲破军拱照，则主人事业起跌无常，从政有所不宜，可由技艺发展。见
龙池、凤阁、天才者更利。 
四煞会照，主事业多纷扰，即使顺境也间中遭逢横逆。更见刑忌耗曜，从政者
有撤职之虞，在商者则有破败，或至停业倒闭。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天相武曲"  or star == "天相廉贞"):
                tmp = """武曲或廉贞同度，从事军警、海关为宜。从事工业亦可。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁守事业宫，以独坐午宫者格局最大，不见煞忌，得天魁天钺、文昌文曲、
左辅右弼、化禄、化权、化科、禄存拱照或同度，从商从政皆为领袖人物。 
 天梁会禄马，大利经商，主得异邦人士信任。 
 与太阳同度，必以才艺扬名，见禄马，则名传外国。见煞，宜服务社会。 
天梁守事业宫，一般宜从事监察职位，亦可从事电脑、核数、设计等业。与天
同会照，则为僚幕人才，从事计划工作。 
天梁守事业宫而见煞刑诸曜，可从事医疗工作，若煞曜多见，又见地空地劫、
天刑大耗，则宜从事危险工作。否则易生灾祸，或惹官非而致破耗。 
"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "寅"):
            tmp = """天梁在巳寅者，多从事特殊行业。"""
            print(tmp)
            print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守事业寓，现代社会宜从事工业，且宜以人力资源为主者。唯绝不宜投机。
因为七杀在事业宫，一生人必有一次重大挫折，若投机则难东山再起。 
武曲七杀同度，或廉贞七杀同度，会左辅右弼、天魁、天钺、三台八窿、天巫
天福者，权威出众，武职固可荣身，若从事工业，亦主声名为外国所知。 
七杀不畏四煞。与四煞同度或会照，则主人于艰苦中立业，但一生仍多是非风
波。七杀与地空、地劫同度，必须从事工艺，以技术立身，否则立见破败。 
凡七杀守事业宫，无论见吉见煞，皆不宜从事文教。因其人善于管理下属，只
宜为军警或工厂领导。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军入庙守事业宫，适宜管理或经营工厂，或宜从事武职。 
若禄、权、科会，则为武职之权威人士。古人称之为[威镇华夷]。 
破军守事业宫，不宜经商，否则必多波折，纵有吉星祥曜会合，亦时败时成，
忽起忽跌。唯破军化禄，或与禄存同度，则主其人刚毅卓拔，屡败屡起，有吉曜会
照者，终抵于成。若无吉曜，则压力甚重，更会空劫，一生中必有一次倒闭或破产。
若从事工业，则能藉新产品换回危机。 
破军守事业宫，绝不可从事投机，否则必见倾败。 
破军亦宜从事交通运输业，见禄马者尤佳。"""
        print(tmp)
        print("\n")
def GongChu10th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微入田宅宫一般主有产业承继，及有自己增置的产业。尤喜见禄存或化禄会
照，必主增购物业。(所以当大限或流年的田宅宫见紫微坐守，有流禄或流化禄同度
或会照时，便应可做初步推断，其人在该大限或流年内有置业的可能。可参考其财
帛运程来决定。以此为例，以下即不一一指出。) 
紫微在田宅宫见化权或化科，而不见禄，不主置业，仅主产业的承继。 
 (所以当流年田宅宫见紫微与[流化权]或[流化科]相会时，便应同时观察父母宫
的吉凶，以推定是年是否主父母弃世。以此为例，以下亦不一一指出。) 
紫微守田宅宫者，古人认为宜置山地，因为紫微为帝星，有高高在上的性质，
在香港应该改为宜置大厦的高层，或在高地(如半山区)的楼宇。 
紫微会桃花，加咸池、天姚、沐浴、红鸾、天喜者，主住宅阴盛阳衰。即家中
女口多，男口少。或主其人的住宅处于繁华的区域。若有贪狼同度或会照，则住宅
临近可能：为风化区，或为娱乐饮食场所集中之地。否则四邻多女性。 
紫微与禄或化禄会照，见天马者宜在外国置业。与天府会合者，则宜在出生地或久居地置业。 
  

 
紫微与火星同度，再会擎羊、陀罗、地空、地劫、大耗者，主有火灾。 
 (所以流年田宅宫见紫微与火星同度，再会流羊或流陀者，便应小心住宅或办公
室，或自己的物业有火险。举此为例，以下不再一一指出。) 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫微天府同度，不见煞耗，有祖业，亦有自置。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀" or star == "紫薇破军"):
                tmp = """紫微七杀同度，或紫微破军同度，一般主不守祖业，会煞耗者尤确。能否自置，
须视运限流年的田宅宫而定，唯亦主置后有变卖，除非有辅佐吉曜同会。 
 (置业后有变卖不一定不好，可能是旧屋换新屋，于推断时应加注意。) """
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫微贪狼同度或会照，见文昌文曲、龙池凤阁、红鸾天喜，又见吉曜，则主住
宅华美。若见凶曜，不外主阴盛阳衰。  """
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """紫微天相同度主有现代产业，及主中年始能安定置产。唯仍必须有辅佐吉曜同
会者始能保存，否则易破耗。见地空、地劫、大耗则必主破败。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """紫微与破军同度，见擎羊、陀罗，化忌者，主因产业而生纠纷。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机守田宅宫，主不能守持祖业，但能自置，化忌者尤确。 
 (将退去祖业，自置物业的性质稍加变换，即等予退去旧业，自置新业，故流年
田宅宫见天机化忌者，应留意其人有搬迁住宅或办公室的可能。) 
天机化忌于田宅宫，自最物业也不持久。无化忌，则主时时变换、搬迁。 
天机落陷守田宅宫者、住宅不宁静，四邻多闹离之一声。再化忌，家宅不宁，
终日嘈吵。 
 (见家宅嘈吵，即应检视夫妻宫，看是否夫妻不和。) 
天机在田宅宫，与四煞、空劫、大耗同度或会照，主物业有纠纷。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机太阴"):
                tmp = """天机太阴守田宅宫，星曜组合的性质亦嫌不稳定，故亦主物业时有增减，或时
买时卖。见辅佐吉曜则虽变动仍有自己的物业，见煞耗空劫则无。 """
                print(tmp)
                print("\n")
            elif(star == "天机巨门"):
                tmp = """天机巨门同度，见煞曜、天刑、空劫、大耗，主有物业纠纷。居卯宫者有父母
产业，居酉宫则无。  """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """天机天梁同度，必晚年始能增加物业。晚运以前，不宜置物业收租。但若禄存
天马与天梁同度，与天机对照，则宜于外国置业，可获巨利。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳为浮动的星曜，不宜守田宅宫，主产业时进时退，且亦主祖业难守。 
 太阳入庙，有辅佐吉曜同度或会照，或得[百官朝拱]，则产业丰厚，但仍主时时
变换。――利用这点性质，便知其人是否宜于经营地产物业。 
 太阳落陷，虽见吉曜，不宜经营地产，恐亏蚀。见煞耗者尤为不宜。
太阳化忌于田宅宫，一般防家中男口有损伤。若父母、兄弟子女诸宫(女命则再
兼视夫妻宫)皆无凶星恶曜会照，守宫垣的正曜亦吉，则可能是男性尊亲(如外公、
岳父或家翁之类)有疾恙。太阳太阴同度；或太阳巨门同度，若无煞曜、刑耗、空劫会照，更见辅佐诸吉
扶持，则主物业自置增多。但仍难免因置业而有是非纷争。 
见禄者尤佳。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳天梁"):
                tmp = """太阳天梁同度，主有公产纷争。如兄弟争父业、股东争公司物业、夫妻争同名
物业。 
 太阳天梁守田宅宫，亦宜入住公屋。 
 太阳天梁与擎羊、天刑、地空、地劫、大耗同度或会照，必因公产而与大讼。命
盘田宅宫见这种星系组合，一生不宜经营物业地产，甚至连地产股都不宜沾手。 
 若上述星曜组合同时见禄及化禄，则主人因巧取豪夺公产而生大讼。 """
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """太阳巨门守田宅则宜于外国置业。 """
                print(tmp)
                print("\n")
            elif(star == "太阳太阴"):
                tmp = """太阳太阴守田宅，宜于出生地或久居地置业； """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲宜守田宅宫，一般情况下，可视为物业增加之兆。 
武曲最喜与火星同度或会照，主增加产业。与铃星会照次之。 
最嫌武曲化忌，主因产业而生破耗；或因经营物业地产而发生周转困难。亦主
人一生多住旧宅。 
以家宅运而言，武曲化忌再见羊陀，主物业变换，而旧宅胜于新宅；若见空劫、
大耗，更与破军会照，则有家产破耗之厄。 
 
但若逢邻宫一见擎羊、一见化忌，则为[刑忌夹印]，主因物业而兴讼倾家。流
年见者，主家宅有讼事或凶事，或破财。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲天府"):
                tmp = """武曲天府同度，既有现成物业或祖业，亦能自置。武曲贪狼同度，主中年后产
业增加。见化忌，有物业官司，若会桃花，住宅华而不实。即虽外表美观，而暗藏
歉损。一一流年田宅宫见此星系者，置业宜小心。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武曲天相同度，中年以前不能保守物业，中年以后则可置业持久。 
武曲天相守田宅宫，邻宫巨门化禄，或天同化禄，则为[财荫夹印]。命盘田宅
宫见这种结构，必为地产业巨头。流年见者，主家宅兴旺进财。"""
                print(tmp)
                print("\n")
            elif(star == "武曲破军"):
                tmp = """武曲破军，主破荡，亦主迁居入住旧宅； """
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """武曲七杀，主先退祖业然后晚年自置。流
年田宅宫见武杀，则主迁较佳之新居。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同为白手兴家的星曜，守田宅宫，主必无祖业之份。天同化禄者，虽有祖业，
亦因种种原因破耗净尽。天同化忌者，无祖业。   
天同入田宅宫，见羊陀火铃、空劫大耗者，无产业。但若天同化禄，可为物业
经纪。 
流年田宅宫见天同独守，有三化吉曜及辅佐诸曜，家宅必有喜庆。若天同化忌，
主装修、添置家私等。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同巨门"):
                tmp = """天同巨门同度，不宜置业，防因此破耗，或生是非口舌。 """
                print(tmp)
                print("\n")
            elif(star == "天同太阴"):
                tmp = """天同太阴同度，以购置有园林、池沼的住宅为宜。古代有庄田，故古人认为遇天
同太阴于田宅，养鱼栽花、培植果木可以大富。现代人亦宜经营农场。天同太阴居田宅，亦主住宅宁静。"""
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """天同最不喜与天梁同度，或对拱。主一生飘荡，无自置物业。有亦不能耐守。  """
                print(tmp)
                print("\n")
                if(dizhi == "寅"):
                    tmp = """唯天同天梁于寅宫同度，见辅佐吉曜及禄存、化禄者，则有产业。唯仍时时变
换。"""
                    print(tmp)
                    print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞在田宅宫为恶曜，入守田宅宫，主祖业破荡，或无祖业。 
廉贞化忌入田宅宫，再见煞曜，一生必有因物业两致招灾祸的情形。应详备大
限流年田宅宫而定其发生年份。 
若流年田宅宫见廉贞化忌，须检视疾厄宫星曜，防有灾病。或家中人不安。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞七杀"):
                tmp = """廉贞七杀同度，有祖业者，必因客观原因破耗。然后于中年自置。见吉曜会合，
物业加增。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天府"):
                tmp = """廉贞天府
同度，始主有祖业且可守业。  """
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """廉贞贪狼同度，多主产业散耗。仅于火星、铃星同度的情形下始能置业。若与煞
曜、空劫、咸池、天姚、大耗会照，则主因酒色财气或不良嗜好，致产业破荡倾败。
若遇吉曜扶持而无煞，更见红鸾、天喜，则主人居住华宅。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞天相"):
                tmp = """廉贞天相，主搬业破荡。见三化、辅佐吉曜，则中晚年有自置物业。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉贞破军同度，亦庄祖业破荡。能否自置，须详中晚年大限囝宅宫而定。  """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守田宅宫，一般均主有父母物业，且能守成，亦能自置。为团宅宫吉曜。 
见文昌、文曲会照或同度，名为[文星入宅]，再见禄，主经营物业缛利，不见
禄，则主家中有饱学之士，可以光宗耀祖。 
天府会红鸾、天喜、龙池、凤阁，主人居华丽旧厦。 
天府会羊陀，主产业纷争。或主物蔓芝交易不成。 
天府见火铃，住宅不宁静。再见煞曜、空劫、大耗，主火烛虚惊。 
天府见地宅、地劫、大耗，主物业破耗。瀛年Ⅲ宅寓见者，防家人有。病破财。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守田宅宫，入庙者宜乡居。亦主住宅宁静，有花木之胜。
太阴入庙主有祖业；陷地则稀少，再见煞耗，或无祖业，或祖业有耗损。 
太阴与禄存、化禄同度或会照，主多置产业，尤以购置农场、池塘为宜。太阴会照地空、地劫、大耗，主产业破耗。会羊、陀、火、铃，则物业火灾迭
见。 
太阴见煞，又见天刑、大耗，再见文曲化忌，防住宅被窃。若见劫煞，阴煞同
度，防住宅被劫。 
 太阴见煞、耗，又与天月同度，宅中多疾病。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阴天同"):
                tmp = """太阴与天同同度，反无祖业，或虽有而耗散，然后白兴家自置。 """
                print(tmp)
                print("\n")
            elif(star == "太阴天机"):
                tmp = """太阴与天机同度，产业时时有变换，或主时多时少。流年田宅宫见二曜入守，
主搬迁或外游。  """
                print(tmp)
                print("\n")
            elif(star == "太阴太阳"):
                tmp = """太阴最喜与太阳同度，主产业丰厚。唯太阳化忌或太阴化忌，则主宅中多鳏寡。
见煞刑耗曜并会，则主家宅不安，或牵连词讼，或多病痛，或多是非口舌，或见父
母子女分离。 """
                print(tmp)
                print("\n")
           
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼在田宅宫为恶曜，一般主散耗，或主聚散无常。故一般无祖业，或主难守。
贪狼人庙，与火星或铃星同度会照，则能自蓬物业。唯住宅必有缺陷，或曾经
修补，倘再与地空、地劫、大耗、四煞会照或同度，则主火烛，或主兵灾、或主盗
劫。见火星同度者尤确；见铃星同度者较轻。 
若在上述情形下同时会照吉曜，则仅主虚惊，不波及自己的住宅。 
贪狼化忌，则因物业而多是非口舌。 
贪狼最喜与化禄、化权、化科、禄存会照，主人产业丰厚。 
若与红鸾、天喜、龙池、凤阁会照，则住宅装修美观。火星铃星同躔，则为旧
宅华厦。 
若流年田宅宫见上述情况，则主家宅有婚姻喜庆，或主添人口。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门守田宅宫，不宜有祖业，有则多争。见煞忌刑耗者，且因祖业而生争讼。 
巨门入庙，见禄、权、科及禄存同度或会照，则能自置产业。
天同与巨门同度或会照，易因水沟、河道、洼地而起纠纷争讼。 
巨门落陷，不宜置业，见大耗、空劫，主因置业而受损失。 
巨门化恩，主家中多是非。若与擎羊、陀罗、火星、铃星、天刑同会，则因物
业而与讼事。流年田宅宫见此星曜组合，主人口刑伤，或有灾祸。 
流年田宅宫巨门与火星、铃星、地空、地劫、大耗、天月、阴煞会照，则住宅
有火灾、偷盗、抢劫之祸。 
若命盘田宅宫见上述情形，则主其人一生多飘荡。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门太阳"):
                tmp = """太阳同度，
则有争扰，或因置业而生不快。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守田宅宫，见化禄、化权、化科、禄存会照者，主其人产业丰厚。
与空劫、大耗会照，则主产业破荡。 
武曲破军在对宫拱照者，则主其人祖业逐渐消磨，以致耗散破败。倘武曲更化
忌，则主人家宅不宁，多争端口舌是非，多灾多病，。 
天相不喜与陀罗及天马同度，主其人虽时时搬迁，唯一生无称心如意之住宅。
虽居华厦，亦有不满意之处。 
若与擎羊、陀罗、火星、铃星同会，则主家业凋零，或因产兴讼。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为荫星，所以居田宅宫者主得祖业。更见天巫同度，可得丰厚遗产。 
 天梁与天机同度或会照，皆主住宅多搬迁，或房屋改建。 
 天梁会照禄存、化禄，凡置业必生麻烦。 
天梁守田宅宫者，亦主一生多住旧宅。 
天梁与四煞会照同度，主人家宅不安，多是非，多灾病。化忌会照，则多闲是
闲非。 
 天梁与天马同度，亦主飘荡。唯再与禄存会照，则主离乡背井安身。"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥" or dizhi == "申"):
            tmp = """在巳亥申宫，均不宜与地空、地劫同度，否则主人一生飘流无固定居所。"""
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天梁太阳"):
                tmp = """太阳天梁同度，主因产兴讼。   """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀入庙守田宅宫，主有祖业。陷地则虽有亦如无。 
最喜得紫微拱照，则主一家得贵人荫庇。与廉贞同度，亦能增置产业。 
七杀落陷守田宅宫，主产业有破败。若与化忌同会，则主家宅不安。多灾病、
是非。 
 与火星、陀罗同度，主有虚惊。 
 与铃星、擎羊同度，家中多争吵。 
与地劫、地空同度，家业破败。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """
破军落陷，则主人所居住宅破旧。 
破军与羊、陀、火、铃、空、劫会照，主祖业凋零耗败。
流年田宅宫见破军，入庙见吉，主迁新宅；落陷，见煞，则主家宅有破败。"""
        print(tmp)
        print("\n")
        if(dizhi == "辰" or dizhi == "戌"):
            tmp = """破军在辰、戌二宫守田宅，为相当理想的组合，主人既有业，亦能自置，且产
业丰厚。 """
            print(tmp)
            print("\n")
        elif(dizhi == "子" or dizhi == "午"):
            tmp = """在子、午二宫守田宅，则仅主自置丰厚。 """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "破军紫薇"):
                tmp = """破军与紫微同度，虽产业运势不佳，但却主意外得产业。 """
                print(tmp)
                print("\n")
def GongChu11th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守福德宫，一般均主人的人品敦厚，但主观甚强。因为紫微既为帝星，自
然喜以自己的意见为意见。 
有辅佐诸曜同会，或得[百官朝拱]，则其人的主见虽强，但仍可听取别人的意
见加以考虑。若无诸吉会照，则成见极深。 
若无诸吉，却与地空、地劫同度，则主其人好哲理，更见华盖同度，其人必好
研究宗教。若与空劫同度再见煞曜，则可研究数理及工程科目。 
一般来说，紫微守福德宫主人思想高尚，或有领导欲，但喜支配及左右别人行
动。 
便若与陀罗同度，则主自生困扰，无事烦恼。 
若与四煞同会，更见空劫、刑耗，则精神多烦躁；再与化忌会照，则主多优多
虑。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫微天府同度，或紫微天相同度，皆主人精神愉快开朗。有煞者则生烦扰。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """紫微贪狼同度，会桃花诸曜，主人以嗜好为享受，或诗酒琴棋，或风月赌博，
不一而定。会昌曲则必好文艺。若与空劫同度，则在文艺上必多灵感。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """紫微七杀同度，会吉则好弄权柄，会凶煞则烦躁不安，或做事欠思虑。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """紫微破军同度或会照，主人好亲力亲为，而且时时改变主意。会吉尚可，若会
刑煞诸凶，则主人身心劳碌，朝令夕改。唯虽劳碌却易自觉满足。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机坐福德宫，一般主人思想敏锐。唯亦正因此亦令其人心绪不宁。
若天机化忌，则更主人行事畏首畏尾，遇事喜钻牛角尖，以致进退失据，多虑
多忧。 
若天机与擎羊、陀罗会照，则主人自寻烦恼，无事找事，以致终日奔波。 
若天机与火星、铃星、地空、地劫、天刑、大耗会照，则主人无精神享受，终
日奔忙心烦，身心不得安静。 
若天机与吉星祥曜照会或同度，则主人心劳而身不劳：而其心劳亦不致钻入牛
角尖内致生无谓困扰。但其人为了追求精神享受，或为了消磨时间，却喜学习多方
面的知识与技术，然而却不喜深入。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机巨门"):
                tmp = """天机巨门同度，主人浮滑、多疑、善辩、思想机敏而好是非纷扰。若会吉曜则心多思虑而身安，会煞忌则劳心劳力。"""
                print(tmp)
                print("\n")
            elif(star == "天机太阴"):
                tmp = """ 
天机太阴同度，主其人身心劳碌，表现出来是一个喜欢热闹的人物，可是其实
内心却喜清静。而且当与昌曲文曜相会，或见红鸾天喜之时，其人必喜文艺。 """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """天机与天梁同度，则虽见煞，仍主其人能忙里偷闲，寻求精神享受。但若天机
化忌，则倾向于悲观消极，或时有悲天悯人的思想。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳无时不在天空移动，因此当守福德宫时，主人奔忙不息。但身劳而心未必
劳。 
但若与辅佐吉曜会合，或得【百官朝拱】，则主在忙碌中成就事业。
若见四煞、空劫会照，则主人奔走不宁，而且往往白费气力。倘有吉曜同时会
照，则仍主有成就。 
太阳化忌，，则主其人易惹是非困扰，劳而无功，更见煞曜，主常代人受过，以
致心绪不宁。 
太阳守福德宫，入庙，主配偶热情，多婚姻生活乐趣。若见桃花诸曜，则须防
自身不能与配偶配合。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                tmp = """太阳与太阴同度，称为[阴阳调和]，主其人虽然劳碌奔忙，但仍能享受生活情
趣。有吉曜会合，则更能指挥若定，减少劳碌。"""
                print(tmp)
                print("\n")
            elif(star == "太阳巨门"):
                tmp = """ 
太阳与巨门同度，则除有太阳主身劳的特性之外，仍有巨门主心劳的特性，所
以主人事事奔忙，劳心费神。化忌更主少精神享受。  """
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """太阳天梁同度，则不但不主奔忙，而且反主其人有独特的生活方式。且主其人
作风有名士气派，表现得不在乎和疏懒。若太阳落陷，则可能因疏懒而致影响事业
发展。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲在福德宫中为善曜，主人能享福。 
但所谓享福，却可能意味其人缺乏远见，凡事见步行步，所以不伤脑筋。故必
须得与吉星会合，且武曲入庙，始主其人善于决断，然后始为真正的享福。若武曲
落陷，则可能导致须为物质生活伤神。
武曲化忌，则主时时为钱财担心，以致身心俱劳。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲破军"):
                tmp = """武曲与破军同度或会照，再见陀罗，则主人奔忙心烦。"""
                print(tmp)
                print("\n")
            elif(star == "武曲七杀"):
                tmp = """ 
若武曲与七杀同度或会照，再见天马，则主人碌碌无
成，或多劳少成。再见煞曜，益主心焦。有吉会照，则劳而后成。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天府"):
                tmp = """武曲天府同度，见吉曜则能享受，见煞忌凶曜，则主人迟疑不决，
因而反增加处事的困难，以致心神不宁。 """
                print(tmp)
                print("\n")
            elif(star == "武曲贪狼"):
                tmp = """武曲与贪狼同度或会照，则主其人喜风花雪月的享受。见咸池、天姚，更易流
为风月。若有火星或铃星同度，则其人多贪物欲，物质享受重于精神享受。 """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """武曲天相同度，有吉曜会照者，可得享受，若见煞，则仅晚年能享清福。少年中年时，表现决断，而内心时时反复，以致劳心费神。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """夭同化气为福，所以最宜入守福德宫，亦为福德宫最为祥瑞的星曜，主人享福。
 天同所主的享福，与武曲所主的享福不同。武曲为财星，所以其享福偏重于财帛
与物质，精神享受亦多由物质享受而来。天同为福星，他的最大享受是觉得心境愉
快。 
武曲的享福，可能是由于少作思虑，但天同的享福，却是由于人能为自己代作
安排，所以自己根本不必思虑。不过这样一来，也就容易造成天同的惰性。 
 天同的享福亦不同紫微、天府。紫府的享福是由于名成利就，所以生活优游。而
天同虽为福星却不主名利，无论境遇如何，只是懂得享受生活情趣。 
因此天同守福德宫的人，若入庙，心胸中常充满快乐情绪，是一个情绪化而且
性近天真的入。即使在工作，亦寓工作于乐趣，能在工作中找出一些情趣出来。 
天同守福德宫，常主其人喜好音乐。见文曜，则性喜文艺；见桃花诸曜，则性
喜修饰，且有特殊生活品味。 
天同与煞忌刑耗诸曜会合，仍主精神快乐，但物质生活则不丰裕。故可能为安
贫乐道的人。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """天同太阴同度，一般主享受。唯若太阴化忌，则主人外表享受而内心实多烦扰
不安。"""
                print(tmp)
                print("\n")
            elif(star == "天同巨门"):
                tmp = """ 天同巨门同度，必须无煞曜会照，始能安享。若见煞曜，则多空幻不实之想。人
的精神享受变成沉迷于白日梦之中。见天虚同度者尤确。 """
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """天同天梁同度，不宜再与天马会合，主人飘流无定。再见地空、地劫，则落陷
流离，唯其人却以浪荡为乐。若无空劫天马，则主物质生活安定，精神生活丰富，
全不见煞，更喜名士乐天的生活。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守福德宫，一般主人忙碌，或虽富裕，但仍多过虑，而且仍喜奔忙。或不
注意住宅的布置与装饰，有紊乱的感觉。化忌者尤确。
廉贞得会吉曜，仍主忙碌，但多享受。 
廉贞守福德宫的人，喜欢紧张生活，脑筋亦不平静，而且思想喜欢跑野马，不
能专注于一个问题的思考。 
廉贞与火铃同度，主为人浮躁。与羊陀同度，则常不能容忍别人，易起纷争困
扰。 
廉贞化忌守福德宫，则常见汲汲不可终日，多忧虑，又多无根之想、无稽之念。
更与空劫同度，物质生活困乏，而精神又觉空虚。见煞刑忌重者，则无人生乐趣。  
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天府" or star == "廉贞天相"):
                tmp = """廉贞唯喜与天府或天相同度、会照。无凶曜，反主人宽厚、稳重。见吉曜，则
一生快乐享受。唯仍热闹与奔忙。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞贪狼"):
                tmp = """ 廉贞贪狼同度，则主浮荡奔忙，思想偏向于追求物质享受。若更与桃花诸曜同会，则一生风流自赏。煞重者福薄。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀"):
                tmp = """廉贞七杀同度，则一生忙碌，虽加吉曜会照，仍见身心不安。且其人不擅长思
考，往往流于武断的短见。 """
                print(tmp)
                print("\n")
            elif(star == "廉贞破军"):
                tmp = """廉贞破军同度，主人不耐宁静，凡事举棋不定，因此举措时生变异，而增加了
奔忙与忧虑。若化忌，则终生无安定享受之日，仅寄情工作，以从艰苦中获得成功，
为最大的乐趣。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府入福德宫，主人思想稳重、宽厚。人若犯错，常生原谅之心。 
天府与禄存同度，则多花精神于理财之上。见陀罗同度，则主其人吝啬。 
天府守福德宫的人，一生寻求生活安定。所以很重视眼前的利益。当有新的事
业，或须变革旧业，便觉得紧张，多思多虑。
一般来说，会辅佐诸吉曜者，则主安宁；若与陀罗、火星同度会照，则常多无
中生有的忧虑；若与擎羊、天刑同度会照，则心多烦闷；若与空劫、大耗同度，则
主人不得安静，日夜奔忙。 

 天府与武曲七杀同时会照，则主身安心劳。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天府紫薇" and dizhi == "寅"):
                tmp = """天府与紫微同守于寅宫，则为真正能享福的人，一生少忧虑来困扰，能享清福。"""
                print(tmp)
                print("\n")
            elif(star == "天府廉贞"):
                tmp = """ 天府廉贞同度或会照，终觉精神享受不足，而物质享受则不虞。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守福德宫，入庙，主人倾向于享乐。但所谓享乐，却不纯是物质享受，而
是利用时代的物质文明，以作精神方面的享受，所以便显得高雅，或令人觉得有格
调。 
太阴主静，主藏，所以太阴守福德宫的人，一般均不肯奔走忙碌，宁可劳心。
故太阴化忌，多主其人外表安静，但内心则多思虑。
太阴守福德宫的人，思想不倾向于竞争，更不喜横生枝节，唯有时则偏向于理
想。若地空地劫同度，则主其人易流于空想而不是理想，一线之隔，相差甚远。 
若火星与陀罗同度，主人自寻忙碌。若擎羊与铃星同度，则其人追求理想永无
满足之日，易令人多思多虑，感觉到人生疲累。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阴天机"):
                tmp = """太阴与天机同度，主为人心忙。但思想则时易欠深思熟虑，然而却实在喜欢清
静。"""
                print(tmp)
                print("\n")
            elif(star == "太阴太阳"):
                tmp = """ 太阴太阳同度，最为福厚。但所谓福厚，有时却可能是人生欠积极。  """
                print(tmp)
                print("\n")
            elif(star == "太阴天同"):
                tmp = """ 太阴天同同度，其人有生活情趣。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守福德宫，入庙，主为人耽于物质享受，有嗜好，或耽于酒色，或耽于艺
术，或耽于宗教哲理。 
一般来说，与桃花诸曜会合者，耽于酒色；与文科诸曜会合者，耽于艺术；与空曜华盖会合者，耽于哲理。 
贪狼守福德宫有吉曜会合，其人风趣，喜笑谈。若无吉、落陷，则主物质生活不足，
唯风趣不改。 
贪狼会照辅佐吉曜，仅主物质享受丰足。 
若会照擎羊、陀罗、地空、地劫、大耗、天刑，则多气多争，物质生活与精神
生活均有欠缺。其嗜好亦偏于世俗与欲乐。
若会照火星、铃星，则对于享乐并无影响，唯主其人性急，或脾气暴躁、性格
刚烈。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门为暗曜，所以守福德宫时，即使入庙及会照辅佐吉曜，亦主为人好生是非，
且多疑多忌。所以便难免劳心费力去关照许多事务，事事亲力亲为。
若巨门化忌，则疑虑更重，进退犹豫，做事常半途而废。再见天机同度者，半
途改变之心更生，每每前功尽弃，以致耗费精神。且易时生追悔之心，不守信诺。
即使不化忌星，程度不过减轻。 
巨门守福德宫有辅佐吉曜会照，仅主其人享受物质生活，精神仍时时难以畅快。  
巨门守福德宫，若与擎羊、陀罗、火星、铃星同度或会照，则是非疑忌之心更
重，于是饱受精神压力。若见刑忌，则多口舌是非纷扰，令人身心俱疲。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门天同"):
                tmp = """天同同度，始能觉心安神宁，无疑虑、改变、追悔之心。"""
                print(tmp)
                print("\n")
            elif(star == "巨门太阳"):
                tmp = """ 与太阳同度，虽有太阳能化巨门之暗，唯太阳为浮动的星曜，所以虽能增加享
受，但仍主事事操心。  """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守福德宫，入庙者为人正直坦荡，具正义感，富同情心。若落陷地，则易
流为理想主义。当现实不如理想之时，则心绪不宁，或致偏激，由是多生是非枝节。
所以天相坐守福德宫，最不宜得武曲破军拱照，主人易生偏激情绪，或奔波劳
碌以求达到理想。再加空劫同度，则理想更流为空想，久而久之，变成易发白日梦，
多空想而少实际行动。
最喜得化禄、化权、化科(特别是天府化科会照)，更得辅佐吉曜会照，则主人
能面对现实，脚踏实地，以其宽厚坦诚的性格待人，终生精神生活丰满。 
若天相守福德宫而见煞曜同会，仍主不够沉稳踏实，以致达不到理想目标。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁为清贵之星，所以守福德宫时，一般均主其人精神生活重于物质生活。而且
思想脱俗，不易为一般人所理解。
在福德宫入庙，主其人乐天知命，胸怀旷达，喜清谈，少行动，即使行动亦一
片安暇，不肯奔波忙碌。 
若落陷，则性质变为懒散，性喜拖延，以致误事。或误以风月为名士风流，实
质思想庸常。天梁入庙，虽主观强，但做事有原则。若落陷，则原则可能变成固执。 
天梁与禄存或化禄同会，则作事易不明朗，且喜文过饰非，又多自以为是，于
是人生亦易见困扰。"""
        print(tmp)
        print("\n")
        if(dizhi == "巳" or dizhi == "亥"):
            tmp = """天梁在巳亥两宫，疑心极重，多思虑忧疑，以致为人欠沉稳厚重。若会煞曜，
尤其是见擎羊、陀罗者，主人有心计。天梁在巳、申、亥三宫守福德，会空劫、天马，主人浮荡。 """
            print(tmp)
            print("\n")
        elif(dizhi == "申"):
            tmp = """天梁在巳、申、亥三宫守福德，会空劫、天马，主人浮荡。 """
            print(tmp)
            print("\n")
        if(len(star) == 4):
            if(star == "天梁天机"):
                tmp = """天梁若与天机同度，而天机化忌者，心神不宁，烦恼滋生困扰。再见陀罗同度，
一生自寻烦恼；擎羊、火星、铃星同度或会照，则多是非纠纷。此皆由于固执与偏
见之故。 """
                print(tmp)
                print("\n")
            elif(star == "天梁太阳"):
                tmp = """ 唯太阳同度，见辅弼、魁钺、恩光、天贵、台辅、封诰、天巫等会照，始主人
泱泱大度，能坚守原则，且多助人之心，不生疑虑，故主心神爽朗。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守福德宫，入庙者，品格高尚，但易流为理想太高，故虽会辅佐吉曜，仅
主其人不易招嫌忌，仍因理想太高之故而少人缘。亦主妻子有刑克，妻宜迟娶、子
亦宜迟。 
 
七杀的理想偏高不同于天相。天相的理想有群体性质，例如有关整个社会制度，
或公司制度，但七杀的理想则纯粹属于个人：因此天相可以说是理想主义者，而七
杀则为个人主义者。  
七杀与羊、陀、火、铃、空、劫、大耗、天刑同度，则主人费尽心力，且奔波
劳碌不安。同时人缘不佳，易招嫌忌。
 女命七杀坐福德宫，以迟婚或同居为宜，否则恐有刑伤。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀紫薇"):
                tmp = """若与紫微同度，理想更高，故更易感觉人生不得志。 """
                print(tmp)
                print("\n")
            elif(star == "七杀武曲"):
                tmp = """ 最嫌与武曲同度而武曲化忌，则多是非多优虑，感到人生非常空虚。 """
                print(tmp)
                print("\n")
            elif(star == "七杀廉贞"):
                tmp = """ 与廉贞化忌同度，个人理想受到挫折，又往往不肯面对现实，于是仍多劳碌奔
走，以及心烦不宁。廉贞不化忌，则仅主忙碌，感情上不会受到挫折。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军守福德宫，入庙者善于决断，因此也就少了辛劳。若破军落陷，则凡事劳
心费力，且少决断，尤易生改变之心。亦正由于举棋不定，所以也就增加了人生的
困扰。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军武曲"):
                tmp = """若武曲化忌同度，主人易决断错误，昧于形势，因此凡事便多阻碍。 """
                print(tmp)
                print("\n")
            elif(star == "破军廉贞"):
                tmp = """ 若廉贞化忌同度，主人[应断不断，反受其乱]，以致举措犹豫，进退失据。 
若无化忌同度，破军守福德宫而会四煞，则仅主易招烦恼。但举措仍嫌不安定。 """
                print(tmp)
                print("\n")
            elif(star == "破军紫薇"):
                tmp = """ 唯紫微同度者，始能有自我陶醉之心，精神生活反为满足，但若会照煞曜，有
时亦易变为器小易盈。"""
                print(tmp)
                print("\n")
def GongChu12th(star, dizhi):
    if(star[:2] == "紫薇"):
        print(star, dizhi)
        print("\n")
        tmp = """紫微守父母宫，入庙，且会诸吉，主其人父母富贵，且无刑克。 
若落陷，则父母主见极强，易与自身发生意见。见煞曜则主不和。于大限流年
则为父母有危险灾病。 
凡父母宫有贪狼、红鸾、天喜、天姚等星曜同度，手有继母，或父亲有外遇、
偏房。 
倘命宫见火星、铃星独守，父母宫又有上述等情，则可能为过继出祀之命，主
有两重父母。――所谓两重父母，包括自己跟随父亲、母亲另嫁；或母亲再婚自己的生父等情形在内，不纯指出祀过继而言。唯在此种复杂情形下，父母宫多有左辅
右弼、文昌文曲同度。 
 (这种情形可用于其他星曜入守父母宫，不专指紫微入守而言。) 
紫微守父母宫，有擎羊、陀罗、化忌、天刑同度会照，主刑克。父母或有意外
之灾。或有重病。于命盘父母宫则主其人幼年跟父母关系疏远。一生亦少父母荫庇。
 (我们当然可将这种性质扩大，视为一段时期不受上 
司倚重；或常跟有交涉的管辖机构发生龃龉。)  
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "紫薇天府"):
                tmp = """紫微天府同度，主父母富贵，且无刑克。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇破军"):
                tmp = """ 紫微与破军同度或会照；主其人自小离家，否则有刑克，或代沟极深。 """
                print(tmp)
                print("\n")
            elif(star == "紫薇七杀"):
                tmp = """ 紫微七杀同度，见吉曜会合者无刑克，唯主父母威权，或性格强烈。见煞刑及
劫煞、孤辰等曜主刑克。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇天相"):
                tmp = """ 紫微天相同度，喜见天德、解神、天巫，主不克，见煞忌刑孤者主刑克。"""
                print(tmp)
                print("\n")
            elif(star == "紫薇贪狼"):
                tmp = """  
紫微贪狼同度，一般主不克。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "天机"):
        print(star, dizhi)
        print("\n")
        tmp = """天机为浮荡星曜，入守父母宫，主人远离父母，否则有刑伤克害。 
天机守父母宫，天马同度，或在对宫拱照，主人幼年离家；年长则入赘岳家。
一一在现代社会，这点意义又可转变为其人供养岳父岳母，但对亲生父母反而疏远。
天机守父母宫，与擎羊、陀罗、火星、铃星、地空、地劫、天刑、化忌、阴煞、
劫煞、孤辰等曜(总称[煞忌刑孤])同度或会照者，主幼年父母不全。或主重拜父母，
出祀他人，或有过房父母。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天机巨门"):
                tmp = """天机巨门同度，早年不利父母。命宫见火铃者亦主两重父母。 """
                print(tmp)
                print("\n")
            elif(star == "天机太阴"):
                tmp = """ 天机太阴同度会照；或天机天梁同度会照者，不主刑克。见三化吉曜，辅佐吉
曜者且主得父母荫庇。见煞忌刑孤诸曜如上述者则主父母有灾病。 """
                print(tmp)
                print("\n")
            elif(star == "天机天梁"):
                tmp = """ 天机天梁见煞忌刑孤多者，亦主父母主见极深，须小心调和代沟。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "太阳"):
        print(star, dizhi)
        print("\n")
        tmp = """太阳守父母宫，入庙，父母无刑克。更见三化、辅佐吉曜会照同度，则主受父
母爱宠。又主父母富裕，事业掌权。 
若落陷，则父亲不利。 
倘落陷化忌，而逢四煞、空劫、天刑者，须检视命盘中的太阴是否有煞同度，
如有煞，主克母。如无煞，反有吉星及天梁、天寿、解神、天福等星同度会照，则
主先克父。 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阳太阴"):
                if(dizhi == "丑"):
                    tmp = """太阳太阴在丑宫同度，不利父。太阳化忌一般主父多灾病；"""
                    print(tmp)
                    print("\n")
                elif(dizhi == "未"):
                    tmp = """在未宫同度不利母。太
阴化忌一般主母多灾病。"""
                    print(tmp)
                    print("\n")
            elif(star == "太阳巨门"):
                tmp = """ 太阳巨门同度，主与父亲不和，有代沟。  """
                print(tmp)
                print("\n")
            elif(star == "太阳天梁"):
                tmp = """ 太阳天梁同度，有吉星会照而无煞者，父母无刑克。若与煞刑诸曜同会，则主刑克、或远离父母，或重拜父母。"""
                print(tmp)
                print("\n")
                if(dizhi == "卯"):
                    tmp = """在卯宫同度且主得父母福
荫；"""
                    print(tmp)
                    print("\n")
    elif(star[:2] == "武曲"):
        print(star, dizhi)
        print("\n")
        tmp = """武曲带孤克刑忌性质，守父母宫，一般主刑克父母。 
若入庙，且有吉星同会，则宜过继出祀。或远离父母，则可免刑克。由于武曲
为财星，所以若于幼年或少年时，因自身灾病而破耗父母产业者，则亦无刑克。 
武曲在父母宫喜见天府、天寿，可免刑克。 
但武曲究竟带孤克的色彩，所以即使免刑克，亦主不受父母宠爱。 
若武曲在父母宫会照四煞、空劫、天刑、孤辰者，则幼年父母刑克，或灾或病。
更见忌星，主父母死亡，或患绝症，或父母家业凋零，经济困难。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "武曲七杀" or star == "武曲破军"):
                tmp = """武曲七杀、武曲破军同度或会照，皆主刑伤克害。  """
                print(tmp)
                print("\n")
            elif(star == "武曲天相"):
                tmp = """ 武曲天相同度，见吉无刑克；见煞忌则有伤克。 """
                print(tmp)
                print("\n")
        
    elif(star[:2] == "天同"):
        print(star, dizhi)
        print("\n")
        tmp = """天同为福星，但所谓[福]，有时则指其人少年艰辛，白手兴家立业。所以当入
守父母宫时，仍须注意其是否有刑克伤害的性质。 
天同入庙，主人少年父母双全，无克害刑伤。 
天同落陷，见辅佐吉曜，及天德、月德、天寿、天福者无刑伤克害。否则宜远
离父母或过继出祀。 
天同在父母宫与火铃羊陀、空劫天刑同会者亦主刑克，须过继出祀。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天同太阴"):
                tmp = """天同太阴同度，太阴化忌或在午宫同度者见煞刑而无吉解救，主先克母；若有
吉星解救而命盘中太阳落陷会照，则主先克父。若太阴天同在子宫同度，不见煞刑
者，主父母无刑克伤害。再见众吉会拱或同度，且主得父母荫庇。"""
                print(tmp)
                print("\n")
            elif(star == "天同天梁"):
                tmp = """ 天同天梁同度，不主刑克伤害，唯天同化忌，或会照四煞刑孤者，则仍主有克
害。若吉凶星曜并照，则主父子不和。 """
                print(tmp)
                print("\n")
            elif(star == "天同巨门"):
                tmp = """ 天同巨门同度，主父子不和，或父子年龄相差甚大。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "廉贞"):
        print(star, dizhi)
        print("\n")
        tmp = """廉贞守父母宫为恶曜，一般均不利父母，有刑伤克害，轻者亦主不受父母荫庇，
或感情欠佳。 
廉贞于父母宫落陷，或化忌，须出祀或过继，或重拜父母。 
廉贞与天马、天虚同度或会照，则主幼年远离父母。  
若廉贞守父母宫，有红鸾、天喜、成池、天姚、天刑同度或会照，主其人为偏
房继室所生。否则主父亲有外遇。在现代社会，亦可能主母亲有两次婚姻。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "廉贞天府" or star == "廉贞天相"):
                tmp = """若得天府、天相同
度或会照，且见天福、天寿等吉曜者则为有解救，克害程度减轻，仅主感情不洽。"""
                print(tmp)
                print("\n")
            elif(star == "廉贞七杀" or star == "廉贞破军" or star == "廉贞贪狼"):
                tmp = """ 廉贞与七杀、破军、贪狼会照或同度者，皆主父母刑伤。更见四煞、空劫、天
刑、孤辰、阴煞，则主刑克死亡，或遭重大灾祸，或有危症绝症。 """
                print(tmp)
                print("\n")
           
    elif(star[:2] == "天府"):
        print(star, dizhi)
        print("\n")
        tmp = """天府守父母宫一般均主父子感情和洽。亦主人幼年父母双全。 
但若天府与擎羊同宫，则亦主父子意见不和。喜见诸吉，皆主受父母福荫。但若禄存同度者，则主父母喜掌财权，老年亦不
肯交托与自身。更见兄弟宫有是非纷争星曜，则主父母对自身有偏见，则权交与兄
弟姐妹。 
天府在父母宫，会照擎羊、陀罗、火星、铃星、空劫、天刑者，仍主父母有刑
伤。宜分居，或出祀过继。"""
        print(tmp)
        print("\n")
    elif(star[:2] == "太阴"):
        print(star, dizhi)
        print("\n")
        tmp = """太阴守父母宫，入庙，有吉曜同会者，主父母双全，无刑克伤害。 
若太阴落陷，则无母亲福荫，或母亲早亡或母亲离婚再嫁，自身则跟随父亲；
或母亲于自己幼年时多病能对自己照料。须详会合星曜而定。一般见桃花、天刑主
再嫁；见天月、天虚、阴煞则主患病，见化忌及煞刑主者死亡。 
凡太阴化忌于父母宫，仍须检视命盘太阳，若落陷见煞刑者主父先死。父死则
母寡，亦合太阴化忌的性质 
太阴会四煞、天刑、化忌、阴煞、孤辰、天虚者、幼年须过继。见天马则主远
离，否则有刑伤克害。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "太阴太阳"):
                if(dizhi == "丑"):
                    tmp = """太阴太阳同度，在丑宫者不利父；"""
                    print(tmp)
                    print("\n")
                elif(dizhi == "未"):
                    tmp = """太阴太阳同度，在未宫不利母。"""
                    print(tmp)
                    print("\n")
            
    elif(star[:2] == "贪狼"):
        print(star, dizhi)
        print("\n")
        tmp = """贪狼守父母宫，入庙、化禄、化权、或会照吉曜者，父母无刑克。 
若贪狼化忌，会擎羊、陀罗、火星、铃星、天刑、地空、地劫者，宜早年远离
父母或出祀，否则主有刑克。再见天月、阴煞同度，则父母有灾病。有天德、天寿、
天福同度，则有解救。 
贪狼入父母宫，一般主父母子女感情和洽，但有自私自利之心。 
"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "贪狼廉贞"):
                tmp = """若贪狼与廉贞同度，或见红鸾、天喜、天刑、天姚、成池者，主其人为偏房继
室所生，否则主有刑克。大限流年见者，主父亲老尚风流，或仍多风花雪月的应酬，
否则主父母沉溺于嗜好。"""
                print(tmp)
                print("\n")
            
    elif(star[:2] == "巨门"):
        print(star, dizhi)
        print("\n")
        tmp = """巨门为暗曜，守父母宫不利，可视为恶曜。一般情形，均应过继出祀，重拜父
母，否则主刑伤克害。 
巨门守父母宫，喜见化禄、化权、禄存同度或会照，无煞刑者，主父母富裕。
更见天巫同度会照，主父母何遗产。 
若会火、铃、羊、陀、空、劫、刑、忌，则主父母有刑伤克害，或多是非词讼"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "巨门太阳"):
                tmp = """巨门太阳同度，两代多无谓争吵。"""
                print(tmp)
                print("\n")
            elif(star == "巨门天同"):
                tmp = """巨门天同同度，主祖产父业逐渐消磨，或祖业不守，为他人所夺。亦主不利父
母，少年时父母难以两全。 """
                print(tmp)
                print("\n")
            elif(star == "巨门天机"):
                tmp = """天机巨门同度，克害刑伤的性质更重。巨门化忌，则父子多是非口舌，天机化
忌，两代各怀机心。 """
                print(tmp)
                print("\n")
    elif(star[:2] == "天相"):
        print(star, dizhi)
        print("\n")
        tmp = """天相守父母宫，若逢[财荫夹印]者，主父母富贵长寿。若逢[刑忌夹印]者，则
主父母有刑克灾伤病祸。 
一般情形下，天相入庙守父母宫，无刑克。若落陷，见吉者无克，见煞星恶曜
则有刑伤灾病。  
天相会魁钺、辅弼、解神、天德、天巫、天寿者，虽见煞忌亦主有解救。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天相武曲"):
                tmp = """最不喜武曲同度，主有刑伤克害。武曲化忌者尤甚。若武曲化忌，主父母有灾
病，煞刑诸曜重者，患绝症急病。"""
                print(tmp)
                print("\n")
            elif(star == "天相廉贞"):
                tmp = """廉贞同度，亦主有刑伤灾病，化忌者，或两代感情决裂，或父母有血光危症。 
同会四煞者早年有克。更见刑忌克重，宜远离父母或重拜父母。 """
                print(tmp)
                print("\n")
            
    elif(star[:2] == "天梁"):
        print(star, dizhi)
        print("\n")
        tmp = """天梁化气为荫，入父母宫为祥曜。 
若化禄、化权、化科同度或会照，均主得父母荫庇，且主有遗产，见天巫同会
者更确。唯不喜与禄存同度，主两代不和，更见煞刑等曜，则主遗产纷争。 
天梁落陷，一般均主刑伤克害。 
天梁会擎羊、天马，主人少年离家。煞重者则主再拜父母或入赘承祧。 
 """
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "天梁天同"):
                tmp = """天同同度，一般不主刑伤克害。无煞，见天马，则主父子缘份浅，或父亲常离
家庭，或自身远离父母。唯天同若化忌，会煞，则亦主有刑伤。或两代不和，亦宜
出祀重拜。 
天同天梁同度，主幼年父母离家。"""
                print(tmp)
                print("\n")
            elif(star == "天梁太阳"):
                tmp = """太阳天梁同度，会吉者无刑伤克害。在卯宫者更主得父母福荫；在舀寓莆则父
业消磨。若见煞曜，仍主刑分离，重拜父母或入赘承祧。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "七杀"):
        print(star, dizhi)
        print("\n")
        tmp = """七杀守父母宫为恶曜。一般均主早年离家，或父母有刑伤克害。 
七杀若会照擎羊、陀罗、火星、天刑、地空、地劫、劫杀、孤辰者，刑伤克害
甚重。唯天德、月德、天福、天寿可作解救。见紫微及天相会照者尤确，可以化险
为夷。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "七杀武曲" or star == "七杀廉贞"):
                tmp = """七杀与廉贞、武曲同度，均对父母不利。化忌者灾病，更见煞刑诸曜，则或父
母死亡，或父母事业崩败，或见重灾危症。"""
                print(tmp)
                print("\n")
            elif(star == "七杀紫薇"):
                tmp = """七杀唯与紫微同度，见吉星祥曜，始无刑克伤害。"""
                print(tmp)
                print("\n")
    elif(star[:2] == "破军"):
        print(star, dizhi)
        print("\n")
        tmp = """破军于父母宫亦为恶曜，性质略同七杀。  
若破军与辅、弼同度，见煞刑忌者，主有病重父母。破军守父母宫，主不守祖
业，或祖业耗散。"""
        print(tmp)
        print("\n")
        if(len(star) == 4):
            if(star == "破军武曲" or star == "破军廉贞"):
                tmp = """最嫌武曲、廉贞同度，尤不喜化忌。唯喜紫微同度且会吉曜，则可免刑伤克害。
一般情况下，破军守父母宫，均主刑伤父母，或感情不洽，无论父母存亡皆主
孤独。宜远离父母，或出祀、入赘，或重拜父母。"""
                print(tmp)
                print("\n")
            




