
#杂曜细节

def ZaYaoDetail(str):

    if str=='文昌':
        print('''星曜名称 文昌
属性 金
在观感 点、刺、扎、密集的斑点''')
    if str=='文曲':
        print('''星曜名称 文曲
属性 水／木
在观感
一段一段的、阶段性出现且会转移的、可膨胀收缩的、堵塞膨胀、给压力会转移但可能会重新恢复的、难以想象的、想象过渡的、产生误会的、因某事转移、挤压过后弹回、挤压变形后可恢复的、积攒后发送''')
    if str=='火星':
        print('火星')
        print('''星曜名称 火星
属性 火／气
在观感
散发光和热、热量高、火辣、人流多
        ''')

    if str=='铃星':
            print('铃星')
            print('''星曜名称 铃星
属性 金／气／电
在观感
一种耿耿于怀的感受、刺挠、嫉恨、难以忍受、讨厌、惊讶、惊恐、恐惧、阴影、嫉妒、噪音、音乐
                ''')
    if str=='地劫':
        print('地劫')
        print('''属性 金／气
在观感
破坏、劫夺、时间、循环节点、中断、考验、关卡、任务、历练、循环
                ''')
    if str=='地空':
        print('地空')
        print('''星曜名称 地空
属性 气
在观感
看不见的、消失、有变无、速度快的、落空、轻飘飘的
                ''')
    if str=='台辅':
        print('台辅')
        print('''星曜名称 台辅
属性 土／木
在观感
台阶、塔、阁楼、上层、多层次、上层的、跨越层次的、辅助登高的、更引人注目的
                ''')
    if str=='封诰':
        print('封诰')
        print('''星曜名称 封造
属性 木／金
在观感
封锁、封赏、通知、管理方的审核、单据、主要指我国古代社会帝王对有功之官员及其先代和妻室授予封典的诰命
                ''')
    if str=='左辅':
        print('左辅')
        print('''星曜名称 左辅
属性 木
在观感
同时存在的人／事／物、替补
                ''')
    elif str=='右弼':
        print('''星曜名称 右粥
属性 木／金
在观感
连续、多发、辅助、效率高、备用、右边
                ''')
    elif str=='天刑':
        print('天刑')
        print('''星曜名称 天刑
属性 金／木／火／电
在观感
多个竖条或格子的阻挡物、阻拦、审判、隔离
                ''')
    elif str=='天姚':
        print('天姚')
        print('''星曜名称 天姚
属性
在观感
八面玲珑、有韵律的、掌握节奏的、才艺多的、来回转的、太姒与周文王的故事、身手敏捷的、思维灵活的、脑子转得快的、不稳重的、三心二意的、游刃有余的
                ''')
    if str=='天马':
        print('天马')
        print('''星曜名称 天马
属性 木／气
在观感
起伏移动、天马行空、跳跃性、跳脱感
                ''')
    if str=='解神':
        print('解神')
        print('''星曜名称 解神
属性 土／木
在观感
解开、解除、分裂、解体、解冻、脱落、解决、瓦解
                ''')

    if str=='天巫':
        print('天巫')
        print('''星曜名称 天巫
属性 火／水／木／电
在观感
混合反应、祈祷祝福、神奇的事物、电磁物品、在液体里加入物体搅拌、多个物品混合、多种物品混合发酵物
                ''')

    if str=='天月':
        print('天月')
        print('''星曜名称 天月
属性 土／火
在观感
折射光线、隐约发光、女性、阴柔、向内
                ''')

    if str=='阴煞':
        print('阴煞')
        print('''星曜名称 阴煞
归类 库星
属性 火／气／电
在观感
谋划、暗中进行、暗中笼罩、暗中操控、使变得更紧、在水中消亡的事物、异域空间的能量、松果体感受到的能量、肉眼看不到的事物、看不见的洞
                ''')

    if str=='恩光':
        print('恩光')
        print('''星曜名称 恩光
属性 气／火
在观感
黑暗中的光、莫大的恩惠、感恩、礼物
                ''')
    if str=='天贵':
        print('天贵')
        print('''星曜名称 天贵
属性 土／金／气
在观感
昂贵的、价格高的、品质高的
                ''')

    if str=='三台':
        print('三台')
        print('''星曜名称 三台
属性
在观感
座位多、人多（与八座类似，有程度区别，但实际上也可以同程度，按实际情况本身基础来定）
                ''')
    if str=='八座':
        print('八座')
        print('''星曜名称 八座
属性 土／木
在观感
大舞台、观众多、座位多、名气大、场面大（与三台有程度的区分，也可同程度，按实际基础层次来参考）
                ''')
    if str=='禄存':
        print("禄存")
        print('''星曜名称 禄存
属性 土／木
在观感
左右为难、前后夹击、危机四伏、私藏、重视的感觉、把＊＊当宝贝的感受、监控、害怕被偷走、害怕受到伤害、被逼无奈、存储、门槛高、不轻易出入、流通性不高、内外窥探
                ''')

    if str=='擎羊':
        print('擎羊')
        print('''星曜名称 擎羊
属性 火／金
在观感
动能强劲的事物、非常用力
                ''')

    if str=='陀罗':
        print("陀罗")
        print('''星曜名称 陀罗
属性 气／金
在观感
圆形／球体、旋转的物体、会被卷入的感受、有自己的运行轨道、拖延、拖累、拖沓、磨
                ''')

    if str=='天魁':
        print("天魁")
        print('''星曜名称 天魁
属性 木／火／水／电
在观感
暗中做出决定、灵异的、暗中审查、高大的、优越感、暗中帮助''')
    if str=='天钺':
        print("天钺")
        print('''星曜名称 天钺
属性 金
在观感
工具、杠杆、作弊、投机取巧、偏门、借力打力、特殊的手段辅助事件顺利完成、省时省力的物品、有优越感
                ''')
    if str=='天官':
        print("天官")
        print('''星曜名称 天官
属性 木／气
在观感
预测分析、推理、前卫、对未来局势比较敏感的人、获得第一手信息的人、向上的职权
                ''')
    if str=='天福':
        print("天福")
        print('''星曜名称 天福
属性 土／木／气
在观感
发送请求＋回应需求、好的方向发展的欲求、顺利、心想事成
                ''')

    if str=='天空':
        print('天空')
        print('''星曜名称 天空
属性 气
在观感
天空、空气、空无、在空中、气体
                ''')
    if str=='天哭':
        print('天哭')
        print('''星曜名称 天哭
属性 水／火
在观感
液体留下来、想让他人知道的、宣扬、闹事、哭诉、委屈的
                ''')
    if str=='天虚':
        print('天虚')
        print('''星曜名称 天虚
属性 土／电／气
在观感
看不清、虚拟、虚弱、重量轻的、无力的、虚空
                ''')
    if str=='龙池':
        print('龙池')
        print('''星曜名称 龙池
属性 土／水木／金
在观感
装水的容器、其中有非凡的事物的一个环境、一个容纳物品的环境或器具、隐藏实力
                ''')
    if str=='风阁':
        print('凤阁')
        print('''星曜名称 风阁
属性 土／木／气
在观感
装饰、审美、精致的空间、女性／雌性所在的空间、豪华、有修饰过的空间
                ''')
    if str=='红鸾':
        print('红鸾')
        print('''星曜名称 红鸾
属性 火／水／木
在观感
由黑到红、燃烧飞行、发光的飞行物、调戏、浪漫、恋爱、重生、死亡
                ''')
    if str=='天喜':
        print('天喜')
        print('''星曜名称 天喜
属性 水／火／木
在观感
幽默、传染病、怀孕、红白喜事
                ''')
    if str=='蜚廉':
        print('蜚廉')
        print('''星曜名称 蜚蠊
属性
在观感
麻烦的、难清理的、不干净的、粉末状的、细小又多的、带病菌的、会传染的、可以飞行的
                ''')
    if str=='破碎':
        print('破碎')
        print('''星曜名称 破碎
属性 气／金
在观感
破碎的、拼凑的、凌乱的
                ''')
    if str=='孤辰':
        print('孤辰')
        print('''星曜名称 孤辰
属性
在观感
单独、孤品、距离感、孕育、无性繁殖、隔离、卷曲的、延展、突然苏醒的、震动
                ''')
    if str=='寡宿':
        print('寡宿')
        print('''星曜名称 寡宿
属性 木／土
在观感
单独、被动一个人、专利、素来就有、一晚上、隔夜的、隐含、减少、缺少
                ''')
    if str=='天才':
        print('天才')
        print('''星曜名称 天才
属性 土／气
在观感
有潜质的，才露出苗头的、正在发展的、往下延伸的、扎根较深的、露出部分比藏起来的部分少
                ''')
    if str=='天寿':
        print('天寿')
        print('''星曜名称 天寿
属性 气／木
在观感
引导、延续、延长、维修、使时间更长的
                ''')
    if str=='天伤':
        print('天伤')
        print('''星曜名称 天伤
属性 木／金
在观感
影响、消耗、伤害、减少、汲取能量、只要社交就会融合你们彼此的能所以天伤固定在兄友线量，你们在这个大的能量范围内随机取用，可能造成对方偷走你的能量，
                ''')
    elif str=='天使':
        print('天使')
        print('''星曜名称 天使
属性
在观感
传递、无偿帮助
                ''')